const e={map:'[{"runtime":["0.0"],"results":["0.1","0.5"],"theme":["0.2","0.6"],"page":["0.3","0.4","0.7","0.8"],"more":["0.9"],"两行代码":["1.0"],"项目":["1.1"],"运行":["1.2"],"stable":["2.0"],"原理":["3.0"],"加密":["3.1"],"哈希":["3.2"],"共识算法":["3.3"],"基于共识的智能合约":["3.4"],"跨境电商":["4.0"],"coding":["5.0","56.0"],"life":["5.1"],"测试环境表结构同步到生产环境":["6.0"],"使用frp实现内网穿透管理物联网设备":["7.0"],"课代表立正":["8.0"],"gpt4":["8.1"],"static关键字":["9.0"],"jenkins":["10.0"],"联系我":["11.0"],"h1":["12.0"],"h2":["12.1"],"h3":["12.2"],"h4":["12.3"],"h5":["12.4"],"h6":["12.5"],"horizontal":["12.6"],"typographic":["12.7"],"emphasis":["12.8"],"blockquotes":["12.9"],"lists":["12.10"],"code":["12.11"],"tables":["12.12"],"links":["12.13"],"images":["12.14"],"plugins":["12.15"],"emojies":["12.16"],"subscript":["12.17"],"ins":["12.18"],"mark":["12.19"],"footnotes":["12.20"],"definition":["12.21"],"abbreviations":["12.22"],"custom":["12.23"],"js中调用c":["13.0"],"实现方式":["13.1"],"api":["14.0"],"左耳听风":["15.0"],"分割一切的py":["16.0"],"springboot":["17.0"],"项目启动":["18.0"],"生成式ai":["19.0"],"多维数据向量存储词性":["19.1"],"自注意力":["19.2"],"知识库":["20.0"],"qiankun":["21.0","43.0"],"其他":["21.1"],"backend":["22.0"],"自定义线程池":["22.1"],"业务场景":["22.2","28.1"],"核心线程数":["22.3"],"最大线程数":["22.4"],"工作队列":["22.5"],"osi":["22.6"],"tcp":["22.7"],"effective":["22.8"],"词典实现":["23.0"],"需求背景":["23.1"],"核心功能":["23.2"],"组件设计":["24.0"],"css踩坑":["25.0"],"depends":["26.0"],"常用docker操作":["27.0"],"长列表大表单性能优化":["28.0"],"落地选型":["28.2"],"技术难点":["28.3"],"前端代码规范":["29.0"],"calculator":["30.0"],"docker":["31.0"],"步骤":["31.1"],"lambda表达式":["32.0"],"jssip":["33.0","33.2","58.6"],"折腾的起因":["33.1"],"折腾freeswitch":["33.3"],"k8s":["34.0"],"kubernetes解决了什么问题":["34.1"],"container":["34.2"],"部署流程":["34.3"],"主从机器":["34.4"],"pod":["34.5"],"mysql":["35.0","55.3"],"默认引擎":["35.1"],"关闭mysql的strict":["35.2"],"总结":["35.3"],"做题内容":["35.4"],"总结难点":["35.5"],"nacos":["36.0"],"位运算":["37.0"],"消除异步传染性":["37.1"],"非对称加密":["37.2"],"vo":["37.3"],"next":["38.0"],"项目脚手架":["38.1"],"sse功能开发":["38.2"],"wps":["39.0"],"技术选型":["39.1"],"面板配置":["39.2"],"业务开发":["39.3"],"clickone部署":["39.4"],"构建兼容wps":["39.5"],"插件效果":["39.7"],"过程中坑":["39.8"],"onlyoffice":["40.0"],"服务端渲染docx":["40.1"],"接入cdn文件渲染":["40.2"],"替换web":["40.3"],"打包你的js":["42.0"],"css隔离":["43.1"],"js隔离":["43.2"],"子应用加载方式":["43.3"],"乾坤子应用keepalive":["43.4"],"缓存场景下":["43.5"],"状态管理":["43.6"],"润词典":["44.0"],"进度汇总":["44.1"],"项目介绍":["44.2"],"接口":["44.3"],"添加单词本":["44.4"],"私有单词本内":["44.5"],"接口实现":["44.6"],"reactnative":["45.0"],"rn":["45.1"],"reactnative安装":["45.2"],"按照官网文档部署即可":["46.0"],"java版本管理":["47.0"],"idea":["47.1"],"本地环境java版本":["47.2"],"shared":["48.0","48.1"],"参考资料":["48.2"],"苍穹外卖":["49.0"],"ssm实践":["49.1"],"pojo":["49.2"],"common":["49.3"],"server":["49.4"],"autofill注解":["49.5"],"mybatis插件":["49.6"],"entity中的":["49.7"],"mybatis":["49.8"],"type":["50.0"],"组件二次封装":["51.0"],"keep":["52.0"],"nexttick":["52.1"],"forceupdate":["52.3"],"unref":["52.4"],"three":["53.1"],"迭代日志":["53.2"],"add":["53.4","53.7","53.12"],"压缩方式基本原理":["53.5"],"removed":["53.10"],"fixed":["53.14"],"changed":["53.16","53.17"],"learn":["53.18","53.20"],"why":["53.19"],"how":["53.21"],"一些思考":["53.22"],"什么场景需要web":["53.23"],"微信相关业务逻辑":["54.0"],"微信公众号登陆":["54.1"],"微信支付":["54.2"],"api开放平台":["55.0"],"gateway":["55.1"],"todo":["55.2"],"注册接口的逻辑":["55.4"],"yuapiclient":["55.5"],"invoke":["55.6"],"这一年":["57.1"],"当然":["57.2"],"朋友们的反馈和建议":["57.3"],"新的一年的计划":["57.4"],"上上份工作难点":["58.0"],"等保三级处理":["58.1"],"onlyoffice项目":["58.2"],"c":["58.3"],"小程序项目":["58.4"],"websocket":["58.5"],"trtc":["58.7"],"electron项目":["58.8"],"最近一份工作的难点":["59.0"],"seo":["59.1"],"微前端":["59.2"],"虚拟列表":["59.3"],"动画":["59.4"],"小程序路由权限校验":["59.5"],"weboffice定制功能":["59.6"],"博客系统推荐":["60.0"],"使用linux命令":["61.0"],"postman":["62.0"],"https":["64.0"]},{"0":["18.0","39.2"],"1":["12.20","12.21","17.0","18.0","22.1","25.0","28.2","30.0","33.2","33.4","34.1","35.4","38.2","39.1","39.2","39.4","39.5","39.8","44.1","53.5","59.2"],"2":["18.0","33.5","35.4","44.1"],"3":["18.0","35.4"],"4":["18.0"],"8":["18.0","39.2"],"10":["18.0"],"11":["18.0"],"18":["18.0"],"20":["35.4"],"60":["35.4"],"500":["35.4"],"609":["18.0"],"802":["18.0"],"2023":["53.3","53.6","53.8","57.0"],"43708":["18.0"],"50000":["55.6"],"10781466":["18.0"],"api":["0.0","39.1"],"examples":["0.0"],"this":["0.0","12.8","12.22"],"page":["0.0"],"demonstrates":["0.0"],"data":["0.2","0.3","0.6","0.7","12.12","18.0","55.6"],"frontmatter":["0.4","0.8"],"check":["0.9"],"运行llm":["1.0"],"ollama":["1.1"],"win11":["1.2"],"wsl":["1.2"],"ubuntu22":["1.2"],"diffusion":["2.0"],"ui实操":["2.0"],"数字签名":["3.1"],"默克尔树":["3.2"],"solidty":["3.4"],"明通":["4.0"],"user":["5.0"],"can":["5.1","12.9"],"dump":["6.0"],"知乎":["7.0"],"目前有代差":["8.1"],"技术发展是s型曲线":["8.1"],"举例计算机产生有5次":["8.1"],"表象差距大":["8.1"],"静态变量在以下情况下比较合适":["9.0"],"共享数据":["9.0"],"当某个数据需要在类的所有实例之间共享时":["9.0"],"gitee":["10.0","64.0"],"cicd":["10.0"],"配置":["10.0","49.8"],"安装jenkins镜像":["10.0"],"邮箱":["11.0"],"heading":["12.0","12.1","12.2","12.3","12.4","12.5"],"rules":["12.6"],"replacements":["12.7"],"enable":["12.7"],"typographer":["12.7"],"is":["12.8","12.22","18.0"],"unordered":["12.10"],"create":["12.10"],"a":["12.10","18.0"],"list":["12.10","18.0"],"by":["12.10","18.0","35.4"],"starting":["12.10"],"line":["12.10"],"with":["12.10"],"or":["12.10","35.4"],"inline":["12.11"],"indented":["12.11"],"option":["12.12"],"description":["12.12","59.1","59.2"],"path":["12.12"],"to":["12.12","18.0","53.21"],"files":["12.12"],"supply":["12.12"],"link":["12.13","12.20"],"text":["12.13","17.0"],"minion":["12.14"],"stormtroopocat":["12.14"],"like":["12.14","35.4"],"links":["12.14"],"the":["12.15","18.0"],"classic":["12.16"],"markup":["12.16"],"superscript":["12.17"],"inserted":["12.18"],"marked":["12.19"],"footnote":["12.20"],"lists":["12.21"],"term":["12.21"],"html":["12.22","31.1"],"containers":["12.23"],"方法":["13.0"],"使用node":["13.1"],"addons":["13.1"],"node官方的":["13.1"],"npm":["13.2"],"一些优质的官方prompt":["14.0"],"https":["14.0","18.0","37.0","39.7"],"程序员如何用技术变现":["15.0"],"关注有价值的东西":["15.0"],"价值取决于供需关系":["15.0"],"分清什么是主流技术":["15.0"],"什么是过渡式的技术":["15.0"],"图形分割":["16.0"],"配置篇":["17.0"],"alt":["17.0","54.1"],"多环境配置":["17.0"],"点击可以切换环境":["17.0"],"pom":["17.0"],"xml":["17.0","18.0","39.2","44.6","49.8"],"启动依赖安装问题":["18.0"],"从pom":["18.0"],"xml中看java":["18.0"],"maven版本":["18.0"],"本机java版本也要与项目要求java版本一致":["18.0"],"内网包无法拉到":["18.0"],"需要配置maven私有仓库":["18.0"],"todo":["18.0","39.3"],"解决私有仓库配置":["18.0"],"pre":["18.0"],"class":["18.0","35.4"],"console":["18.0"],"output":["18.0"],"started":["18.0"],"timer":["18.0"],"running":["18.0"],"as":["18.0"],"system":["18.0","45.2"],"building":["18.0"],"in":["18.0"],"workspace":["18.0"],"jenkins":["18.0"],"test2":["18.0"],"xizhao":["18.0"],"java":["18.0","22.8","32.0","44.5"],"ins":["18.0"],"recommended":["18.0"],"git":["18.0"],"tool":["18.0"],"none":["18.0"],"using":["18.0"],"credential":["18.0"],"5bc2":["18.0"],"4ab2":["18.0"],"90da":["18.0"],"91285e13c47a":["18.0"],"gt":["18.0"],"rev":["18.0"],"parse":["18.0"],"resolve":["18.0"],"dir":["18.0"],"timeout":["18.0"],"fetching":["18.0"],"changes":["18.0"],"from":["18.0","31.1","35.4"],"remote":["18.0"],"repository":["18.0"],"config":["18.0"],"origin":["18.0"],"url":["18.0"],"href":["18.0"],"http":["18.0"],"gitlab":["18.0"],"raritag":["18.0"],"cn":["18.0"],"backend":["18.0"],"business":["18.0"],"platform":["18.0"],"institution":["18.0"],"upstream":["18.0"],"version":["18.0","39.2"],"askpass":["18.0"],"set":["18.0","45.2","49.8"],"credentials":["18.0"],"fetch":["18.0"],"tags":["18.0"],"progress":["18.0"],"refs":["18.0"],"heads":["18.0"],"remotes":["18.0"],"test":["18.0","49.8"],"commit":["18.0"],"checking":["18.0"],"out":["18.0"],"revision":["18.0"],"3edab892f3efe98472bafba406e5b324398e509d":["18.0"],"core":["18.0","22.3"],"sparsecheckout":["18.0"],"checkout":["18.0"],"f":["18.0","34.3"],"message":["18.0","55.6"],"merge":["18.0"],"branch":["18.0"],"prod":["18.0"],"into":["18.0"],"no":["18.0"],"walk":["18.0"],"bin":["18.0"],"sh":["18.0"],"xe":["18.0"],"tmp":["18.0"],"jenkins8726267618464466461":["18.0"],"home":["18.0"],"var":["18.0"],"local":["18.0"],"jdk":["18.0"],"apache":["18.0"],"maven":["18.0"],"mvn":["18.0"],"clean":["18.0"],"install":["18.0","47.2"],"dmaven":["18.0"],"skip":["18.0"],"true":["18.0"],"u":["18.0"],"info":["18.0"],"scanning":["18.0"],"for":["18.0"],"projects":["18.0"],"downloading":["18.0"],"rdc":["18.0"],"snapshots":["18.0"],"repo":["18.0"],"aliyun":["18.0"],"com":["18.0","37.0","53.0"],"snapshot":["18.0"],"4gwswi":["18.0"],"dependency":["18.0"],"center":["18.0"],"metadata":["18.0"],"releases":["18.0"],"release":["18.0"],"x4vplw":["18.0"],"archetype":["18.0"],"b":["18.0"],"downloaded":["18.0"],"at":["18.0"],"s":["18.0","37.0"],"避免生成错误":["19.2"],"内容导航":["20.0"],"子应用更新异常":["21.0"],"js级别的缓存解决方案":["21.1"],"interview":["22.0"],"核心业务场景":["22.2"],"pool":["22.3"],"maximum":["22.4"],"work":["22.5"],"queue":["22.5"],"七层模型是什么样的":["22.6"],"如何保证可靠连接":["22.7"],"支持自添加单词的单词本":["23.1"],"实现概述":["23.2"],"查词":["23.2"],"避免冗余数据":["24.0"],"offsettop是相对relative的父级":["25.0"],"on":["26.0"],"docker":["27.0","57.1"],"vue2":["28.1"],"虚拟列表路线":["28.2"],"简略列表":["28.3"],"文件名建议全部连字符":["29.0"],"使用flutter构建的计算器demo":["30.0"],"nginx":["31.0","31.1"],"yourservicename":["31.1"],"youdomin替换成你自己的":["31.1"],"证书下载":["31.1"],"腾讯云":["31.1"],"dockerfile":["31.1"],"latest":["31.1"],"copy":["31.1"],"cert":["31.1"],"etc":["31.1"],"usr":["31.1"],"share":["31.1"],"conf":["31.1"],"d":["31.1"],"default":["31.1"],"idsspaceareaservice":["32.0"],"renegotiaton":["33.0"],"需要帮朋友解决renegotiaton的问题":["33.1"],"关键api":["33.2"],"监听renegotiate":["33.2"],"一个开源的容器编排平台":["34.0"],"应用程序部署和管理":["34.1"],"自动化应用程序的部署":["34.1"],"扩缩容和滚动更新":["34.1"],"减少了手动操作的风险和开销":["34.1"],"支持批量管理和编排多个应用程序及其依赖关系":["34.1"],"容器运行时":["34.2"],"master安装k8s集群模式的包":["34.3"],"node节点安装子节点需要的包":["34.3"],"配置master":["34.3"],"node节点":["34.3"],"集群中直接根据配置文件起对应服务":["34.3"],"kubectl":["34.3"],"apply":["34.3"],"frontend":["34.3"],"deployment":["34.3"],"yaml":["34.3"],"service":["34.3"],"master":["34.4"],"container":["34.5"],"pod是kubernetes中最小的可部署单元":["34.5"],"innodb":["35.1"],"myisam":["35.1"],"和":["35.1","45.1","52.4"],"是":["35.1"],"mysql":["35.1"],"数据库中的两个存储引擎":["35.1"],"它们在功能和性能上有一些区别":["35.1"],"让我详细解释一下":["35.1"],"事务支持":["35.1"],"支持事务":["35.1"],"而":["35.1"],"mode":["35.2"],"注释掉":["35.2"],"my":["35.2"],"join":["35.3","35.5"],"inner":["35.3","35.5"],"select":["35.4","44.6"],"name":["35.4"],"score":["35.4"],"student":["35.4"],"where":["35.4"],"not":["35.4"],"李":["35.4"],"请在此处输入":["35.4"],"sql":["35.4"],"请编写一条":["35.4"],"查询语句":["35.4"],"从名为":["35.4"],"的数据表中选择出所有不重复的班级":["35.4"],"id":["35.4","44.5","44.6","49.8"],"和考试编号":["35.4"],"exam":["35.4"],"num":["35.4"],"的组合":["35.4"],"distinct":["35.4"],"的数据表中选择出学生姓名":["35.4"],"年龄":["35.4"],"age":["35.4"],"和成绩":["35.4"],"首先按照成绩从大到小排序":["35.4"],"如果成绩相同":["35.4"],"则按照年龄从小到大排序":["35.4"],"order":["35.4"],"desc":["35.4"],"asc":["35.4"],"的数据表中选择学生姓名":["35.4"],"和年龄":["35.4"],"按照年龄从小到大排序":["35.4"],"从第":["35.4"],"条数据开始":["35.4"],"截取":["35.4"],"个学生的信息":["35.4"],"limit":["35.4"],"从第二条截取三个":["35.4"],"假设有一个学生表":["35.4"],"包含以下字段":["35.4"],"姓名":["35.4"],"请你编写一个":["35.4"],"查询":["35.4"],"将学生按照年龄划分为三个年龄等级":["35.4"],"level":["35.4"],"岁以上为":["35.4"],"老同学":["35.4"],"岁以上":["35.4"],"不包括":["35.4"],"为":["35.4"],"年轻":["35.4"],"岁及以下":["35.4"],"以及没有年龄信息为":["35.4"],"小同学":["35.4"],"返回结果应包含学生的姓名":["35.4"],"服务治理":["36.0"],"poe":["37.0"],"8e38iasslmhbmcw3orgp":["37.0"],"优点":["37.0"],"需要在catch里面做逻辑处理":["37.1"],"rsa":["37.2"],"dto":["37.3"],"js":["38.0","39.1","53.1"],"next":["38.1"],"office插件开发":["39.0"],"高度可移植性":["39.1"],"可以跨平台使用":["39.1"],"支持windows":["39.1"],"mac":["39.1"],"ios":["39.1"],"android等多个操作系统和设备":["39.1"],"ribbon配置":["39.2"],"encoding":["39.2"],"utf":["39.2"],"word的插件安装包":["39.5"],"word插件":["39.7"],"wps插件":["39.7"],"img":["39.7"],"src":["39.7"],"github":["39.7"],"文件服务":["40.1"],"修改初始化中给onlyoffice服务的地址换成cdn":["40.2"],"url即可":["40.2"],"修改callbackurl中持久化的操作":["40.2"],"改为文件整体上传oss":["40.2"],"app":["40.3"],"sdk":["42.0"],"场景":["42.0"],"需要二次封装一个js库":["42.0"],"输出一个自己的库":["42.0"],"安装依赖":["42.0"],"pnpm":["42.0"],"add":["42.0"],"webpack":["42.0"],"cli":["42.0"],"源码解析":["43.0"],"无界获取子应用的脚本采用的是qiankun的import":["43.3"],"css加载404异常捕捉不到的问题":["43.5"],"qiankun":["43.6"],"tip":["44.0"],"2023年12月2日21点49分":["44.1"],"单词本下面增加分类":["44.1"],"后端":["44.1"],"新增分类接口":["44.1"],"分类编辑接口":["44.1"],"v0":["44.2"],"注意isdelete字段":["44.4"],"单词分页查询":["44.5"],"使用mybatis":["44.5"],"page获取":["44.5"],"第一个参数默认传分页参数":["44.5"],"第一个参数传分页参数":["44.5"],"根据":["44.5"],"获取":["44.5"],"getdictionariesbyworkbookid":["44.6"],"flutter对比":["45.1"],"powershell管理员执行":["45.2"],"shell":["45.2"],"executionpolicy":["45.2"],"bypass":["45.2"],"scope":["45.2"],"process":["45.2"],"force":["45.2"],"npx":["46.0"],"react":["46.0"],"比较方便":["47.1"],"jabba":["47.2"],"openjdk":["47.2"],"worker":["48.0","48.1"],"demo":["48.1"],"git仓库":["48.1"],"mdn":["48.2"],"数据库实体":["49.2"],"全局异常处理":["49.3"],"项目主体":["49.4"],"mybatisx":["49.6"],"builder注解":["49.7"],"builder":["49.7"],"注解":["49.7"],"update动态sql":["49.8"],"update":["49.8"],"parametertype":["49.8"],"employee":["49.8"],"if":["49.8"],"challenges":["50.0"],"hooks":["51.0"],"alive":["52.0"],"一定能获取到更新之后的dom吗":["52.1"],"结论":["52.1"],"调用nexttick之前的同步任务":["52.1"],"微任务队列排在nexttick之前的都能获取到":["52.1"],"由nexttick的源码可以看出":["52.1"],"nexttick本质就是创建了一个微任务":["52.1"],"不考虑settimeout":["52.1"],"将其回调推入微任务队列":["52.1"],"vue中一个事件循环中的所有dom更新操作也是一个微任务":["52.1"],"两者属于同一优先级":["52.1"],"执行先后只于入队的先后有关":["52.1"],"换句话说":["52.1"],"如果你先写了nexttick":["52.1"],"再写赋值语句":["52.1"],"在此之前没有触发dom更新的操作":["52.1"],"那在nexttick中获取的可就不是更新后的dom了":["52.1"],"在":["52.3"],"author":["53.0"],"yaolinhong":["53.0"],"yaolinhong1024":["53.0"],"gmail":["53.0"],"date":["53.0"],"feat":["53.4","53.7"],"模型压缩调研":["53.4"],"gltf":["53.4"],"transform":["53.4"],"optimize":["53.4"],"revit":["53.4"],"减少模型的多边形数量":["53.5"],"多边形数量越多":["53.5"],"模型的复杂度和文件大小就会增加":["53.5"],"你可以使用3d建模软件":["53.5"],"如blender或maya":["53.5"],"我的three":["53.17"],"webgpu":["53.18"],"learn":["53.19","53.21"],"贴一个吗目标公司岗位的jd":["53.19"],"某目标公司":["53.19"],"webgl开发岗位职责":["53.19"],"开发和维护用于web端设计工具的高性能图形系统":["53.19"],"包括":["53.19"],"what":["53.20"],"3d":["53.23"],"坑":["54.2"],"模块":["55.1"],"整合到主项目启动":["55.2"],"执行sql插入报错":["55.3"],"synchronized":["55.4","55.6"],"关键字":["55.4"],"调用接口上线报错":["55.5"],"报错":["55.6"],"code":["55.6"],"null":["55.6"],"connectexception":["55.6"],"connection":["55.6"],"refused":["55.6"],"connect":["55.6"],"useraccount":["55.6"],"intern":["55.6"],"plan":["56.0"],"沉淀代码资产":["56.0"],"不限于工具库":["56.0"],"ui库":["56.0"],"重视输出":["56.0"],"少些demo项目":["56.0"],"多些深入探索":["56.0"],"要有产出成果":["56.0"],"仓库开源":["56.0"],"or形成相应的技术文章":["56.0"],"我取得了一些不错的成绩":["57.1"],"技术钻研":["57.1"],"服务端渲染应用落地":["57.1"],"compose部署":["57.1"],"二开":["57.1"],"用react的":["57.1"],"usedapp":["57.1"],"也有一些需要提升的地方":["57.2"],"任务管理":["57.2"],"目标管理意识较差":["57.2"],"这里只挑点缺点讲":["57.3"],"持续长跑":["57.4"],"按季度复盘":["57.4"],"娱乐消遣控制在每周2天左右":["57.4"],"学习打卡":["57.4"],"每周至少3天":["57.4"],"时间不限":["57.4"],"需要有学习产出的记录":["57.4"],"国家级":["58.1"],"webview":["58.3"],"im优化":["58.5"],"实时音频交互处理":["58.6"],"视频流处理":["58.7"],"服务端渲染":["59.1"],"div":["59.1","59.2"],"style":["59.1","59.2"],"width":["59.1","59.2"],"30px":["59.1","59.2"],"背景":["59.1","59.2"],"计划全站seo":["59.1"],"业务要新开一个saas系统":["59.2"],"后续可能做paas":["59.2"],"子系统多根据用户开通情况分配权限":["59.2"],"难点":["59.2"],"子系统用户权限":["59.2"],"页面路由":["59.2"],"数据权限":["59.2"],"性能优化":["59.3"],"列表方案":["59.3"],"不定高度":["59.3"],"从下往上滑动":["59.3"],"多页面响应式适配":["59.4"],"首页路由切换闪烁":["59.5"],"只允许排版功能":["59.6"],"面向前端同学":["60.0"],"可以使用默认布局":["60.0"],"node程序的进程":["61.0"],"ps":["61.0"],"ef":["61.0"],"grep":["61.0"],"快速导入swagger接口":["62.0"]},{"0":["44.2","47.2"],"1":["12.11","28.3","46.0","47.2","53.19","59.1"],"2":["12.10","12.20","33.2","34.1","53.19","59.1","59.2"],"3":["31.1","44.1","53.19","59.2"],"4":["44.1"],"5":["44.1"],"8":["12.0"],"11":["53.3"],"17":["47.2"],"19":["12.17"],"21":["18.0"],"22":["53.0"],"23":["53.0"],"47":["53.0"],"53":["53.0"],"80":["31.1"],"135":["18.0"],"192":["18.0"],"199":["18.0"],"443":["31.1"],"798":["18.0"],"992":["18.0"],"2009":["39.2"],"2023":["53.0"],"3072":["45.2"],"usage":["0.0"],"of":["0.0","12.11","18.0","53.5"],"some":["0.0","12.11","18.0"],"the":["0.0","0.9","12.12","35.2"],"pre":["0.2","0.3","0.4","0.6","0.7","0.8"],"out":["0.9"],"curl":["1.2"],"fssl":["1.2"],"https":["1.2"],"cmd":["2.0"],"args":["2.0"],"参数集合":["2.0"],"确保语言的确定性":["3.4"],"免税店":["4.0"],"总代理":["4.0"],"interface":["5.0"],"i":["5.1"],"with":["6.0","12.13","12.21"],"知乎文章":["7.0"],"实际背后差距可能更大":["8.1"],"数据处理能力":["8.1"],"工程能力":["8.1"],"用户数正反馈":["8.1"],"静态变量非常有用":["9.0"],"例如":["9.0"],"一个类代表一个公司的员工":["9.0"],"公司的名称对于所有员工来说都是相同的":["9.0"],"注意使用开源版本":["10.0"],"时区变量":["10.0"],"e":["10.0"],"php":["10.0"],"tz":["10.0"],"yaolinhong1024":["11.0"],"option":["12.7"],"to":["12.7"],"see":["12.7"],"bold":["12.8"],"text":["12.8","12.18","12.19","54.1"],"also":["12.9","12.14"],"be":["12.9","12.12","18.0"],"nested":["12.9"],"sub":["12.10"],"are":["12.10"],"made":["12.10"],"indenting":["12.10"],"spaces":["12.10"],"marker":["12.10"],"character":["12.10"],"comments":["12.11"],"line":["12.11","18.0"],"that":["12.12"],"will":["12.12"],"passed":["12.12"],"into":["12.12"],"templates":["12.12"],"engine":["12.12"],"have":["12.14"],"a":["12.14","57.3"],"footnote":["12.14"],"killer":["12.15"],"feature":["12.15"],"wink":["12.16"],"cry":["12.16"],"first":["12.20"],"lazy":["12.21"],"continuation":["12.21"],"abbreviation":["12.22"],"example":["12.22"],"it":["12.22","18.0"],"warning":["12.23","18.0"],"examples":["13.1"],"使用步骤":["13.1"],"npm":["13.1"],"install":["13.1","13.2"],"platform":["14.0"],"openai":["14.0"],"关注技术付费点":["15.0"],"一个是":["15.0"],"能帮别人":["15.0"],"挣钱":["15.0"],"的地方":["15.0"],"profiles":["17.0"],"profile":["17.0"],"id":["17.0"],"dev":["17.0"],"properties":["17.0"],"profileactive":["17.0"],"problems":["18.0"],"were":["18.0"],"encountered":["18.0"],"while":["18.0"],"effective":["18.0"],"model":["18.0"],"jar":["18.0"],"dependencies":["18.0"],"groupid":["18.0"],"artifactid":["18.0"],"type":["18.0"],"classifier":["18.0"],"must":["18.0"],"unique":["18.0"],"baomidou":["18.0"],"mybatis":["18.0"],"plus":["18.0"],"boot":["18.0"],"starter":["18.0"],"duplicate":["18.0"],"declaration":["18.0"],"column":["18.0"],"build":["18.0","31.1"],"plugins":["18.0"],"plugin":["18.0","42.0"],"org":["18.0"],"resources":["18.0"],"missing":["18.0"],"deploy":["18.0"],"highly":["18.0"],"fix":["18.0"],"these":["18.0"],"because":["18.0"],"they":["18.0"],"threaten":["18.0"],"stability":["18.0"],"your":["18.0"],"this":["18.0"],"reason":["18.0"],"future":["18.0"],"versions":["18.0"],"might":["18.0"],"longer":["18.0"],"support":["18.0"],"such":["18.0"],"malformed":["18.0"],"lt":["18.0"],"cloud":["18.0"],"feign":["18.0"],"kb":["18.0"],"swarm":["18.0"],"coding":["20.0","57.4"],"现象":["21.0"],"不缓存html":["21.1"],"questions":["22.0"],"核心线程数":["22.1"],"处理订单请求":["22.2"],"包括验证订单信息":["22.2"],"size":["22.3","22.4"],"业务场景关联":["22.3","22.5"],"pool":["22.4"],"工作队列用于存储尚未被执行的订单处理任务":["22.5"],"应该能够满足高并发请求下的任务排队需求":["22.5"],"路由器工作在哪一层":["22.6"],"要点":["22.8"],"记录小孩的单词量":["23.1"],"百度翻译api申请":["23.2"],"调用":["23.2"],"ecdict":["23.2"],"单一职责":["24.0"],"不一定是父元素":["25.0"],"定位元素":["25.0"],"追加的服务可以在应用内直接映射访问":["26.0"],"run":["27.0"],"项目":["28.1"],"400个表单需要校验":["28.1"],"不定高度内容":["28.2"],"快速滚动会产生高度跳变":["28.2"],"虚拟列表滚动":["28.2"],"调研中遇到了动态选10个显示":["28.2"],"单个sku表单":["28.3"],"否则git大小写有的折腾呢":["29.0"],"若flutter":["30.0"],"doctor":["30.0","46.0"],"dockerfile":["31.0"],"expose":["31.1"],"yml":["31.1"],"docker":["31.1"],"compose":["31.1"],"version":["31.1"],"services":["31.1","34.3"],"image":["31.1"],"container":["31.1"],"name":["31.1","49.8"],"restart":["31.1"],"always":["31.1"],"ports":["31.1"],"server":["31.1"],"lambdaupdate":["32.0"],"eq":["32.0","55.6"],"dsspacearea":["32.0"],"freeswitch探索":["33.0"],"玩了一下jssip的api":["33.1"],"reinvite事件":["33.2"],"若是直接用浏览器rtc的api":["33.2"],"安装":["33.4"],"wss配置":["33.5"],"高可用性和容错":["34.1"],"通过自动重启容器和自动重新调度pod":["34.1"],"提高了应用程序的可靠性和容错能力":["34.1"],"支持多副本部署":["34.1"],"实现负载均衡和服务高可用":["34.1"],"docker只是其中一种":["34.2"],"get":["34.3","44.5"],"是的":["34.3"],"在应用了上述":["34.3"],"kubernetes":["34.3"],"部署配置之后":["34.3"],"会自动将前端应用动态部署到集群中的":["34.3"],"node":["34.3","61.0"],"节点上":["34.3"],"不需要手动将应用程序部署到特定的节点":["34.3"],"会根据在":["34.3"],"文件中定义的规则":["34.3"],"自动选择合适的节点来调度和运行":["34.3"],"集群":["34.4"],"它包含一个或多个container":["34.5"],"pod中的所有container共享相同的网络命名空间":["34.5"],"network":["34.5"],"不支持":["35.1"],"对于":["35.1"],"每一条":["35.1"],"sql":["35.1","35.2"],"语句都默认封装成事务进行提交":["35.1"],"这可能会影响速度":["35.1"],"优化速度的方式是将多条":["35.1"],"语句放在":["35.1"],"begin":["35.1"],"commit":["35.1"],"ini中的":["35.2"],"set":["35.2"],"交集":["35.3","35.5"],"left":["35.3","35.5"],"right":["35.3","35.5"],"和年龄等级":["35.4"],"并按姓名升序排序":["35.4"],"case":["35.4"],"when":["35.4"],"then":["35.4","52.1"],"else":["35.4"],"end":["35.4"],"as":["35.4"],"date":["35.4"],"当前日期":["35.4"],"学号":["35.4"],"筛选出姓名为":["35.4"],"热dog":["35.4"],"的学生":["35.4"],"展示其学号":["35.4"],"及其大写姓名":["35.4"],"upper":["35.4"],"avg":["35.4"],"平均":["35.4"],"班级编号":["35.4"],"成绩":["35.4"],"汇总学生表中所有学生的总成绩":["35.4"],"total":["35.4"],"平均成绩":["35.4"],"最高成绩":["35.4"],"max":["35.4"],"和最低成绩":["35.4"],"min":["35.4"],"sum":["35.4"],"group":["35.4"],"heimashangcheng":["36.0"],"效率高":["37.0"],"位运算是对二进制位的直接操作":["37.0"],"比一般的算术运算和逻辑运算更高效":["37.0"],"它可以在一条指令中完成多个操作":["37.0"],"因此可以提高代码的执行速度和性能":["37.0"],"节省空间":["37.0"],"位运算可以将多个状态或选项使用较少的二进制位表示":["37.0"],"场景":["37.1"],"公钥私钥配对":["37.2"],"sse":["38.1"],"群聊实现demo":["38.2"],"与web技术无缝集成":["39.1"],"开发门槛较低":["39.1"],"可以使用html":["39.1"],"css":["39.1"],"javascript等web技术进行开发":["39.1"],"方便与web应用的集成":["39.1"],"安全性高":["39.1"],"api是基于沙箱模型进行开发":["39.1"],"可以有效避免恶意代码对系统造成的影响":["39.1"],"customui":["39.2"],"xmlns":["39.2"],"http":["39.2"],"schemas":["39.2"],"microsoft":["39.2"],"com":["39.2","39.7","44.6","64.0"],"office":["39.2"],"07":["39.2","53.6"],"clickone部署自动更新":["39.4"],"优点":["39.4"],"advance":["39.5"],"installer":["39.5"],"yaolinhong":["39.7"],"blog":["39.7"],"blob":["39.7"],"main":["39.7"],"static":["39.7"],"word":["39.7"],"office文档机翻":["39.8"],"给onlyoffice":["40.1"],"callbackurl的实现":["40.2"],"当用户保存时":["40.2"],"文档服务会调用文档储存服务的":["40.2"],"callbackurl":["40.2"],"文档body中返回一个url地址和status":["40.2"],"增加额外的js":["40.3"],"terser":["42.0"],"uglify":["42.0"],"js":["42.0"],"javascript":["42.0","52.1","56.0"],"config":["42.0"],"const":["42.0"],"html":["43.3"],"思路":["43.5"],"提供了集中式的状态管理方案":["43.6"],"它通过":["43.6"],"旨在陪伴kids":["44.0"],"单词本下面":["44.1"],"所有分类接口":["44.1"],"单词列表中返回分类id":["44.1"],"单词关联分类接口":["44.1"],"xml中新增字段飘红":["44.1"],"alt":["44.1"],"数据库需要设置默认值0":["44.4"],"单词本单词":["44.5"],"xml版本":["44.5"],"支持分页加载":["44.5"],"param":["44.5"],"return":["44.5"],"getmapping":["44.5"],"words":["44.5"],"resultmap":["44.6"],"yao":["44.6"],"wxmp":["44.6"],"大厂使用比较多":["45.1"],"net":["45.2"],"servicepointmanager":["45.2"],"securityprotocol":["45.2"],"bor":["45.2"],"iex":["45.2"],"native":["46.0"],"有界面操作":["47.1"],"在线":["48.1"],"功能":["48.1"],"多个不同tab页面之间数据交互":["48.1"],"demo":["48.2"],"dto":["49.2"],"通用包装类等":["49.3"],"安装之后":["49.6"],"构建器":["49.7"],"用于创建对象":["49.7"],"如实现类中":["49.7"],"null":["49.8"],"username":["49.8"],"坑":["51.0"],"实现原理":["52.0"],"如何阻塞nexttick内依赖改变的内容导致的页面更新":["52.1"],"不停地push微任务":["52.1"],"本轮事件循环就一直不会结束":["52.1"],"代码如下":["52.1"],"let":["52.1"],"queue":["52.1"],"promise":["52.1"],"resolve":["52.1"],"function":["52.1"],"cb":["52.1"],"toraw":["52.4"],"09":["53.0"],"lasteditors":["53.0"],"glb":["53.4"],"compressed":["53.4"],"texture":["53.4"],"compress":["53.4"],"webp":["53.4"],"一键压缩效果":["53.4"],"来减少模型中的多边形数量":["53.5"],"这可以通过简化几何形状":["53.5"],"合并顶点或使用lod":["53.5"],"level":["53.5"],"detail":["53.5"],"技术来实现":["53.5"],"revit模型渲染":["53.7"],"mvp":["53.7"],"06":["53.8"],"js训练场":["53.17"],"渲染引擎的性能和效果优化":["53.19"],"前后端及上下游工具链图形能力建设":["53.19"],"显示素材数据的转化和优化处理":["53.19"],"抽象几个关键的技术要素":["53.20"],"webgl":["53.20"],"主要目标":["53.21"],"有业余开源项目供技术参考":["53.21"],"最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现":["53.23"],"一看是直接放的video":["53.23"],"native支付并不能用网站引用的appid申请":["54.2"],"需要单独打开项目":["55.1"],"not":["55.3"],"加锁和释放锁":["55.4"],"无论方法正常执行完毕还是抛出异常":["55.4"],"原因":["55.5"],"账户不能重复":["55.6"],"querywrapper":["55.6"],"user":["55.6"],"new":["55.6"],"long":["55.6"],"count":["55.6"],"usermapper":["55.6"],"记笔记":["56.0"],"主要是过后自己翻阅可以加深理解":["56.0"],"分享给他人的内容":["56.0"],"当然需要再深度加工产出博客":["56.0"],"上面说的还是一些原则性的东西":["56.0"],"下面是具体的计划":["56.0"],"前端技术沉淀":["56.0"],"作用域":["56.0"],"闭包":["56.0"],"原型链":["56.0"],"总结":["57.0"],"发布了自己的web3测试链":["57.1"],"c":["57.1"],"webview落地word插件":["57.1"],"发布实践":["57.1"],"oneclick部署":["57.1"],"electron":["57.1"],"网盘应用源码精读":["57.1"],"调试":["57.1"],"electron原理书泛读":["57.1"],"严格工时评估的能力差":["57.2"],"需求评审不够严谨":["57.2"],"松散的目标意识":["57.2"],"如saas中":["57.2"],"有时候会眼高手低":["57.3"],"笔记":["57.4"],"代码库":["57.4"],"沉淀代码资产":["57.4"],"不限于工具库":["57.4"],"ui库":["57.4"],"重视输出":["57.4"],"word插件项目":["58.3"],"前端消息确认":["58.5"],"description":["58.5"],"工期紧":["59.1"],"一期迭代要求一周":["59.1"],"难点":["59.1"],"原单页面改全站seo":["59.1"],"br":["59.1","59.2"],"主子页面登录态共享":["59.1"],"选型":["59.1","59.2"],"设计":["59.2"],"多子系统共用组件库":["59.2"],"共享依赖":["59.2"],"全局组件库":["59.2"],"css隔离":["59.2"],"样式隔离":["59.2"],"rbac":["59.2"],"页面抖动":["59.3"],"删除节点页面跳动":["59.3"],"复杂业务代码改造":["59.3"],"item":["59.3"],"i18n":["59.4"],"公共组件库处理":["59.5"],"iframe":["59.6"],"可基于vue扩展":["60.0"],"vitepress":["60.0"],"解压到当前文件夹":["61.0"],"tar":["61.0"],"zxvf":["61.0"]},{"0":["55.6"],"1":["34.3","37.1","44.2","48.1"],"2":["12.11","12.21","22.1","34.3","38.2","39.5","53.5","55.6"],"3":["33.2","34.1"],"5":["18.0"],"6":["18.0"],"11":["53.0"],"15":["53.4","53.8"],"19":["34.3"],"20":["53.3"],"23":["53.6"],"92":["39.7"],"150":["35.4"],"768":["18.0"],"apis":["0.0"],"provided":["0.0"],"by":["0.0","12.9"],"vitepress":["0.0"],"documentation":["0.9"],"ollama":["1.2"],"com":["1.2","14.0","31.1"],"install":["1.2"],"修改":["2.0"],"webui":["2.0"],"user":["2.0"],"the":["3.4"],"不给货":["4.0"],"大宗商品":["4.0"],"ui":["5.0"],"connect":["5.1"],"format":["6.0"],"需要配置服务器":["7.0"],"已经让openai有了代差":["8.1"],"进入了增长飞轮":["8.1"],"国产模型":["8.1"],"替代开源模型难以企及":["8.1"],"这时可以使用静态变量来表示公司的名称":["9.0"],"常量":["9.0"],"静态变量通常用于表示常量":["9.0"],"因为它们的值在整个程序执行期间保持不变":["9.0"],"asia":["10.0"],"shanghai":["10.0"],"获取密码":["10.0"],"登录":["10.0"],"安装gitee插件":["10.0"],"gmail":["11.0"],"result":["12.7"],"c":["12.7"],"r":["12.7"],"using":["12.9"],"additional":["12.9"],"change":["12.10"],"forces":["12.10"],"new":["12.10","45.2"],"start":["12.10"],"ac":["12.10"],"tristique":["12.10"],"libero":["12.10"],"volutpat":["12.10"],"at":["12.10"],"used":["12.12"],"for":["12.12"],"processing":["12.12"],"handlebars":["12.12"],"is":["12.12"],"default":["12.12"],"title":["12.13"],"autoconverted":["12.13"],"style":["12.14"],"syntax":["12.14"],"alt":["12.14"],"text":["12.14","12.20","44.1"],"of":["12.15"],"markdown":["12.15"],"laughing":["12.16"],"yum":["12.16"],"th":["12.17"],"second":["12.20"],"inline":["12.20"],"withinline":["12.21"],"markup":["12.21"],"converts":["12.22"],"but":["12.22"],"here":["12.23"],"g":["13.1","13.2"],"node":["13.1","34.4"],"gyp":["13.1"],"对应的python版本":["13.1"],"examples":["14.0"],"另一个是":["15.0"],"省钱":["15.0"],"付费的前提是信任":["15.0"],"只有你提升自己的能力和经历后":["15.0"],"activation":["17.0"],"activebydefault":["17.0"],"true":["17.0","42.0"],"base":["18.0"],"common":["18.0"],"alibaba":["18.0"],"reos":["18.0"],"open":["18.0"],"file":["18.0"],"api":["18.0","53.20"],"sdk":["18.0","46.0"],"learning":["20.0"],"record":["20.0"],"偶先页面渲染异常":["21.0"],"最大线程数":["22.1"],"扣除库存":["22.2"],"生成订单号等":["22.2"],"核心线程数应该根据订单的日均请求量和处理时间来确定":["22.3"],"对于一个电商平台":["22.3"],"业务场景关联":["22.4"],"最大线程数应该根据系统的资源限制和预期的最大并发量来确定":["22.4"],"在电商平台中":["22.5"],"可以选择一个适当大小的有界队列来限制订单处理的并发量":["22.5"],"如何建立可靠的连接":["22.7"],"支持分享单词本":["23.1"],"社区词典数据库":["23.2"],"单词发音":["23.2"],"tts":["23.2"],"渲染列表":["24.0"],"position属性为relative":["25.0"],"absolute":["25.0"],"build":["27.0"],"每个表单有20个左右的校验项":["28.1"],"高度跳变的问题":["28.2"],"也有解决方案":["28.2"],"但实现成本大":["28.2"],"整体表单校验":["28.3"],"使用nextick方式":["28.3"],"不通过":["30.0"],"使用java8":["30.0"],"https配置":["31.0"],"listen":["31.1"],"ssl":["31.1"],"youdomin":["31.1"],"certificate":["31.1"],"crt":["31.1"],"下载下来的证书名称不能改":["31.1"],"key":["31.1"],"tokens":["31.1"],"off":["31.1"],"getid":["32.0"],"dto":["32.0"],"仓库名称":["33.0"],"vue":["33.0","60.0"],"replacetrack替换轨道":["33.2"],"重新offer":["33.2"],"jssip库":["33.2"],"windows下":["33.4"],"参考博客":["33.5"],"资源利用率和集群管理":["34.1"],"通过自动调度":["34.1"],"充分利用集群资源":["34.1"],"提高资源利用率":["34.1"],"支持自动伸缩":["34.1"],"根据应用程序负载动态调整资源分配":["34.1"],"还有":["34.2"],"pod":["34.3"],"它会考虑诸如节点资源可用性":["34.3"],"节点标签":["34.3"],"污点和容忍等多种调度策略":["34.3"],"从而实现高效且合理的应用程序分布":["34.3"],"在部署过程中":["34.3"],"不需要处理太多其他逻辑":["34.3"],"会自动为处理以下任务":["34.3"],"拉取容器镜像":["34.3"],"会从配置的容器镜像仓库中拉取":["34.3"],"nginx":["34.3"],"alpine":["34.3"],"镜像":["34.3"],"namespace":["34.5"],"和存储卷":["34.5"],"volumes":["34.5"],"之间":["35.1"],"组成一个事务":["35.1"],"如果你的应用需要高度的事务处理":["35.1"],"选择":["35.1"],"是更好的选择":["35.1"],"外键支持":["35.1"],"支持外键":["35.1"],"外键是关系数据库中的重要概念":["35.1"],"用于维护表之间的数据完整性":["35.1"],"to":["35.2"],"strict":["35.2"],"左右其中一张的全表":["35.3","35.5"],"加上选集":["35.3","35.5"],"cross":["35.3"],"统计学生表中的班级编号":["35.4"],"和每个班级的平均成绩":["35.4"],"考试次数":["35.4"],"统计学生表中每个班级每次考试的总学生人数":["35.4"],"count":["35.4"],"统计学生表中班级的总成绩超过":["35.4"],"分的班级编号":["35.4"],"和总成绩":["35.4"],"having子句":["35.4"],"对goup":["35.4"],"by的内容进行筛选":["35.4"],"在":["35.4"],"中":["35.4"],"having":["35.4"],"子句用于在分组聚合后对分组进行过滤":["35.4"],"它允许我们对分组后的结果进行条件筛选":["35.4"],"只保留满足特定条件的分组":["35.4"],"子句与条件查询":["35.4"],"子句的区别在于":["35.4"],"docker启动":["36.0"],"从而节省存储空间":["37.0"],"这在需要处理大量数据或对性能要求较高的场景中特别有用":["37.0"],"适用于某些特定问题":["37.0"],"位运算在某些问题和算法中非常有用":["37.0"],"例如处理图像":["37.0"],"压缩算法":["37.0"],"权限控制等":["37.0"],"https中的加密":["37.2"],"data":["37.3"],"transfer":["37.3"],"体验一下国际服玩家的利器next":["38.1"],"高度扩展性":["39.1"],"可以通过使用office":["39.1"],"add":["39.1"],"ins等技术进行扩展":["39.1"],"增加插件的功能和适用范围":["39.1"],"开发负担":["39.1"],"无法抹平两套sdk差异":["39.1"],"资源发布需要上架审核":["39.1"],"应用分别受两家厂商限制":["39.1"],"2套代码":["39.1"],"onload":["39.2"],"ribbon":["39.2"],"load":["39.2"],"tabs":["39.2"],"tab":["39.2"],"id":["39.2"],"tab1":["39.2"],"安装之后":["39.4"],"innosetup":["39.5"],"e6":["39.7"],"8f":["39.7"],"e4":["39.7"],"bb":["39.7"],"b6":["39.7"],"社区参考资料少":["39.8"],"editing服务提供文件":["40.1"],"status为6":["40.2"],"此时储存服务去保存":["40.2"],"保存成功失败返回对应的状态码":["40.2"],"status":["40.2"],"把构建好的web":["40.3"],"terserplugin":["42.0"],"require":["42.0"],"module":["42.0"],"exports":["42.0"],"mode":["42.0"],"production":["42.0"],"experiments":["42.0"],"outputmodule":["42.0"],"entry方案":["43.3"],"这个方案是通过正则表达式将":["43.3"],"debug":["43.5"],"props":["43.6"],"和全局状态对象来实现子应用之间的通信和状态共享":["43.6"],"私有单词库":["44.0"],"前端":["44.1"],"单词本列表中请求所有分类":["44.1"],"点击编辑":["44.1"],"可以关联分类":["44.1"],"关联分类之后刷新列表":["44.1"],"列表中分类展示":["44.1"],"根据分类list接口map展示":["44.1"],"查询词典":["44.2"],"然后需要添加":["44.4"],"xml":["44.5"],"public":["44.5"],"baseresponse":["44.5"],"page":["44.5"],"dics":["44.5"],"getwordsbyid":["44.5"],"int":["44.5"],"requestparam":["44.5"],"defaultvalue":["44.5"],"mapper":["44.6"],"dicsmapper":["44.6"],"baseresultmap":["44.6"],"d":["44.6"],"flutter":["45.1"],"中小厂使用比较多":["45.1"],"object":["45.2"],"webclient":["45.2"],"downloadstring":["45.2"],"https":["45.2"],"community":["45.2"],"chocolatey":["45.2"],"org":["45.2"],"设置系统环境变量":["46.0"],"落地场景":["48.1"],"electron":["48.1","59.6"],"render进程之间交互":["48.1"],"entity":["49.2"],"设置schema":["49.6"],"employee":["49.7"],"password":["49.8"],"phone":["49.8"],"onmounted问题解决":["51.0"],"微前端场景下如何服用子vue实例的component":["52.0"],"嵌套路由场景下":["52.0"],"模拟无限添加微任务":["52.1"],"addinfinitetask":["52.1"],"console":["52.1"],"log":["52.1"],"infinite":["52.1"],"task":["52.1"],"这里会无线阻塞主进程":["52.1"],"什么时候更新":["52.1"],"下次更新dom之前":["52.1"],"能拿到更新后的虚拟dom":["52.1"],"运行的时候只是提交更新":["52.1"],"并不会直接执行渲染":["52.1"],"有什么区别":["52.4"],"lastedittime":["53.0"],"info":["53.4"],"mb":["53.4"],"压缩纹理":["53.5"],"纹理是模型中常用的图像贴图":["53.5"],"可以给模型增加细节和颜色":["53.5"],"你可以使用图像压缩工具":["53.5"],"如jpeg或png压缩算法":["53.5"],"来减小纹理文件的大小":["53.5"],"预览":["53.7"],"仓库地址":["53.7"],"feat":["53.17"],"metaverse游戏":["53.17"],"岗位要求":["53.19"],"计算机或相关专业":["53.19"],"或丰富从业经验":["53.19"],"本科及以上学历":["53.19"],"计算机基础扎实":["53.19"],"web图形领域":["53.20"],"找相关开源项目":["53.21"],"找webgl下的问题场景":["53.21"],"直接解决相关的问题":["53.21"],"对于需要seo的页面来说":["53.23"],"订阅号无法开通此接口":["54.1"],"必须将微信支付id":["54.2"],"null的字段没有写入":["55.3"],"都会释放锁":["55.4"],"一把锁只能同时被一个线程获取":["55.4"],"没有获得锁的线程只能等待":["55.4"],"gateway挂了":["55.5"],"selectcount":["55.6"],"if":["55.6"],"throw":["55.6"],"businessexception":["55.6"],"errorcode":["55.6"],"params":["55.6"],"error":["55.6"],"账号重复":["55.6"],"加密":["55.6"],"算法与数据结构":["56.0"],"常态学习":["56.0"],"阅读笔记":["56.0"],"leecode":["56.0"],"快排":["56.0"],"爬楼梯":["56.0"],"暴力解":["56.0"],"不做的事情":["56.0"],"除非有好的深入的项目":["56.0"],"否则不摸客户端类":["56.0"],"3d":["57.1"],"钻研了revit转glb":["57.1"],"drao模型压缩":["57.1"],"three":["57.1"],"js模型渲染":["57.1"],"revit模型选然后":["57.1"],"构建选择":["57.1"],"jssip":["57.1"],"错误估计整体提测时间":["57.2"],"需求侧不确定的情况下":["57.2"],"花很多时间做一些不确定的需求":["57.2"],"重复劳动":["57.2"],"得下场多做":["57.3"],"b":["57.3"],"少些demo项目":["57.4"],"多些深入探索":["57.4"],"要有产出成果":["57.4"],"仓库开源":["57.4"],"or形成相应的技术文章":["57.4"],"记笔记":["57.4"],"主要是过后自己翻阅可以加深理解":["57.4"],"分享给他人的内容":["57.4"],"背景":["58.5"],"session方案":["59.1"],"vue2":["59.1"],"nuxt2":["59.1"],"cv简单修改即可":["59.1"],"落地快":["59.1"],"or":["59.2"],"rbac1":["59.2"],"角色继承":["59.2"],"省空间":["59.2"],"制定路由规范":["59.2"],"一级规定指向应用":["59.2"],"主应用控制应用进入的权限":["59.2"],"子应用内路由首位使用基座的共享方法去控制具体页面的路由权限":["59.2"],"公共组件库":["59.2"],"主应用分发":["59.2"],"处理为计算属性":["59.3"],"一些个人的经验":["59.3"],"关于虚拟列表相关的优化它真的就只是在优化":["59.3"],"直接限制你每次滚动的范围":["59.3"],"就类似之前看到大屏做上下幻灯片滚动一样":["59.3"],"动态rem":["59.4"],"二次封装组件":["59.5"],"限制":["59.6"],"theme":["60.0"],"maotai":["61.0"],"fe":["61.0"],"gz":["61.0"],"ylh1995":["64.0"]},{"1":["31.1","40.2","44.5"],"2":["28.2","30.0","31.1","39.1"],"3":["12.11","22.1","34.3","53.5","55.6"],"4":["34.1","59.2"],"5":["31.1"],"10":["44.5"],"11":["47.2"],"20":["53.0"],"21":["53.0"],"33":["53.0"],"56":["53.0"],"81":["53.4"],"88":["39.7"],"95":["39.7"],"100":["35.4"],"390":["53.4"],"main":["0.0"],"usedata":["0.0"],"can":["0.0"],"be":["0.0","12.23"],"for":["0.9"],"sh":["1.2"],"bat里":["2.0"],"set":["2.0","32.0"],"dao":["3.4"],"店铺资源":["4.0"],"you":["5.1"],"导出ddl":["6.0"],"服务端":["7.0"],"使用gpt是最优解":["8.1"],"套壳gpt":["8.1"],"固定prompt":["8.1"],"没有意义":["8.1"],"数学中的π":["9.0"],"圆周率":["9.0"],"配置hooks":["10.0"],"这里选择的是scm的方式":["10.0"],"每15分钟拉取git仓库":["10.0"],"比较最新的哈希值":["10.0"],"com":["11.0","39.1","52.1"],"tm":["12.7"],"greater":["12.9"],"than":["12.9"],"signs":["12.9"],"facilisis":["12.10"],"in":["12.10"],"pretium":["12.10"],"nisl":["12.10"],"aliquet":["12.10"],"nulla":["12.10"],"aliquam":["12.10"],"velit":["12.10"],"very":["12.10"],"block":["12.11"],"ext":["12.12"],"extension":["12.12"],"dest":["12.12"],"right":["12.12"],"aligned":["12.12"],"https":["12.13","33.2","52.1","53.7"],"id":["12.14","49.7"],"with":["12.14"],"reference":["12.14"],"later":["12.14"],"it":["12.15"],"is":["12.15"],"shortcuts":["12.16"],"emoticons":["12.16"],"h":["12.17"],"of":["12.20","12.21"],"some":["12.21"],"code":["12.21"],"part":["12.21"],"keep":["12.22"],"intact":["12.22"],"partial":["12.22"],"可以构建一个可以给调用的cc文件":["13.1"],"node":["13.2"],"fine":["14.0"],"tune":["14.0"],"别人才会对你有一定的信任":["15.0"],"才会觉得你靠谱":["15.0"],"才会给你机会":["15.0"],"而这个信任需要用你的能力和经历来填补":["15.0"],"比如":["15.0"],"test":["17.0"],"代码":["20.0"],"css没加载完全":["21.0"],"技术栈":["22.2"],"java后端开发":["22.2"],"订单请求可能会呈现出明显的日周期性波动":["22.3"],"因此核心线程数应该足够以应对峰值时段的订单处理需求":["22.3"],"在电商平台中":["22.4"],"最大线程数的设置应该考虑服务器的cpu和内存资源":["22.4"],"以防止系统资源被无限制地占用":["22.5"],"技术实现":["22.5"],"在threadpooltaskexecutor中":["22.5"],"三次握手的详细过程":["22.7"],"家人范围内共享":["23.1"],"使用社区免费的tts":["23.2"],"使用社区开源tts":["23.2"],"http":["23.2"],"渲染组件":["24.0"],"fixed或sticky":["25.0"],"会影响其后代元素的offsettop":["25.0"],"多选":["28.1"],"单选":["28.1"],"也有loading":["28.2"],"表单提交时前端校验需要校验所有数据":["28.2"],"需要改造校验逻辑":["28.2"],"替换数据":["28.3"],"循环赋值":["28.3"],"anroid":["30.0"],"前置步骤":["31.0"],"keepalive":["31.1"],"timeout":["31.1"],"session":["31.1"],"5m":["31.1"],"protocols":["31.1"],"tlsv1":["31.1"],"可参考此":["31.1"],"协议进行配置":["31.1"],"ciphers":["31.1"],"ecdhe":["31.1"],"rsa":["31.1"],"aes128":["31.1"],"gcm":["31.1"],"sha256":["31.1"],"high":["31.1"],"anull":["31.1"],"md5":["31.1"],"rc4":["31.1"],"dhe":["31.1"],"getname":["32.0"],"fs":["33.0"],"dtmf":["33.2"],"下载msi":["33.4"],"并配置nginx之后":["33.5"],"提供集中式监控和管理工具":["34.1"],"简化了集群操作":["34.1"],"一致性和隔离性":["34.1"],"通过容器和命名空间":["34.1"],"实现了应用程序之间的隔离和一致性部署":["34.1"],"containerd":["34.2"],"创建":["34.3"],"会根据":["34.3"],"中的配置":["34.3"],"创建包含前端应用容器的":["34.3"],"挂载卷":["34.3"],"会将指定的本地构建产物目录挂载到":["34.3"],"容器中的":["34.3"],"usr":["34.3"],"share":["34.3"],"html":["34.3"],"子节点":["34.4"],"pod是一个临时性的实体":["34.5"],"如果pod中的某个container终止":["34.5"],"整个pod也会被重新创建":["34.5"],"如果你的数据模型需要外键约束":["35.1"],"索引结构":["35.1"],"使用":["35.1","35.4"],"b":["35.1"],"树的非聚集索引":["35.1"],"存储的是实际数据的地址值":["35.1"],"索引和实际数据是分开的":["35.1"],"树的聚集索引":["35.1"],"trans":["35.2"],"tables":["35.2"],"笛卡尔积":["35.3","35.5"],"聚合":["35.3","35.5"],"子句用于在":["35.4"],"分组之前":["35.4"],"进行过滤":["35.4"],"而":["35.4"],"分组之后":["35.4"],"子句查询订单总金额超过":["35.4"],"的客户":["35.4"],"查询总成绩超过200的班级":["35.4"],"customer":["35.4"],"amount":["35.4"],"orders":["35.4"],"cross":["35.4","35.5"],"join":["35.4"],"其中":["35.4"],"是一种简单的关联查询":["35.4"],"不需要任何条件来匹配行":["35.4"],"它直接将左表的":["35.4"],"每一行":["35.4"],"与右表的":["35.4"],"进行组合":["35.4"],"返回的结果是两个表的笛卡尔积":["35.4"],"还有一个班级表":["35.4"],"班级名称":["35.4"],"将学生表和班级表的所有行组合在一起":["35.4"],"并返回学生姓名":["35.4"],"学生年龄":["35.4"],"以及班级名称":["35.4"],"s":["35.4"],"它可以简化代码实现并提高处理效率":["37.0"],"缺点":["37.0"],"可读性较差":["37.0"],"位运算涉及对二进制位的直接操作":["37.0"],"对于不熟悉位运算的开发者来说":["37.0"],"代码可读性较差":["37.0"],"如任意api":["37.1"],"为啥需要证书":["37.2"],"object":["37.3"],"js":["38.1"],"打字机推送效果":["38.2"],"无法兼容":["39.1"],"加载项":["39.1"],"功能强大":["39.1"],"使用com加载项可以实现更复杂的功能和操作":["39.1"],"js版本的接口相对阉割":["39.1"],"高性能":["39.1"],"com加载项可以直接访问本地api":["39.1"],"不需要通过网络访问":["39.1"],"label":["39.2"],"应用名称":["39.2"],"group":["39.2"],"contentgroup":["39.2"],"aegis":["39.2"],"button":["39.2"],"更新服务器资源后":["39.4"],"用户端每次重启word均会拉取最新版本word":["39.4"],"好处":["39.5"],"9e":["39.7"],"9c":["39.7"],"png":["39.7"],"raw":["39.7"],"给对应加密信息":["40.1"],"描述":["40.2"],"出现条件":["40.2"],"正在编辑文档":["40.2"],"每次用户连接或断开文档共同编辑时都会收到它":["40.2"],"app包":["40.3"],"optimization":["42.0"],"minimize":["42.0"],"minimizer":["42.0"],"new":["42.0"],"minify":["42.0"],"uglifyjsminify":["42.0"],"terseroptions":["42.0"],"options":["42.0"],"will":["42.0"],"子应用的":["43.3"],"进一步定位抛错位置":["43.5"],"singlespa":["43.6"],"则更加灵活":["43.6"],"科学review":["44.0"],"中文词典搜索":["44.1"],"添加全文索引":["44.1"],"regexp和like使用了表扫描而不是索引":["44.1"],"但对中文不友好":["44.1"],"搜索不到":["44.1"],"所以用like匹配":["44.1"],"alter":["44.1"],"table":["44.1"],"dics":["44.1"],"发音":["44.2"],"tablelogic":["44.4"],"current":["44.5"],"size":["44.5"],"httpservletrequest":["44.5"],"from":["44.6"],"rdic":["44.6"],"custom":["44.6"],"words":["44.6"],"增长趋势较好":["45.1"],"install":["45.2"],"ps1":["45.2"],"安装":["45.2"],"jdk17":["45.2"],"choco":["45.2"],"y":["45.2"],"microsoft":["45.2"],"openjdk17":["45.2"],"platform":["46.0"],"tools":["46.0"],"主进程设置了一个messagechannel":["48.1"],"分发给不同的渲染进程":["48.1"],"进程间通信":["48.1"],"vo":["49.2"],"有代码提示":["49.6"],"status":["49.7"],"sex":["49.8"],"idnumber":["49.8"],"number":["49.8"],"全局样式覆盖":["51.0"],"什么时候执行渲染":["52.1"],"在事件循环的任务队列执行完毕后进行的":["52.1"],"如何确保dom已经更新":["52.1"],"而不是虚拟dom更新":["52.1"],"双requestanimationframe":["52.1"],"github":["52.1"],"twickstrom":["52.1"],"vue":["52.1"],"force":["52.1"],"next":["52.1"],"tick":["52.1"],"blob":["52.1"],"master":["52.1"],"src":["52.1"],"以下是自己测试之后的总结":["52.4"],"filepath":["53.0"],"ylh":["53.0"],"blog":["53.0","64.0"],"kb":["53.4"],"报错":["53.4"],"console":["53.4"],"error":["53.4"],"missing":["53.4"],"parent":["53.4"],"同时":["53.5"],"还可以考虑使用纹理压缩格式":["53.5"],"如draco":["53.5"],"压缩算法":["53.5"],"dds或astc":["53.5"],"以减少文件大小":["53.5"],"安装revit":["53.7"],"按住空格":["53.17"],"熟悉常用算法数据结构设计模式":["53.19"],"有良好的编程习惯":["53.19"],"熟练掌握基本的线性代数":["53.19","53.20"],"几何":["53.19"],"图形学和渲染技术":["53.19"],"cpu和gpu的性能优化方法":["53.20"],"提供commit":["53.21"],"过程中完善":["53.21"],"或许blender建模后支出video":["53.23"],"整体对客户端来说":["53.23"],"服务号必须通过微信认证":["54.1"],"绑定服务号或者订阅号的微信公众号id":["54.2"],"补充该字段":["55.3"],"每个实例都对应有自己的一把锁":["55.4"],"this":["55.4"],"远程调用失败":["55.5"],"string":["55.6"],"encryptpassword":["55.6"],"digestutils":["55.6"],"md5digestashex":["55.6"],"salt":["55.6"],"userpassword":["55.6"],"getbytes":["55.6"],"分配":["55.6"],"accesskey":["55.6"],"secretkey":["55.6"],"electron":["56.0"],"react":["56.0"],"native":["56.0"],"element":["56.0"],"ui组件库源码阅读":["56.0"],"分析":["56.0"],"qiankun源码":["56.0"],"阅读":["56.0"],"后端技术沉淀":["56.0"],"项目":["56.0"],"renegotiate落地语音通话转视频通话的处理":["57.1"],"自己前后端":["57.1"],"部署做了rdic":["57.1"],"这个应用":["57.1"],"支持自建单词本":["57.1"],"支持共享":["57.1"],"修改":["57.1"],"单词发音的应用":["57.1"],"针对小孩子学英语的场景":["57.1"],"团队管理协调":["57.2"],"团队进度滞后":["57.2"],"只是自己默默承担":["57.2"],"不敢分bug":["57.2"],"需求做的糙":["57.3"],"思路是正确":["57.3"],"当然需要再深度加工产出博客":["57.4"],"生活方面":["57.4"],"english":["57.4"],"first":["57.4"],"练刀工":["57.4"],"厨艺精进":["57.4"],"每周2次运动":["57.4"],"难点":["58.5"],"选型":["58.5"],"团队成员好上手":["59.1"],"落地":["59.1"],"seo不收录问题解决":["59.1"],"主动提交":["59.1"],"sitemap":["59.1"],"robots正确配置":["59.1"],"footer":["59.1"],"link标签":["59.1"],"增加内链与外链":["59.1"],"构建组件库":["59.2"],"qiankun":["59.2"],"webcomponent方案":["59.2"],"京东的":["59.2"],"iframe方案":["59.2"],"路由方案":["59.2"],"用微前端分目的是分割功能单元":["59.2"],"精简代码库":["59.2"],"控制发版单元":["59.2"],"长期可迭代":["59.2"],"技术无关性":["59.2"],"你滚动一下就滚动了整个屏幕":["59.3"],"可以观察小红书":["59.3"],"限制了只能滚动":["59.3"],"没有滚动条":["59.3"],"所有图片加载完成之后进入页面":["59.4"],"支持透传slot":["59.5"],"太生硬":["59.6"],"hope":["60.0"],"seo友好":["60.0"],"unzip":["61.0"],"zip":["61.0"]},{"0":["33.2","44.5"],"1":["12.10"],"2":["12.17","28.3","37.1","40.2","48.1"],"3":["40.2","59.1"],"4":["34.3","53.19"],"5":["10.0","34.1","34.3","53.19","55.6"],"8":["12.16"],"75":["23.2"],"159":["23.2"],"170":["23.2"],"used":["0.0"],"to":["0.0","12.9","42.0"],"access":["0.0"],"site":["0.0"],"theme":["0.0"],"and":["0.0"],"full":["0.9"],"list":["0.9"],"run":["1.2"],"llama3":["1.2"],"commandline":["2.0"],"no":["2.0","35.2"],"ico":["3.4"],"供应链":["4.0"],"资金":["4.0"],"on":["5.1","31.1","35.4"],"整体表结构的sql":["6.0"],"使用花生壳免费版":["7.0"],"模型能力提高10背后":["8.1"],"会颠覆掉":["8.1"],"发展模型的alignment":["8.1"],"opinion":["8.1"],"mining":["8.1"],"可以声明为静态变量":["9.0"],"工具类":["9.0"],"在编写工具类时":["9.0"],"通常会使用静态变量":["9.0"],"命令":["10.0"],"h":["10.0"],"如果忘记设置时区":["10.0"],"打开设置中的script":["10.0"],"github":["11.0","12.13","42.0"],"p":["12.7"],"test":["12.7"],"italic":["12.8"],"right":["12.9","35.4"],"next":["12.9"],"easy":["12.10"],"ordered":["12.10"],"lorem":["12.10"],"ipsum":["12.10"],"dolor":["12.10"],"sit":["12.10"],"amet":["12.10"],"consectetur":["12.10"],"adipiscing":["12.10"],"fences":["12.11"],"sample":["12.11"],"text":["12.11","39.2"],"here":["12.11"],"columns":["12.12"],"com":["12.13","42.0"],"nodeca":["12.13"],"in":["12.14"],"the":["12.14"],"document":["12.14"],"defining":["12.14"],"very":["12.15"],"effective":["12.15"],"see":["12.16"],"how":["12.16"],"definition":["12.20"],"duplicated":["12.20"],"reference":["12.20"],"third":["12.21"],"paragraph":["12.21"],"entries":["12.22"],"like":["12.22"],"xxxhtmlyyy":["12.22"],"dragons":["12.23"],"调用hello":["13.1"],"cc":["13.1"],"代码":["13.1"],"javascript":["13.1","48.1"],"gyp":["13.2"],"微调需要":["14.0"],"上千上万条数据":["14.0"],"能处理更复杂的问题":["14.0"],"你是一个很知名的开源软件的核心开发人员":["15.0"],"或是你是某知名公司核心项目的核心开发人员":["15.0"],"等等":["15.0"],"关注技术趋势":["15.0"],"找到能体现价值的地方":["15.0"],"prod":["17.0"],"ib":["18.0"],"cloudapigateway":["18.0"],"autoconfigure":["18.0"],"autoconfigures":["18.0"],"framework":["18.0","39.1"],"学习记录":["20.0"],"tools":["20.0"],"页面排版混乱":["21.0"],"工作队列":["22.1"],"在一个电商平台的后端系统中":["22.1"],"spring框架":["22.2"],"核心实现":["22.2"],"同时避免过多的线程闲置":["22.3"],"技术实现":["22.3","22.4"],"在spring框架中":["22.3"],"以及数据库连接池等外部资源的限制":["22.4"],"可以通过设置queuecapacity属性来指定工作队列的大小":["22.5"],"难点解决":["22.5"],"避免因队列溢出而导致的订单丢失或系统性能下降":["22.5"],"常规单词本功能":["23.1"],"数据流转清晰":["24.0"],"因为定位元素会创建一个新的包含块":["25.0"],"如果元素的祖先元素中没有定位元素":["25.0"],"i":["27.0","61.0"],"t":["27.0"],"input":["28.1"],"图片上传组件":["28.1"],"简略列表":["28.2"],"单个sku表单":["28.2"],"重写校验方法":["28.3"],"studio中command":["30.0"],"tool需要使用8":["30.0"],"安装dockerfile":["31.0"],"安装dockercompose":["31.0"],"可按照此加密套件配置":["31.1"],"写法遵循":["31.1"],"openssl":["31.1"],"标准":["31.1"],"prefer":["31.1"],"root":["31.1"],"index":["31.1","44.1","52.1"],"location":["31.1"],"alias":["31.1"],"try":["31.1"],"files":["31.1"],"uri":["31.1"],"meeting":["33.0"],"net":["33.2","39.1"],"documentation":["33.2"],"一路点安装即可":["33.4"],"启动freeswitch":["33.5"],"支持版本回滚":["34.1"],"降低了部署风险":["34.1"],"云原生和微服务":["34.1"],"为微服务架构提供了理想的编排平台":["34.1"],"支持服务发现":["34.1"],"负载均衡和灵活部署":["34.1"],"cri":["34.2"],"路径下":["34.3"],"配置网络":["34.3"],"会为每个":["34.3"],"分配一个集群内部的":["34.3"],"ip":["34.3"],"地址":["34.3"],"并设置适当的网络规则":["34.3"],"以便":["34.3"],"之间可以相互通信":["34.3"],"启动":["34.3"],"会创建一个":["34.3"],"loadbalancer":["34.3"],"pod是kubernetes中调度和管理的基本单位":["34.5"],"container是pod中的工作负载单元":["34.5"],"存储的是实际的数据":["35.1"],"因此":["35.1"],"表本身就是按照主键聚集的":["35.1"],"查询性能":["35.1"],"在读取方面的性能较好":["35.1"],"但在写入和并发性能方面相对较弱":["35.1"],"在写入和并发性能方面更强":["35.1"],"但读取速度稍慢":["35.1"],"表行数统计":["35.1"],"保存有表的总行数":["35.1"],"可以直接使用":["35.1"],"auto":["35.2"],"create":["35.2"],"user":["35.2","49.8"],"having":["35.3","35.5"],"筛选goup":["35.3","35.5"],"by的子句":["35.3","35.5"],"创建新的聚合字段":["35.3","35.5"],"c":["35.4"],"inner":["35.4"],"条件连接":["35.4"],"数量是两表的交际":["35.4"],"outer":["35.4"],"left":["35.4","44.6"],"和":["35.4"],"包括":["35.4"],"两种类型":["35.4"],"它们分别表示查询左表和右表的所有行":["35.4"],"即使没有被匹配":["35.4"],"再加上满足条件的交集部分":["35.4"],"左表或者右表长度":["35.4"],"加上交集":["35.4"],"实现right":["35.4"],"主表":["35.4"],"关联表顺序需要调换":["35.4"],"这可能导致代码难以理解":["37.0"],"维护和调试":["37.0"],"可移植性差":["37.0"],"位运算的结果可能依赖于底层的二进制表示和硬件架构":["37.0"],"在不同的平台和环境中":["37.0"],"位运算的结果可能不一致":["37.0"],"导致代码在不同环境下表现不同":["37.0"],"全局自动前端刷新token":["37.1"],"和vo":["37.3"],"api":["38.1","53.21"],"因此速度更快":["39.1"],"性能更高":["39.1"],"支持更广泛":["39.1"],"com加载项支持更广泛":["39.1"],"只需要有对应的":["39.1"],"vsto":["39.1"],"runtime运行环境":["39.1"],"有更好的word":["39.1"],"textbutton":["39.2"],"按钮1":["39.2"],"screentip":["39.2"],"onaction":["39.2"],"ontextbutton":["39.2"],"supertip":["39.2"],"inserts":["39.2"],"坑":["39.4"],"安装可配置注册表":["39.5"],"依赖项":["39.5"],"true":["39.7"],"业务服务端":["40.1"],"调用documentbuilder解析word文件":["40.1"],"用户连接或断开连接时":["40.2"],"文档已准备好保存":["40.2"],"用户完成编辑并准备保存文档时":["40.2"],"v到docker内即可":["40.3"],"be":["42.0"],"passed":["42.0"],"link":["42.0"],"https":["42.0"],"mishoo":["42.0"],"uglifyjs":["42.0"],"按照顺序拿出来":["43.3"],"尝试捕获到之后重试":["43.5"],"它并没有内置的状态管理功能":["43.6"],"而是鼓励开发者使用其他流行的状态管理库":["43.6"],"互动式学英语":["44.0"],"add":["44.1"],"fulltext":["44.1"],"content":["44.1"],"ftindex":["44.1"],"translation":["44.1"],"select":["44.1"],"from":["44.1"],"加入分享":["44.2"],"private":["44.4"],"request":["44.5"],"if":["44.5"],"throw":["44.5"],"new":["44.5"],"businessexception":["44.5"],"errorcode":["44.5"],"params":["44.5"],"error":["44.5"],"cw":["44.6"],"join":["44.6"],"社区活跃度较高":["45.1"],"js技术栈":["45.1"],"需要注意的是":["45.2"],"如果需要编译ios应用":["45.2"],"则需要":["45.2"],"安装xcode":["45.2"],"macos虚拟机":["45.2"],"build":["45.2","49.7"],"repositories":["45.2"],"maven":["45.2"],"url":["45.2"],"command":["46.0"],"line":["46.0"],"tools三者":["46.0"],"amazon":["47.2"],"corretto":["47.2"],"worker进程":["48.1"],"避免主进程中继":["48.1"],"其他功能":["49.6"],"官网文档":["49.6"],"相当于":["49.7"],"updatetime":["49.8"],"time":["49.8"],"updateuser":["49.8"],"alive的问题":["52.0"],"js":["52.1","53.0"],"在vue中":["52.1"],"渲染阶段是在事件循环的任务队列执行完毕后进行的":["52.1"],"如果一次事件循环中":["52.1"],"调用了nexttick":["52.1"],"传入了回调":["52.1"],"那么nexttick改变的值会在":["52.1"],"在dom更新队列被刷新之后执行回调函数":["52.1"],"dom更新队列刷新之后":["52.1"],"并不一定会进入渲染阶段":["52.1"],"如果nexttick中":["52.1"],"还有微任务":["52.1"],"那么会等微任务执行完了之后再渲染相关的dom更新队列":["52.1"],"当vue检测到需要进行重新渲染时":["52.1"],"它会将渲染的任务添加到任务队列中":["52.1"],"该任务会在当前任务执行完毕后立即执行":["52.1"],"unref是获取引用值":["52.4"],"但并不会递归获取":["52.4"],"blogs":["53.0"],"coding":["53.0"],"learning":["53.0"],"record":["53.0"],"three":["53.0"],"mesh":["53.4"],"draco":["53.4"],"移除不必要的数据":["53.5"],"在gltf":["53.5"],"glb文件中":["53.5"],"可能包含一些不必要的数据":["53.5"],"如动画":["53.5"],"骨骼":["53.5"],"材质等":["53.5"],"mp":["53.7","56.0"],"weixin":["53.7"],"加速跑动":["53.17"],"及常见显示效果的实现方式":["53.19"],"了解web图形领域":["53.19"],"cpu和gpu端的性能优化方法":["53.19"],"熟悉web技术栈":["53.19"],"几何":["53.20"],"图形学和渲染技术":["53.20"],"webgl":["53.21"],"体积最小":["53.23"],"效果最好":["53.23"],"才可以开通微信支付":["54.2"],"不同实例之间互不影响":["55.4"],"例外":["55.4"],"digestutil":["55.6"],"md5hex":["55.6"],"randomutil":["55.6"],"randomnumbers":["55.6"],"rdic词典":["56.0"],"分类":["56.0"],"分享加入":["56.0"],"微信公众号登录":["56.0"],"过程中":["56.0"],"plus":["56.0"],"redis":["56.0"],"熟悉好":["56.0"],"背背八股文":["56.0"],"换成邮箱登陆":["56.0"],"技术栈spring":["57.1"],"boot":["57.1"],"vue3":["57.1","59.2"],"ts":["57.1"],"微前端调研":["57.1"],"qiankun项目落地":["57.1"],"wsl":["57.1"],"nginx部署":["57.1"],"微前端权限管理设计落地":["57.1"],"不敢问成员进度":["57.2"],"怕招人口舌":["57.2"],"封装组件":["57.2"],"缺少大的整体规划":["57.2"],"效率也ok":["57.3"],"但得深入点细节和产品":["57.3"],"改掉臭毛病":["57.4"],"做的不对的时候":["57.4"],"需要承认不行":["57.4"],"不自夸":["57.4"],"不给别人负面的评价":["57.4"],"关注家人的心理健康":["57.4"],"定期组织集体的运动":["57.4"],"sse":["58.5"],"轮询":["58.5"],"收录meta方式无法收录":["59.1"],"因为meta多了data":["59.1"],"属性":["59.1"],"域名下放认证文件的模式":["59.1"],"落地":["59.2"],"vue2":["59.2"],"history控制权冲突":["59.2"],"同时有两个实例时":["59.2"],"弹窗应用使用虚拟路由":["59.2"],"部署":["59.2"],"运维用k8s不熟":["59.2"],"混淆了redirect与tryfiles":["59.2"],"微博":["59.3"],"从上往下时":["59.3"],"nexttick中节点渲染好了就把container高度固定死":["59.3"],"滑动过快到底部往上走":["59.3"],"高度跳变":["59.3"],"总结":["59.4"],"attrs":["59.5"],"用户接受程度":["59.6"],"chrome插件":["59.6"],"框架无关":["60.0"],"astro":["60.0"],"其他同学":["60.0"],"ubuntu安装deb包":["61.0"],"sudo":["61.0"],"dpkg":["61.0"],"package":["61.0"],"pages":["64.0"]},{"0":["30.0"],"1":["52.1"],"2":["17.0","46.0","52.1"],"3":["12.10","52.1"],"4":["40.2","53.5","55.6"],"5":["59.2"],"6":["34.1","34.3","53.19"],"8":["47.2","55.6"],"105":["23.2"],"232":["47.2"],"301":["31.1"],"373":["18.0"],"2023":["53.17"],"8880":["23.2"],"data":["0.0"],"for":["0.0"],"current":["0.0"],"of":["0.9"],"70b":["1.2"],"gradio":["2.0"],"queue":["2.0"],"api":["2.0","23.2","33.2","53.19"],"360w以太币":["3.4"],"供应商货物":["4.0"],"品质稳定":["4.0"],"wechat":["5.1"],"使用":["6.0"],"dialogue":["8.1"],"这些能力":["8.1"],"才是未来":["8.1"],"ai出现后":["8.1"],"比如":["9.0"],"一个数学计算工具类中可能包含一些常用的数学常数":["9.0"],"这些常数可以声明为静态变量":["9.0"],"计数器":["9.0"],"console":["10.0","42.0"],"system":["10.0"],"setproperty":["10.0"],"org":["10.0"],"apache":["10.0"],"each":["12.9"],"other":["12.9"],"or":["12.9"],"elit":["12.10"],"integer":["12.10","44.4"],"molestie":["12.10"],"massa":["12.10"],"you":["12.10"],"can":["12.10"],"syntax":["12.11"],"highlighting":["12.11"],"js":["12.11","56.0"],"var":["12.11","13.1"],"foo":["12.11"],"pica":["12.13"],"enable":["12.13"],"url":["12.14"],"location":["12.14","39.2"],"https":["12.14","31.1"],"support":["12.15"],"to":["12.16"],"change":["12.16"],"o":["12.17","34.2"],"footnotecan":["12.20"],"have":["12.20"],"compact":["12.21"],"style":["12.21"],"and":["12.22"],"so":["12.22"],"on":["12.22","44.6"],"addon":["13.1"],"require":["13.1"],"bindings":["13.1"],"法律文书撰写":["14.0"],"公文撰写":["14.0"],"成为一个好的leader":["15.0"],"帮人解决问题":["15.0"],"被人依赖":["15.0"],"能做关键决定":["15.0"],"开放心态":["15.0"],"倾向性价值观":["15.0"],"build":["17.0"],"application":["17.0"],"client":["18.0"],"user":["18.0"],"好用的工具":["20.0"],"线索第二次进入":["21.0"],"假设我们需要设计一个用于处理订单的自定义线程池":["22.1"],"自定义线程池用于管理订单处理的并发执行":["22.2"],"重点难点":["22.2"],"可以使用threadpooltaskexecutor来创建自定义线程池":["22.3"],"并通过设置corepoolsize属性来指定核心线程数":["22.3"],"在threadpooltaskexecutor中":["22.4"],"可以通过设置maxpoolsize属性来指定最大线程数":["22.4"],"需要根据系统负载和任务处理时间来动态调整工作队列的大小":["22.5"],"并采取适当的任务拒绝策略":["22.5"],"查词":["23.1"],"代码逻辑":["24.0"],"offsettop就是相对于":["25.0"],"html":["25.0"],"p":["27.0"],"总的组件数有上万个":["28.1"],"同上2":["28.2"],"引入validate":["28.3"],"读取elform下面的elformitem数据":["28.3"],"apk安装包":["30.0"],"获取ssl证书":["31.0"],"填写您的证书绑定的域名":["31.1"],"例如":["31.1"],"cloud":["31.1"],"tencent":["31.1"],"return":["31.1"],"host":["31.1"],"request":["31.1"],"将http的域名请求转成https":["31.1"],"shell":["31.1"],"sh":["31.1"],"down":["31.1"],"getnameen":["32.0"],"webrtc":["33.0"],"x":["33.2"],"session":["33.2"],"用管理员方式运行":["33.4"],"管理员方式启动":["33.5"],"可以无缝地与其他云原生工具":["34.1"],"如prometheus":["34.1"],"istio等":["34.1"],"集成":["34.1"],"构建完整的云原生应用程序堆栈":["34.1"],"类型的":["34.3"],"并将其与":["34.3"],"关联":["34.3"],"该":["34.3"],"会获取一个集群外部可访问的":["34.3"],"并将流量转发到后端":["34.3"],"自动扩缩容":["34.3"],"如果应用程序负载发生变化":["34.3"],"可以根据":["34.3"],"中定义的副本数量":["34.3"],"它包含了应用程序代码和所需的依赖库":["34.5"],"每个container都是隔离的":["34.5"],"拥有自己的文件系统":["34.5"],"select":["35.1"],"count":["35.1"],"from":["35.1"],"table":["35.1"],"获取":["35.1"],"没有保存表的总行数":["35.1"],"因此在使用":["35.1"],"时会遍历整个表":["35.1"],"消耗较大":["35.1"],"engine":["35.2"],"substitution":["35.2"],"推荐sql学习":["35.2"],"sum":["35.3","35.5"],"rank":["35.3","35.5"],"开窗函数":["35.3","35.5"],"中分组":["35.3"],"分数":["35.4"],"使用子查询的方式来获取存在对应班级的学生的所有数据":["35.4"],"返回学生姓名":["35.4"],"字段":["35.4"],"in":["35.4","44.1"],"是否存在":["35.4"],"exists":["35.4"],"子查询的方式来获取":["35.4"],"不存在对应班级的":["35.4"],"学生的所有数据":["35.4"],"难以调试":["37.0"],"由于位运算操作是直接在二进制位上进行的":["37.0"],"调试过程中很难直观地观察和理解中间结果":["37.0"],"这可能增加调试的复杂性和困难度":["37.0"],"综上所述":["37.0"],"位运算在":["37.0"],"javascript":["37.0"],"react":["37.1"],"value":["37.3"],"声明式router":["38.1"],"wps客户端兼容性":["39.1"],"可定制性更强":["39.1"],"com加载项可以使用本地编程语言进行开发":["39.1"],"支持更多的编程语言特性和库函数":["39.1"],"发布受厂商限制少3":["39.1"],"采用的技术选型":["39.1"],"com加载项":["39.1"],"结合webview":["39.1"],"优势":["39.1"],"at":["39.2"],"the":["39.2"],"cursor":["39.2"],"tablebutton":["39.2"],"按钮2":["39.2"],"代码证书":["39.4"],"一套代码":["39.5"],"打包后一次性安装":["39.5"],"wps":["39.7"],"用户端服务":["40.1"],"发生文档保存错误":["40.2"],"在尝试保存文档时出现错误":["40.2"],"文档已关闭":["40.2"],"compress":["42.0"],"drop":["42.0"],"debugger":["42.0"],"pure":["42.0"],"funcs":["42.0"],"然后用fetch":["43.3"],"如":["43.6"],"redux":["43.6"],"场景例句巩固":["44.0"],"where":["44.1","49.8"],"match":["44.1"],"against":["44.1"],"润":["44.1"],"boolean":["44.1"],"mode":["44.1"],"私有单词库":["44.2"],"默认所有人可以编辑":["44.2"],"dicspage":["44.5"],"调用mybatis":["44.5"],"plus包装的mapper接口":["44.5"],"dics":["44.6"],"wordid":["44.6"],"总的来说":["45.1"],"不分伯仲":["45.1"],"aliyun":["45.2"],"com":["45.2","53.7","59.1"],"repository":["45.2"],"public":["45.2"],"android":["46.0"],"不报错了":["46.0"],"09":["47.2"],"const":["48.1"],"new":["48.1","49.7"],"browserwindow":["48.1"],"后端的代码":["49.6"],"status":["49.8"],"添加配置之后":["49.8"],"解决方案":["52.0"],"路由拍平":["52.0"],"一旦进入渲染阶段":["52.1"],"vue会执行以下操作":["52.1"],"比对虚拟dom":["52.1"],"virtual":["52.1"],"dom":["52.1"],"vue会比对当前的虚拟dom和上一次渲染时的虚拟dom":["52.1"],"找出两者之间的差异":["52.1"],"执行dom更新":["52.1"],"根据比对的结果":["52.1"],"vue会将需要更新的dom元素添加到更新队列中":["52.1"],"执行异步更新":["52.1"],"vue会将dom更新操作放入微任务队列中":["52.1"],"以便在当前任务执行完毕后立即执行":["52.1"],"toraw是获取响应式对象的原始对象":["52.4"],"md":["53.0"],"description":["53.0"],"这是默认设置":["53.0"],"请设置":["53.0"],"custommade":["53.0"],"打开korofileheader查看配置":["53.0"],"进行设置":["53.0"],"draco算法优化":["53.4"],"如果你的应用程序不需要这些数据":["53.5"],"可以考虑在导出模型时将其移除":["53.5"],"以减小文件大小":["53.5"],"优化模型结构":["53.5"],"检查模型的结构":["53.5"],"确保没有重复的顶点或面片":["53.5"],"qq":["53.7"],"06":["53.17"],"及webgl":["53.19"],"有较强的学习能力":["53.19"],"问题分析与解决能力":["53.19"],"热爱技术和软件开发":["53.19"],"加分项":["53.19"],"及常见显示效果的实现方式":["53.20"],"了解rust":["53.20"],"rust":["53.21"],"webassembly":["53.21"],"图形学":["53.21"],"如果没有复杂交互":["53.23"],"锁对象是":["55.4"],"class以及synchronized修饰的是static方法的时候":["55.4"],"所有对象公用同一把锁":["55.4"],"插入数据":["55.6"],"setuseraccount":["55.6"],"setuserpassword":["55.6"],"前端项目沉淀":["56.0"],"next":["56.0"],"项目脚手架":["56.0"],"headless":["56.0"],"ui组件库":["56.0"],"选择开源项目细分领域":["56.0"],"给领域知名项目提pr":["56.0"],"可以从bug修复开始":["56.0"],"参与知名项目的技术事务":["56.0"],"读完了":["57.1"],"vue":["57.1"],"js设计与实现":["57.1"],"react技术揭秘":["57.1"],"深入浅出electron原理":["57.1"],"工程与实践":["57.1"],"等书籍":["57.1"],"antd":["57.1"],"如设计机构saas中的组件库规划":["57.2"],"过于专注于技术测":["57.2"],"但缺少对产品本身":["57.2"],"交互的钻研":["57.2"],"测试对好":["57.3"],"从同事":["57.3"],"露营":["57.4"],"短途旅行":["57.4"],"给家人做饭":["57.4"],"新家装修":["57.4"],"风格":["57.4"],"整体方案确认":["57.4"],"初步定设计图":["57.4"],"ws":["58.5"],"用户反馈登录态过期":["59.1"],"实际上www":["59.1"],"abc":["59.1"],"com访问和abc":["59.1"],"com存的cookie":["59.1"],"domain分别是":["59.1"],"和abc":["59.1"],"element冲突主应用":["59.2"],"elemtnplus":["59.2"],"基座影响子应用":["59.2"],"解决方式是对子应用postcss":["59.2"],"依赖包处理增加prevfix处理":["59.2"],"也可以主应用本身cs也用打包工具处理":["59.2"],"加scoped或者前缀":["59.2"],"发版时已经加载的页面":["59.2"],"白屏问题":["59.3"],"小红书的瀑布流虚拟列表":["59.3"],"直接把滚动条隐藏了":["59.3"],"只能滑轮滚":["59.3"],"rem有局限性吗":["59.4"],"props等":["59.5"],"分发问题":["59.6"],"多主题":["60.0"],"配置ui":["60.0"],"deb":["61.0"],"杀掉8888端口应用":["61.0"],"lsof":["61.0"]},{"1":["53.4"],"2":["39.4"],"4":["52.1","56.0"],"5":["52.1","53.5"],"6":["40.2"],"7":["34.3"],"8":["34.3"],"12":["18.0"],"13":["18.0"],"15":["53.17"],"30":["18.0"],"41":["18.0"],"46":["53.4"],"241":["18.0"],"349":["18.0"],"2024":["18.0"],"3306":["27.0"],"8888":["61.0"],"it":["0.0"],"works":["0.0"],"in":["0.0"],"both":["0.0"],"md":["0.0"],"runtime":["0.9"],"apis":["0.9"],"rest":["1.2"],"api就启动好在本地了":["1.2"],"http":["1.2"],"xformers":["2.0"],"打开文档":["2.0"],"防止梯子问题":["2.0"],"结论传统产业":["4.0"],"也ok":["4.0"],"选择性update":["6.0"],"做模型是没有意义的":["8.1"],"就像iphone出来后":["8.1"],"大量的山寨手机":["8.1"],"很快就会被市场淘汰":["8.1"],"静态变量可以用于跟踪类的实例创建了多少次":["9.0"],"或者用于记录某个事件发生的次数":["9.0"],"总的来说":["9.0","34.1"],"静态变量适合用于表示类级别的属性":["9.0"],"commons":["10.0"],"jelly":["10.0"],"tags":["10.0"],"fmt":["10.0"],"timezone":["10.0"],"link":["11.0"],"smartypants":["12.7"],"double":["12.7"],"quotes":["12.7"],"and":["12.7"],"with":["12.9","12.16","18.0"],"spaces":["12.9"],"between":["12.9"],"use":["12.10","18.0","47.2"],"sequential":["12.10"],"numbers":["12.10"],"keep":["12.10","57.4"],"all":["12.10","35.4"],"the":["12.10"],"as":["12.10"],"function":["12.11"],"bar":["12.11"],"return":["12.11"],"console":["12.11","13.1"],"linkify":["12.13"],"to":["12.13"],"octodex":["12.14"],"github":["12.14","35.2","53.0"],"com":["12.14","35.2"],"dojocat":["12.14"],"syntax":["12.15"],"output":["12.16","42.0"],"markupand":["12.20"],"multiple":["12.20"],"paragraphs":["12.20"],"hyper":["12.22"],"text":["12.22"],"hello":["13.1"],"log":["13.1","42.0"],"等领域模型":["14.0"],"上下文提示":["14.0"],"热情":["15.0"],"冲劲":["15.0"],"抓住重点":["15.0"],"看透本质":["15.0"],"能画饼":["15.0"],"yml中添加占位":["17.0"],"yml":["17.0"],"spring":["17.0","18.0"],"name":["17.0"],"wxmp":["17.0"],"默认":["17.0"],"artifact":["18.0"],"hibernate":["18.0"],"validator":["18.0"],"final":["18.0"],"has":["18.0"],"been":["18.0"],"relocated":["18.0"],"default":["18.0"],"deleting":["18.0"],"target":["18.0"],"utf":["18.0"],"encoding":["18.0"],"copy":["18.0"],"filtered":["18.0"],"copying":["18.0"],"compiler":["18.0"],"compile":["18.0"],"detected":["18.0"],"recompiling":["18.0"],"module":["18.0"],"compiling":["18.0"],"source":["18.0"],"files":["18.0"],"classes":["18.0"],"src":["18.0"],"main":["18.0"],"executor":["18.0"],"namedthreadfactory":["18.0"],"uses":["18.0"],"or":["18.0"],"overrides":["18.0"],"deprecated":["18.0"],"that":["18.0"],"marked":["18.0"],"removal":["18.0"],"recompile":["18.0"],"xlint":["18.0"],"details":["18.0"],"controller":["18.0"],"institutionreportskucontroller":["18.0"],"input":["18.0"],"unchecked":["18.0"],"unsafe":["18.0"],"operations":["18.0"],"testresources":["18.0"],"not":["18.0"],"testcompile":["18.0"],"sources":["18.0"],"surefire":["18.0"],"tests":["18.0"],"are":["18.0"],"skipped":["18.0"],"repackage":["18.0"],"replacing":["18.0"],"repackaged":["18.0"],"archive":["18.0"],"installing":["18.0"],"pom":["18.0"],"success":["18.0"],"total":["18.0"],"time":["18.0"],"finished":["18.0"],"02":["18.0"],"07t08":["18.0"],"08":["18.0"],"00":["18.0"],"cp":["18.0"],"rf":["18.0"],"anything":["20.0"],"分享一些代码":["20.0"],"没有请求html":["21.0"],"最大线程数和工作队列的设计时需要注意":["22.1"],"保证订单处理的高并发和可靠性":["22.2"],"避免资源竞争和订单丢失":["22.2"],"难点解决":["22.3","22.4"],"通过监控订单请求量和系统资源利用率":["22.3"],"避免因线程过多而导致资源竞争或内存溢出的问题":["22.4"],"通过以上的结构化设计考量":["22.5"],"可以设计出一个高效":["22.5"],"稳定的订单处理线程池":["22.5"],"发音":["23.1"],"translate":["23.2"],"getresult":["23.2"],"query":["23.2"],"越少分支越好":["24.0"],"元素的":["25.0"],"所以offsettop是相对于最近的定位祖先元素":["25.0"],"页面性能问题严重":["28.1"],"200多个物料的场景就卡的动不了":["28.1"],"总结":["28.2","58.5","59.1","59.2"],"多了个":["28.2"],"不定高度虚拟列表处理":["28.2"],"拿到需要校验的validator":["28.3"],"循环列表传入数据":["28.3"],"点击下载":["30.0"],"git仓库":["30.0"],"sl证书解析配置":["31.0"],"stop":["31.1"],"f":["31.1"],"rm":["31.1"],"rmi":["31.1"],"up":["31.1"],"updatedist":["31.1"],"mv":["31.1"],"backup":["31.1"],"date":["31.1"],"y":["31.1"],"m":["31.1"],"update":["32.0"],"entity的方法":["32.0"],"是一个webrtc的封装库":["33.0"],"javascript":["33.2"],"替换轨道":["33.2"],"7443的端口":["33.5"],"供应商无关性":["34.1"],"kubernetes可以运行在各种环境中":["34.1"],"包括本地数据中心":["34.1"],"公有云和私有云":["34.1"],"提供了环境抽象和可移植性":["34.1"],"kubernetes通过自动化":["34.1"],"等":["34.2","43.6"],"自动水平扩展或缩容":["34.3"],"实例数量":["34.3"],"自动恢复":["34.3"],"如果某个":["34.3"],"出现故障":["34.3"],"会自动重新创建一个新的":["34.3"],"以保持应用程序的运行状态":["34.3"],"滚动更新":["34.3"],"当需要更新应用程序时":["34.3"],"支持滚动更新策略":["34.3"],"可以一次更新一部分":["34.3"],"cpu":["34.5"],"内存和进程空间":["34.5"],"一个pod可以包含一个或多个container":["34.5"],"但在加了":["35.1"],"where":["35.1","44.6"],"条件后":["35.1"],"处理方式相同":["35.1"],"总之":["35.1"],"如果你的应用需要事务支持":["35.1"],"外键约束以及更好的并发性能":["35.1"],"如果你对读取速度和全文索引有更高的要求":["35.1"],"或者处理静态数据":["35.1"],"https":["35.2","53.0"],"liyupi":["35.2"],"partition":["35.3","35.4","35.5"],"by":["35.3","35.5"],"union":["35.3","35.4","35.5"],"包括两种常见的组合查询操作":["35.4"],"操作":["35.4"],"它用于将两个或多个查询的结果集合并":["35.4"],"并去除重复的行":["35.4"],"即如果两个查询的结果有相同的行":["35.4"],"则只保留一行":["35.4"],"它也用于将两个或多个查询的结果集合并":["35.4"],"但不去除重复的行":["35.4"],"则全部保留":["35.4"],"还有一个新学生表":["35.4"],"new":["35.4"],"包含的字段和学生表完全一致":["35.4"],"语句":["35.4"],"获取所有学生表和新学生表的学生姓名":["35.4"],"要求保留重复的学生记录":["35.4"],"开窗函数":["35.4"],"over":["35.4"],"打个比方":["35.4"],"可以将开窗函数想象成一种":["35.4"],"透视镜":["35.4"],"它能够将我们聚焦在某个特定的分组":["35.4"],"同时还能看到整体的全景":["35.4"],"本节我们先讲第一个开窗函数":["35.4"],"该函数用法为":["35.4"],"返回每个学生的详细信息":["35.4"],"字段顺序和原始表的字段顺序一致":["35.4"],"并计算每个班级的学生平均分":["35.4"],"中分组":["35.5"],"领域具有一些优势":["37.0"],"如高效性能和节省空间":["37.0"],"然而":["37.0"],"它也存在一些缺点":["37.0"],"如可读性较差和可移植性差":["37.0"],"在使用位运算时":["37.0"],"需权衡其优势和缺点":["37.0"],"suspense":["37.1"],"都是用于在系统之间传输数据的对象":["37.3"],"便于内网部署":["39.1"],"web项目集成":["39.1"],"能同时兼容wps":["39.1"],"office":["39.1"],"web资源支持增量更新":["39.1"],"支持clickone部署":["39.1"],"一次安装":["39.1"],"后续远程自动更新":["39.1"],"难点":["39.1"],"webview":["39.1"],"table":["39.2","42.0"],"ontablebutton":["39.2"],"a":["39.2"],"自建证书不支持自动更新":["39.4"],"word":["39.5"],"wps":["39.5"],"传参给业务服务端渲染word":["40.1"],"没有任何更改":["40.2"],"用户关闭文档且未做任何更改":["40.2"],"编辑中保存":["40.2"],"用户在编辑过程中保存了文档的当前状态":["40.2"],"sourcemap":["42.0"],"false":["42.0","48.1"],"entry":["42.0"],"foo":["42.0"],"sdk文件入口":["42.0"],"请求回来":["43.3"],"按照顺序内联在子应用里面运行":["43.3"],"vuex":["43.6"],"单词本":["44.1"],"增加":["44.1"],"done":["44.1"],"单词本分享":["44.1"],"单词本分类":["44.1"],"单词本改名":["44.1"],"单词":["44.1"],"分享编辑单词库":["44.2"],"isdelete":["44.4"],"list":["44.5"],"dicslist":["44.5"],"customwordsmapper":["44.5"],"getdictionariesbyworkbookid":["44.5"],"workbookid":["44.5"],"customwordspage":["44.5"],"国际服上对flutter的技术认可度高些":["45.1"],"reactnative":["45.1"],"google":["45.2","57.1"],"project":["46.0"],"structure":["46.0"],"设置sdk为33":["46.0"],"show":["48.1"],"webpreferences":["48.1"],"nodeintegration":["48.1"],"写起来好丝滑":["49.6"],"setstatus":["49.7"],"支持别名":["49.8"],"不用引用完整路径":["49.8"],"mapper配置文件":["49.8"],"mapper":["49.8"],"locations":["49.8"],"classpath":["49.8"],"扫描包名":["49.8"],"type":["49.8"],"aliases":["49.8"],"每一层路由都需要加keepalive":["52.0"],"执行实际的dom操作":["52.1"],"在微任务队列执行时":["52.1"],"vue会遍历更新队列":["52.1"],"并根据具体的dom操作":["52.1"],"添加":["52.1"],"删除":["52.1"],"修改等":["52.1"],"对真实的dom进行操作":["52.1"],"渲染完成":["52.1"],"一旦完成dom的更新":["52.1"],"vue会触发":["52.1"],"mounted":["52.1"],"或":["52.1"],"updated":["52.1"],"会递归解开proxy对象":["52.4"],"obkoro1":["53.0"],"koro1fileheader":["53.0"],"wiki":["53.0"],"e9":["53.0"],"正常加载":["53.4"],"感兴趣的朋友可以了解一下":["53.4"],"压缩的技术":["53.4"],"优化模型结构可以减小文件大小":["53.5"],"并提高渲染性能":["53.5"],"使用压缩工具":["53.5"],"你可以使用gltf":["53.5"],"glb的压缩工具来进一步减小文件大小":["53.5"],"这些工具可以对模型进行压缩和优化":["53.5"],"s":["53.7"],"g4whbdmgnj5ol2t1d":["53.7"],"有业余开源项目供技术参考":["53.19"],"深入了解过至少一款渲染引擎的内部实现架构和技术细节":["53.19"],"了解rust":["53.19"],"webassembly":["53.20"],"webgpu等技术":["53.20"],"渲染技术":["53.21"],"几何":["53.21"],"只是循环的3d动画":["53.23"],"只根据白天晚上切换video":["53.23"],"synchronized修饰的方法":["55.4"],"setaccesskey":["55.6"],"setsecretkey":["55.6"],"boolean":["55.6"],"saveresult":["55.6"],"this":["55.6"],"save":["55.6"],"比如":["56.0"],"rfc":["56.0"],"讨论":["56.0"],"bug":["56.0"],"修":["56.0"],"成为知名项目活跃contributor":["56.0"],"成为知名项目核心成员":["56.0"],"为什么程序员要出书":["56.0"],"在行业会议演讲":["56.0"],"写系列文章":["56.0"],"g6库":["57.1"],"用":["57.1"],"svg图":["57.1"],"画类3d的图":["57.1"],"方法论":["57.1"],"重视github":["57.1"],"issue":["57.1"],"官网文档":["57.1"],"需求侧未确定导致的变动返工多":["57.2"],"技能和知识增长":["57.2"],"其实还有一些翻了一部分的书":["57.2"],"看了一部分的视频课程":["57.2"],"上级或客户那里收到了很多肯定和改进的建议":["57.3"],"对团队或公司提出了一些改进的建议":["57.3"],"todo":["57.4","59.4"],"新的一年":["57.4"],"大家都走好运":["57.4"],"looking":["57.4"],"until":["57.4"],"you":["57.4"],"find":["57.4"],"落地":["58.5"],"不一致导致的":["59.1"],"如果是不同的子域名":["59.1"],"使用oauth2":["59.1"],"做登录态共享":["59.1"],"加载了过期的已加载js":["59.2"],"请求了chunk中过期的异步加载css":["59.2"],"页面级别":["59.2"],"导致的样式错乱问题":["59.2"],"loader捕捉css加载的err":["59.2"],"ps":["59.2"],"运维手段是立即删除所有旧的资源":["59.2"],"cdn共享组件库优化":["59.2"],"多tab场景下vnode缓存todo":["59.2"],"思考":["59.2"],"并且后端接口数据中直接返回图片的宽高":["59.3"],"pc端的微博":["59.3"],"刷的过快它一定会先白屏之后再出现内容":["59.3"],"其次就是像腾讯会议里回放的文本记录":["59.3"],"每段文本记录都是item":["59.3"],"原生组件有坑":["59.5"],"谷歌市场上架":["59.6"],"onlyoffice":["59.6"],"富文本编辑器":["60.0"],"hexo":["60.0"],"kill":["61.0"],"上面的pid":["61.0"],"查看系统版本":["61.0"]},{"4":["42.0"],"5":["12.11"],"6":["53.5"],"7":["18.0","40.2","53.5"],"9":["18.0"],"57":["12.10"],"85":["53.0"],"147":["18.0"],"1364":["35.1"],"4716":["18.0"],"11434":["1.2"],"12345":["35.1"],"vue":["0.0"],"files":["0.0"],"localhost":["1.2"],"桌面端配套":["1.2"],"能开放sdui的api文档接口":["2.0"],"可以进一步二开":["2.0"],"数据":["8.1"],"提到自己的公司":["8.1"],"stastic":["8.1"],"这些属性对于所有实例都是相同的":["9.0"],"或者在整个程序执行期间保持不变":["9.0"],"执行":["10.0"],"留言":["11.0"],"single":["12.7"],"strikethrough":["12.8"],"arrows":["12.9"],"numbering":["12.10"],"offset":["12.10"],"foo":["12.10"],"bar":["12.10"],"log":["12.11"],"see":["12.13","18.0"],"jpg":["12.14"],"twemoji":["12.16"],"2a":["12.21"],"2b":["12.21","18.0"],"markup":["12.22"],"language":["12.22"],"world":["13.1"],"灵活":["14.0"],"甘愿成就他人":["15.0"],"时间管理":["15.0"],"想清楚再做":["15.0"],"最短时间管理":["15.0"],"关注长期利益":["15.0"],"环境":["17.0"],"active":["17.0"],"支持":["17.0"],"swagger3":["17.0"],"docker":["18.0"],"t":["18.0","57.4"],"harbor":["18.0"],"latest":["18.0"],"instance":["18.0"],"driver":["18.0"],"internal":["18.0"],"load":["18.0"],"dockerignore":["18.0"],"transferring":["18.0"],"context":["18.0"],"done":["18.0"],"0s":["18.0"],"definition":["18.0"],"dockerfile":["18.0"],"539b":["18.0"],"io":["18.0"],"duxinglangzi":["18.0"],"alpine":["18.0"],"java11":["18.0"],"60mb":["18.0"],"4s":["18.0"],"run":["18.0"],"ln":["18.0"],"sf":["18.0"],"usr":["18.0"],"share":["18.0"],"zoneinfo":["18.0"],"asia":["18.0"],"shanghai":["18.0"],"etc":["18.0"],"localtime":["18.0"],"cached":["18.0"],"mkdir":["18.0"],"p":["18.0"],"workdir":["18.0"],"add":["18.0"],"2s":["18.0"],"opentelemetry":["18.0"],"javaagent":["18.0"],"arthas":["18.0"],"exporting":["18.0"],"image":["18.0"],"layers":["18.0"],"3s":["18.0"],"writing":["18.0"],"sha256":["18.0"],"b3f3032d24c1fd8a9b754a466ff3752f95f88fef600c7b15a72558f40375df4b":["18.0"],"naming":["18.0"],"login":["18.0"],"admin":["18.0"],"kbk6gspk8323ke639ilgqe":["18.0"],"password":["18.0"],"via":["18.0"],"cli":["18.0"],"insecure":["18.0"],"stdin":["18.0"],"will":["18.0"],"stored":["18.0"],"unencrypted":["18.0"],"lib":["18.0"],"json":["18.0"],"configure":["18.0"],"helper":["18.0"],"remove":["18.0"],"docs":["18.0"],"engine":["18.0"],"reference":["18.0"],"commandline":["18.0"],"store":["18.0"],"succeeded":["18.0"],"push":["18.0"],"refers":["18.0"],"d13869d0912e":["18.0"],"preparing":["18.0"],"12f16e5ab9ae":["18.0"],"2dedde4f174d":["18.0"],"5f70bf18a086":["18.0"],"37044c4bf4ce":["18.0"],"2e9c3dcb4310":["18.0"],"7dfcf721d46c":["18.0"],"018a9e842966":["18.0"],"bfbf3abdb35e":["18.0"],"c4d1b17971e5":["18.0"],"b311f6059b1e":["18.0"],"6b0ac22b586f":["18.0"],"4ce9227a27cf":["18.0"],"d17fd464e7c5":["18.0"],"bde76260b707":["18.0"],"54016b302478":["18.0"],"eb525327e85b":["18.0"],"3d18e271d2a5":["18.0"],"bb1b4953a69d":["18.0"],"8c2deaf64810":["18.0"],"34d5ebaa5410":["18.0"],"waiting":["18.0"],"layer":["18.0"],"already":["18.0"],"exists":["18.0"],"pushed":["18.0"],"digest":["18.0"],"32c96c17caca556b45ec7706d4740133c7498acb1bc80f04fbac831e57749d8d":["18.0"],"size":["18.0"],"rmi":["18.0"],"untagged":["18.0"],"deleted":["18.0"],"kubectl":["18.0"],"n":["18.0"],"rollout":["18.0"],"restart":["18.0"],"deployment":["18.0"],"apps":["18.0"],"restarted":["18.0"],"学习之外的东西":["20.0"],"动态调整核心线程数以适应业务需求的变化":["22.3"],"需要通过压力测试和性能调优来确定合适的最大线程数":["22.4"],"以满足业务需求的高并发和可靠性要求":["22.5"],"fuck":["23.2"],"不一定是直接的父元素":["25.0"],"体验产品":["28.2"],"业务同学也认为单个sku表单更合理":["28.2"],"结果几乎是把elform的核心校验逻辑走了一遍":["28.3"],"flutter":["30.0"],"demo":["30.0"],"h":["31.1"],"unzip":["31.1"],"o":["31.1"],"home":["31.1"],"lighthouse":["31.1"],"dist":["31.1"],"cp":["31.1"],"rf":["31.1"],"zip":["31.1"],"运行":["31.1"],"参考连接":["31.1"],"dto的值":["32.0"],"list":["32.0"],"用法":["32.0"],"若是webrtc重新createoffer":["33.2"],"替换轨道需要用发起重启createoffer":["33.2"],"编排和管理容器化应用程序":["34.1"],"大大简化了部署和运维工作":["34.1"],"提高了应用程序的可靠性":["34.1"],"可伸缩性和可移植性":["34.1"],"从而加速了企业向云原生应用程序和微服务架构的转型":["34.1"],"从而实现无停机部署":["34.3"],"总的来说":["34.3"],"在应用了上述配置后":["34.3"],"会自动处理应用程序的部署":["34.3"],"扩缩容":["34.3"],"恢复":["34.3"],"更新等生命周期管理任务":["34.3"],"只需要关注应用程序本身的开发和构建":["34.3"],"而无需处理太多的运维逻辑":["34.3"],"不过":["34.3"],"如果有特殊的需求或要对":["34.3"],"进行更多定制":["34.3"],"还是需要了解更多关于":["34.3"],"的知识":["34.3"],"这些container共享pod的资源":["34.5"],"那么":["35.1"],"可能更适合你":["35.1"],"执行sql报错":["35.1"],"http":["35.1"],"www":["35.1"],"kurui":["35.1"],"me":["35.1"],"error":["35.1"],"html":["35.1"],"mother":["35.2"],"all":["35.3","35.5"],"联表":["35.3","35.5"],"组内数据累加":["35.4"],"依次求和":["35.4"],"并且按照分数升序的方式累加计算每个班级的学生总分":["35.4"],"相当于groupby":["35.4"],"根据xxx分组":["35.4"],"此处为根据班级分组":["35.4"],"并且按照分数降序的方式计算每个班级内的学生的分数排名":["35.4"],"ranking":["35.4"],"rank":["35.4"],"根据班级分组":["35.4"],"row":["35.4"],"number":["35.4"],"几乎和rank一样":["35.4"],"完成":["35.4"],"并根据具体情况和需求选择是否使用":["37.0"],"在编写位运算代码时":["37.0"],"应注重代码的可读性":["37.0"],"可维护性和可移植性":["37.0"],"并添加适当的注释和文档说明":["37.0"],"混合开发带来的安全问题":["39.1"],"打包工具使用":["39.1"],"缺点":["39.1"],"mac系统无法兼容":["39.1"],"基于":["39.1"],"net框架":["39.1"],"以下以word插件展开讲":["39.1"],"com加载项结合webview2":["39.1"],"的技术选型":["39.1"],"vsto插件":["39.5"],"强制保存文档时发生错误":["40.2"],"在执行强制保存操作时出现错误":["40.2"],"librarytarget":["42.0"],"esm导出":["42.0"],"适配webpack3":["42.0"],"建议用umd格式导出":["42.0"],"filename":["42.0"],"better":["42.0"],"jssip":["42.0"],"输出文件名":["42.0"],"来处理子应用之间的数据共享":["43.6"],"单词本内":["44.1"],"单词增加":["44.1"],"模糊查词":["44.1"],"单词发音":["44.1"],"customwordsservice":["44.5"],"getdictionariesbyxmlworkbookid":["44.5"],"resultutils":["44.5"],"success":["44.5"],"wordbookid":["44.6"],"workbookid":["44.6"],"对前端开发友好些":["45.1"],"gradle":["45.2"],"plugin":["45.2"],"mavenlocal":["45.2"],"mavencentral":["45.2"],"jcenter":["45.2"],"中间出啥问题":["45.2"],"doctor":["45.2"],"一下":["45.2"],"按照指令处理就可以啦":["45.2"],"此时":["46.0"],"adb设备也不报错了":["46.0"],"true":["48.1","49.8"],"某个页面需要单开的场景":["48.1"],"setid":["49.7"],"package":["49.8"],"com":["49.8"],"sky":["49.8"],"entity":["49.8"],"configuration":["49.8"],"开启驼峰命名":["49.8"],"map":["49.8"],"underscore":["49.8"],"to":["49.8"],"camel":["49.8"],"case":["49.8"],"生命周期钩子函数":["52.1"],"通知开发者渲染已完成":["52.1"],"需要注意的是":["52.1"],"vue使用了异步更新策略来优化性能":["52.1"],"它会将多个同步的数据变更操作合并为一个更新任务":["52.1"],"以减少不必要的dom操作":["52.1"],"这样可以提高性能并避免频繁的ui更新":["52.1"],"总结起来":["52.1"],"vue的渲染阶段会在事件循环的任务队列执行完毕后进行":["52.1"],"在渲染阶段":["52.1"],"vue会比对虚拟dom":["52.1"],"并最终对真实的dom进行操作":["52.1"],"完成渲染过程":["52.1"],"获取原始对象":["52.4"],"8d":["53.0"],"e7":["53.0"],"bd":["53.0"],"ae":["53.0"],"web3d":["53.0"],"webgl":["53.4"],"loader":["53.4"],"pipeline":["53.4"],"以提高加载性能和减少网络传输时间":["53.5"],"图片压缩webp格式":["53.5"],"使用drc加载":["53.5"],"bamg":["53.7"],"webassembly":["53.19"],"webgpu等技术":["53.19"],"硕士研究生及以上学历":["53.19"],"相关方向或者基础学科专业":["53.19"],"线性代数":["53.21"],"那么不太需要3d渲染这么重的东西":["53.23"],"system":["55.6"],"注册失败":["55.6"],"数据库错误":["55.6"],"return":["55.6"],"getid":["55.6"],"你在某个出版社出书":["56.0"],"相当于出版社以及出版社的其他作者给":["56.0"],"你在书对应的细分领域的心智垄断":["56.0"],"做背书":["56.0"],"你在行业会议演讲":["56.0"],"相当于会议方以及与会的其他演讲嘉宾给":["56.0"],"你在演讲主题对应的细分领域的心智垄断":["56.0"],"两者都是极高效建立心智垄断的手段":["56.0"],"不看百度":["57.1"],"csdn":["57.1"],"深入理解本质的技术点后":["57.1"],"不只是靠模糊的调试和随机的尝试":["57.1"],"能成倍提高效率":["57.1"],"好的方面":["57.1"],"脸皮变厚了":["57.1"],"但是没有写清楚为什么不看了":["57.2"],"也应该留存一些笔记":["57.2"],"过后翻阅":["57.2"],"并制定了实施这些建议的计划":["57.3"],"it":["57.4"],"don":["57.4"],"settle":["57.4"],"赶路的同时":["57.4"],"也要边享受生活":["57.4"],"服务端请求中访问vue实例":["59.1"],"nuxt2不可行":["59.1"],"服务端钩子中组件没有实例化":["59.1"],"还拿不到组件上面的方法":["59.1"],"语义化标签":["59.1"],"如果跨域子域名加载怎么做":["59.2"],"rbac1表设计":["59.2"],"几张表":["59.2"],"作用是什么":["59.2"],"关联关系是什么":["59.2"],"k8s启动一个pod":["59.2"],"cicd配置流程":["59.2"],"但是因为它的高度差不是说特别大":["59.3"],"而且是纯文本":["59.3"],"这个问题就基本不存在":["59.3"],"排版可能存在与wps不一致问题":["59.6"],"wordpress":["60.0"],"ghost":["60.0"],"lsb":["61.0"],"release":["61.0"],"a024":["61.0"]}]'},n={"0.0":{t:"# Runtime API Examples\r",p:"This page demonstrates usage of some of the runtime APIs provi ...",l:"api-examples.html",a:"runtime-api-examples"},"0.1":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.2":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.3":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.4":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;




`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.5":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.6":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.7":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.8":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;
`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.9":{t:"More\r",p:"Check out the documentation for the full list of runtime APIs. ...",l:"api-examples.html#more",a:"more"},"1.0":{t:"两行代码 运行LLM\r",p:`\r
\r`,l:"blogs/ai/ollama.html",a:"两行代码-运行llm"},"1.1":{t:"项目\r",p:`ollama
`,l:"blogs/ai/ollama.html#项目",a:"项目"},"1.2":{t:"运行\r",p:`win11 wsl Ubuntu22
curl -fsSL https://ollama.com/install.sh |  ...`,l:"blogs/ai/ollama.html#运行",a:"运行"},"2.0":{t:"# stable-diffusion-ui实操\r",p:`cmd_args 参数集合
修改 webui-user.bat里
set COMMANDLINE_ARGS=--no-gra ...`,l:"blogs/ai/sdui.html",a:"stable-diffusion-ui实操"},"3.0":{t:"# 原理\r",p:"",l:"blogs/anything/block-chain.html",a:"原理"},"3.1":{t:"加密、数字签名\r",p:"",l:"blogs/anything/block-chain.html#加密、数字签名",a:"加密、数字签名"},"3.2":{t:"哈希、默克尔树\r",p:"",l:"blogs/anything/block-chain.html#哈希、默克尔树",a:"哈希、默克尔树"},"3.3":{t:"共识算法\r",p:"",l:"blogs/anything/block-chain.html#共识算法",a:"共识算法"},"3.4":{t:"基于共识的智能合约\r",p:`solidty 确保语言的确定性
the dao ico 360w以太币·
`,l:"blogs/anything/block-chain.html#基于共识的智能合约",a:"基于共识的智能合约"},"4.0":{t:"<!-- 跨境电商\r",p:`明通
免税店
总代理 不给货

大宗商品？

店铺资源 供应链 资金
供应商货物 品质稳定
--&gt;
&lt;!-- 结 ...`,l:"blogs/anything/commercial.html",a:"跨境电商"},"5.0":{t:"coding\r",p:`user interface : UI
`,l:"blogs/anything/english.html",a:"coding"},"5.1":{t:"life\r",p:`
can i connect you on wechat

`,l:"blogs/anything/english.html#life",a:"life"},"6.0":{t:"# 测试环境表结构同步到生产环境\r",p:`Dump with Format 导出ddl 整体表结构的sql 使用 选择性update
`,l:"blogs/anything/flyaway.html",a:"测试环境表结构同步到生产环境"},"7.0":{t:"使用frp实现内网穿透管理物联网设备 - 知乎-知乎文章\r",p:`需要配置服务器 服务端
使用花生壳免费版
`,l:"blogs/anything/frp.html",a:"使用frp实现内网穿透管理物联网设备-知乎-知乎文章"},"8.0":{t:"> 课代表立正\r",p:"",l:"blogs/anything/gpt.html",a:"课代表立正"},"8.1":{t:"gpt4 目前有代差\r",p:`
技术发展是s型曲线，举例计算机产生有5次
表象差距大 实际背后差距可能更大
数据处理能力、工程能力、用户数正反馈 已经让o ...`,l:"blogs/anything/gpt.html#gpt4-目前有代差",a:"gpt4-目前有代差"},"9.0":{t:"- static关键字\r",p:`
静态变量在以下情况下比较合适：

共享数据：当某个数据需要在类的所有实例之间共享时，静态变量非常有用。例如，一个类代表一个 ...`,l:"blogs/anything/java.html",a:"static关键字"},"10.0":{t:"# Jenkins gitee cicd 配置\r",p:`

安装jenkins镜像 注意使用开源版本
时区变量 -e PHP_TZ=&quot;Asia/Shanghai&quot ...`,l:"blogs/anything/jenkins.html",a:"jenkins-gitee-cicd-配置"},"11.0":{t:"# 联系我\r",p:`
邮箱: yaolinhong1024@gmail.com
github：github link
留言

`,l:"blogs/anything/link-me.html",a:"联系我"},"12.0":{t:"# h1 Heading 8-)\r",p:"",l:"blogs/anything/markdown-demo.html",a:"h1-heading-8"},"12.1":{t:"h2 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h2-heading",a:"h2-heading"},"12.2":{t:"h3 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h3-heading",a:"h3-heading"},"12.3":{t:"h4 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h4-heading",a:"h4-heading"},"12.4":{t:"h5 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h5-heading",a:"h5-heading"},"12.5":{t:"h6 Heading\r",p:`\r
\r`,l:"blogs/anything/markdown-demo.html#h6-heading",a:"h6-heading"},"12.6":{t:"Horizontal Rules\r",p:`


`,l:"blogs/anything/markdown-demo.html#horizontal-rules",a:"horizontal-rules"},"12.7":{t:"Typographic replacements\r",p:`Enable typographer option to see result.
(c) (C) (r) (R) (tm)  ...`,l:"blogs/anything/markdown-demo.html#typographic-replacements",a:"typographic-replacements"},"12.8":{t:"Emphasis\r",p:`This is bold text
This is bold text
This is italic text
This i ...`,l:"blogs/anything/markdown-demo.html#emphasis",a:"emphasis"},"12.9":{t:"Blockquotes\r",p:`
Blockquotes can also be nested...

...by using additional gre ...`,l:"blogs/anything/markdown-demo.html#blockquotes",a:"blockquotes"},"12.10":{t:"Lists\r",p:`Unordered

Create a list by starting a line with +, -, or *
Su ...`,l:"blogs/anything/markdown-demo.html#lists",a:"lists"},"12.11":{t:"Code\r",p:`Inline code
Indented code
// Some comments
line 1 of code
line ...`,l:"blogs/anything/markdown-demo.html#code",a:"code"},"12.12":{t:"Tables\r",p:`


Option
Description




data
path to data files to supply th ...`,l:"blogs/anything/markdown-demo.html#tables",a:"tables"},"12.13":{t:"Links\r",p:`link text
link with title
Autoconverted link https://github.co ...`,l:"blogs/anything/markdown-demo.html#links",a:"links"},"12.14":{t:"Images\r",p:`!Minion
!Stormtroopocat
Like links, Images also have a footnot ...`,l:"blogs/anything/markdown-demo.html#images",a:"images"},"12.15":{t:"Plugins\r",p:"The killer feature of markdown-it is very effective support of ...",l:"blogs/anything/markdown-demo.html#plugins",a:"plugins"},"12.16":{t:"Emojies\r",p:`
Classic markup: :wink: :cry: :laughing: :yum:
Shortcuts (emot ...`,l:"blogs/anything/markdown-demo.html#emojies",a:"emojies"},"12.17":{t:"Subscript / Superscript\r",p:`
19^th^
H~2~O

`,l:"blogs/anything/markdown-demo.html#subscript-superscript",a:"subscript-superscript"},"12.18":{t:"\\<ins>\r",p:`++Inserted text++
`,l:"blogs/anything/markdown-demo.html#ins",a:"ins"},"12.19":{t:"\\<mark>\r",p:`==Marked text==
`,l:"blogs/anything/markdown-demo.html#mark",a:"mark"},"12.20":{t:"Footnotes\r",p:`Footnote 1 link[^first].
Footnote 2 link[^second].
Inline foot ...`,l:"blogs/anything/markdown-demo.html#footnotes",a:"footnotes"},"12.21":{t:"Definition lists\r",p:`Term 1
:   Definition 1
with lazy continuation.
Term 2 withinl ...`,l:"blogs/anything/markdown-demo.html#definition-lists",a:"definition-lists"},"12.22":{t:"Abbreviations\r",p:`This is HTML abbreviation example.
It converts &quot;HTML&quot ...`,l:"blogs/anything/markdown-demo.html#abbreviations",a:"abbreviations"},"12.23":{t:"Custom containers\r",p:`::: warning
here be dragons
:::
`,l:"blogs/anything/markdown-demo.html#custom-containers",a:"custom-containers"},"13.0":{t:"# js中调用c++方法\r",p:"\r",l:"blogs/anything/node-addon.html",a:"js中调用c-方法"},"13.1":{t:"实现方式\r",p:`
使用node addons
node官方的 examples 使用步骤

npm install g node-gyp，对 ...`,l:"blogs/anything/node-addon.html#实现方式",a:"实现方式"},"13.2":{t:"\r",p:`npm install g node-gyp
`,l:"blogs/anything/node-addon.html#",a:""},"14.0":{t:"# api\r",p:`一些优质的官方prompt
https://platform.openai.com/examples


fine-tune ...`,l:"blogs/anything/openai-api.html",a:"api"},"15.0":{t:"- 左耳听风\r",p:`
程序员如何用技术变现


关注有价值的东西 价值取决于供需关系 分清什么是主流技术，什么是过渡式的技术


关注技术付费点 ...`,l:"blogs/anything/reading.html",a:"左耳听风"},"16.0":{t:"分割一切的py\r",p:`图形分割
`,l:"blogs/anything/segment-anything.html",a:"分割一切的py"},"17.0":{t:"Springboot 配置篇\r",p:`!Alt text


多环境配置（点击可以切换环境）
pom.xml
     &lt;profiles&gt;
     ...`,l:"blogs/anything/spring-boot.html",a:"springboot-配置篇"},"18.0":{t:"项目启动\r",p:`
启动依赖安装问题

从pom.xml中看java、maven版本
本机java版本也要与项目要求java版本一致
内网包无 ...`,l:"blogs/anything/spring-cloud.html",a:"项目启动"},"19.0":{t:"# 生成式ai\r",p:"",l:"blogs/anything/生成式ai.html",a:"生成式ai"},"19.1":{t:"多维数据向量存储词性\r",p:"",l:"blogs/anything/生成式ai.html#多维数据向量存储词性",a:"多维数据向量存储词性"},"19.2":{t:"自注意力 \r",p:`避免生成错误
`,l:"blogs/anything/生成式ai.html#自注意力",a:"自注意力"},"20.0":{t:"# 知识库\r",p:`内容导航

Coding / Learning Record 代码 学习记录
Tools 好用的工具
Anything 分享 ...`,l:"blogs/blogs.html",a:"知识库"},"21.0":{t:"# qiankun 子应用更新异常\r",p:`
现象

偶先页面渲染异常 css没加载完全、页面排版混乱


线索第二次进入 没有请求html

`,l:"blogs/bugs/qiankun-update-fail.html",a:"qiankun-子应用更新异常"},"21.1":{t:"其他\r",p:`
js级别的缓存解决方案

不缓存html



`,l:"blogs/bugs/qiankun-update-fail.html#其他",a:"其他"},"22.0":{t:"# backend interview questions\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html",a:"backend-interview-questions"},"22.1":{t:"自定义线程池\r",p:`
核心线程数
最大线程数
工作队列

在一个电商平台的后端系统中，假设我们需要设计一个用于处理订单的自定义线程池。核心线程数 ...`,l:"blogs/coding-learning-record/backend-interview.html#自定义线程池",a:"自定义线程池"},"22.2":{t:"业务场景：\r",p:`
核心业务场景：处理订单请求，包括验证订单信息、扣除库存、生成订单号等。
技术栈：Java后端开发，Spring框架。
核心 ...`,l:"blogs/coding-learning-record/backend-interview.html#业务场景",a:"业务场景"},"22.3":{t:"核心线程数（Core Pool Size）：\r",p:`
业务场景关联：核心线程数应该根据订单的日均请求量和处理时间来确定。对于一个电商平台，订单请求可能会呈现出明显的日周期性波动 ...`,l:"blogs/coding-learning-record/backend-interview.html#核心线程数-core-pool-size",a:"核心线程数-core-pool-size"},"22.4":{t:"最大线程数（Maximum Pool Size）：\r",p:`
业务场景关联：最大线程数应该根据系统的资源限制和预期的最大并发量来确定。在电商平台中，最大线程数的设置应该考虑服务器的CP ...`,l:"blogs/coding-learning-record/backend-interview.html#最大线程数-maximum-pool-size",a:"最大线程数-maximum-pool-size"},"22.5":{t:"工作队列（Work Queue）：\r",p:`
业务场景关联：工作队列用于存储尚未被执行的订单处理任务，应该能够满足高并发请求下的任务排队需求。在电商平台中，可以选择一个 ...`,l:"blogs/coding-learning-record/backend-interview.html#工作队列-work-queue",a:"工作队列-work-queue"},"22.6":{t:"OSI 七层模型是什么样的\r",p:`路由器工作在哪一层？
`,l:"blogs/coding-learning-record/backend-interview.html#osi-七层模型是什么样的",a:"osi-七层模型是什么样的"},"22.7":{t:"TCP 如何保证可靠连接？TCP 如何建立可靠的连接？三次握手的详细过程\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html#tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程",a:"tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程"},"22.8":{t:"Effective Java 要点",p:"",l:"blogs/coding-learning-record/backend-interview.html#effective-java-要点",a:"effective-java-要点"},"23.0":{t:"# 词典实现\r",p:"\r",l:"blogs/coding-learning-record/baiduTranslate.html",a:"词典实现"},"23.1":{t:"需求背景\r",p:`
支持自添加单词的单词本，记录小孩的单词量；
支持分享单词本；家人范围内共享；
常规单词本功能、查词、发音

`,l:"blogs/coding-learning-record/baiduTranslate.html#需求背景",a:"需求背景"},"23.2":{t:"核心功能 - 实现概述\r",p:`
查词

百度翻译api申请 调用
ecdict  社区词典数据库


单词发音 TTS

使用社区免费的tts
使用社区开 ...`,l:"blogs/coding-learning-record/baiduTranslate.html#核心功能-实现概述",a:"核心功能-实现概述"},"24.0":{t:"# 组件设计\r",p:`
避免冗余数据
单一职责（渲染列表 渲染组件）
数据流转清晰
代码逻辑 越少分支越好


`,l:"blogs/coding-learning-record/component-design.html",a:"组件设计"},"25.0":{t:"css踩坑\r",p:`
offsetTop是相对relative的父级 不一定是父元素


定位元素（position属性为relative、ab ...`,l:"blogs/coding-learning-record/css.html",a:"css踩坑"},"26.0":{t:"- depends_on 追加的服务可以在应用内直接映射访问\r",p:`


`,l:"blogs/coding-learning-record/docker-compose.html",a:"depends-on-追加的服务可以在应用内直接映射访问"},"27.0":{t:"# 常用docker操作\r",p:`
docker run build
docker run -i -t -p 3306:3306
&lt;!-- -  --& ...`,l:"blogs/coding-learning-record/docker.html",a:"常用docker操作"},"28.0":{t:"# 长列表大表单性能优化\r",p:"\r",l:"blogs/coding-learning-record/element-ui.html",a:"长列表大表单性能优化"},"28.1":{t:"业务场景\r",p:"vue2 项目 400个表单需要校验。每个表单有20个左右的校验项，多选，单选，input，图片上传组件。总的组件数有上万个 ...",l:"blogs/coding-learning-record/element-ui.html#业务场景",a:"业务场景"},"28.2":{t:"落地选型\r",p:`
虚拟列表路线

不定高度内容，快速滚动会产生高度跳变；虚拟列表滚动，调研中遇到了动态选10个显示 高度跳变的问题。也有解决 ...`,l:"blogs/coding-learning-record/element-ui.html#落地选型",a:"落地选型"},"28.3":{t:"技术难点\r",p:`
简略列表+单个sku表单

整体表单校验；使用nexTick方式，替换数据，循环赋值。
重写校验方法，引入validate ...`,l:"blogs/coding-learning-record/element-ui.html#技术难点",a:"技术难点"},"29.0":{t:"# 前端代码规范\r",p:`
文件名建议全部连字符、否则git大小写有的折腾呢

`,l:"blogs/coding-learning-record/eslint.html",a:"前端代码规范"},"30.0":{t:"# calculator\r",p:`使用flutter构建的计算器demo

若flutter doctor 不通过；使用java8；
anroid-studi ...`,l:"blogs/coding-learning-record/flutter-demo.html",a:"calculator"},"31.0":{t:"# Docker nginx Dockerfile https配置 \r",p:`前置步骤

安装DockerFile
安装DockerCompose
获取ssl证书、sl证书解析配置

`,l:"blogs/coding-learning-record/https.html",a:"docker-nginx-dockerfile-https配置"},"31.1":{t:"步骤\r",p:`
yourServiceName、youdomin替换成你自己的
证书下载 腾讯云

&lt;!-- DockerFile  ...`,l:"blogs/coding-learning-record/https.html#步骤",a:"步骤"},"32.0":{t:"lambda表达式 java\r",p:`        iDsSpaceAreaService.lambdaUpdate()
                .eq ...`,l:"blogs/coding-learning-record/java.html",a:"lambda表达式-java"},"33.0":{t:"# jssip-renegotiaton、FreeSwitch探索\r",p:`&lt;!-- 仓库名称 vue_fs_meeting --&gt;
webrtc
jssip 是一个webrtc的封装库
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html",a:"jssip-renegotiaton、freeswitch探索"},"33.1":{t:"折腾的起因\r",p:`需要帮朋友解决renegotiaton的问题 玩了一下jssip的api
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾的起因",a:"折腾的起因"},"33.2":{t:"jssip\r",p:`关键api

监听renegotiate、reinvite事件
若是直接用浏览器RTC的api replaceTrack替换 ...`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#jssip",a:"jssip"},"33.3":{t:"折腾FreeSwitch\r",p:"\r",l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾freeswitch",a:"折腾freeswitch"},"33.4":{t:"1. 安装\r",p:`windows下 下载msi 一路点安装即可 用管理员方式运行
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_1-安装",a:"_1-安装"},"33.5":{t:"2.wss配置\r",p:`参考博客
并配置nginx之后 启动freeswitch （管理员方式启动）7443的端口；

`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_2-wss配置",a:"_2-wss配置"},"34.0":{t:"# k8s \r",p:`一个开源的容器编排平台
`,l:"blogs/coding-learning-record/k8s.html",a:"k8s"},"34.1":{t:"Kubernetes解决了什么问题:\r",p:`

应用程序部署和管理:

自动化应用程序的部署、扩缩容和滚动更新,减少了手动操作的风险和开销。
支持批量管理和编排多个应用 ...`,l:"blogs/coding-learning-record/k8s.html#kubernetes解决了什么问题",a:"kubernetes解决了什么问题"},"34.2":{t:"container - 容器运行时\r",p:`docker只是其中一种 还有  containerd、CRI-O 等
`,l:"blogs/coding-learning-record/k8s.html#container-容器运行时",a:"container-容器运行时"},"34.3":{t:"部署流程\r",p:`master安装k8s集群模式的包，node节点安装子节点需要的包
配置master、node节点
集群中直接根据配置文件起 ...`,l:"blogs/coding-learning-record/k8s.html#部署流程",a:"部署流程"},"34.4":{t:"主从机器\r",p:`master 集群 node 子节点
`,l:"blogs/coding-learning-record/k8s.html#主从机器",a:"主从机器"},"34.5":{t:"pod container\r",p:`Pod是Kubernetes中最小的可部署单元,它包含一个或多个container。
Pod中的所有container共享相 ...`,l:"blogs/coding-learning-record/k8s.html#pod-container",a:"pod-container"},"35.0":{t:"# mysql\r",p:"\r",l:"blogs/coding-learning-record/mysql.html",a:"mysql"},"35.1":{t:"默认引擎\r",p:`
InnoDB
MyISAM

InnoDB 和 MyISAM 是 MySQL 数据库中的两个存储引擎，它们在功能和性能上有 ...`,l:"blogs/coding-learning-record/mysql.html#默认引擎",a:"默认引擎"},"35.2":{t:"关闭mysql的strict mode\r",p:`注释掉 my.ini中的
# Set the SQL mode to strict
# sql-mode=&quot;STR ...`,l:"blogs/coding-learning-record/mysql.html#关闭mysql的strict-mode",a:"关闭mysql的strict-mode"},"35.3":{t:"总结 \r",p:`

join
inner join 交集
left join right join 左右其中一张的全表 加上选集
cross ...`,l:"blogs/coding-learning-record/mysql.html#总结",a:"总结"},"35.4":{t:"做题内容\r",p:`select name,score
from student
where name not like '%李%'
-- 请在 ...`,l:"blogs/coding-learning-record/mysql.html#做题内容",a:"做题内容"},"35.5":{t:"总结难点 \r",p:`join
inner join 交集
left join right join 左右其中一张的全表 加上选集
cross j ...`,l:"blogs/coding-learning-record/mysql.html#总结难点",a:"总结难点"},"36.0":{t:"# Nacos\r",p:`服务治理
heimashangcheng
docker启动
`,l:"blogs/coding-learning-record/nacos.html",a:"nacos"},"37.0":{t:"位运算\r",p:`https://poe.com/s/8e38IAssLMHBMCW3oRgp 优点
效率高：位运算是对二进制位的直接操作，比 ...`,l:"blogs/coding-learning-record/new-knowledge.html",a:"位运算"},"37.1":{t:"消除异步传染性\r",p:`需要在catch里面做逻辑处理

场景


如任意api 全局自动前端刷新token
react suspense

`,l:"blogs/coding-learning-record/new-knowledge.html#消除异步传染性",a:"消除异步传染性"},"37.2":{t:"非对称加密\r",p:`
rsa 公钥私钥配对
https中的加密 为啥需要证书？

`,l:"blogs/coding-learning-record/new-knowledge.html#非对称加密",a:"非对称加密"},"37.3":{t:"VO 、 DTO\r",p:`DTO（Data Transfer Object）和VO（Value Object）都是用于在系统之间传输数据的对象。
`,l:"blogs/coding-learning-record/new-knowledge.html#vo-、-dto",a:"vo-、-dto"},"38.0":{t:"# next.js \r",p:"\r",l:"blogs/coding-learning-record/next-js.html",a:"next-js"},"38.1":{t:"项目脚手架\r",p:`next-sse
体验一下国际服玩家的利器next.js

api
声明式router

`,l:"blogs/coding-learning-record/next-js.html#项目脚手架",a:"项目脚手架"},"38.2":{t:"sse功能开发\r",p:`
群聊实现demo
打字机推送效果

`,l:"blogs/coding-learning-record/next-js.html#sse功能开发",a:"sse功能开发"},"39.0":{t:"#  WPS、Office插件开发\r",p:"",l:"blogs/coding-learning-record/office-dev.html",a:"wps、office插件开发"},"39.1":{t:"技术选型\r",p:`

JS Api

高度可移植性：可以跨平台使用，支持Windows、Mac、iOS、Android等多个操作系统和设备。
 ...`,l:"blogs/coding-learning-record/office-dev.html#技术选型",a:"技术选型"},"39.2":{t:"面板配置\r",p:`ribbon配置

&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF- ...`,l:"blogs/coding-learning-record/office-dev.html#面板配置",a:"面板配置"},"39.3":{t:"业务开发\r",p:`&lt;!-- TODO --&gt;

`,l:"blogs/coding-learning-record/office-dev.html#业务开发",a:"业务开发"},"39.4":{t:"clickOne部署\r",p:`
clickOne部署自动更新



优点：
安装之后，更新服务器资源后
用户端每次重启word均会拉取最新版本word

 ...`,l:"blogs/coding-learning-record/office-dev.html#clickone部署",a:"clickone部署"},"39.5":{t:"构建兼容WPS、word的插件安装包\r",p:`
Advance installer
InnoSetup


好处:


安装可配置注册表、依赖项
一套代码、打包后一次性安 ...`,l:"blogs/coding-learning-record/office-dev.html#构建兼容wps、word的插件安装包",a:"构建兼容wps、word的插件安装包"},"39.6":{t:" ",p:"",l:"blogs/coding-learning-record/office-dev.html#",a:""},"39.7":{t:"插件效果\r",p:`


word插件
wps插件




&lt;img src=&quot;https://github.com/yaoli ...`,l:"blogs/coding-learning-record/office-dev.html#插件效果",a:"插件效果"},"39.8":{t:"过程中坑: \r",p:`
office文档机翻、社区参考资料少

`,l:"blogs/coding-learning-record/office-dev.html#过程中坑",a:"过程中坑"},"40.0":{t:"# onlyoffice\r",p:"\r",l:"blogs/coding-learning-record/onlyoffice.html",a:"onlyoffice"},"40.1":{t:"服务端渲染docx\r",p:`
文件服务 给onlyoffice editing服务提供文件 给对应加密信息
业务服务端 调用documentBuilde ...`,l:"blogs/coding-learning-record/onlyoffice.html#服务端渲染docx",a:"服务端渲染docx"},"40.2":{t:"接入cdn文件渲染\r",p:`
修改初始化中给onlyoffice服务的地址换成cdn url即可
修改callbackurl中持久化的操作 改为文件整体 ...`,l:"blogs/coding-learning-record/onlyoffice.html#接入cdn文件渲染",a:"接入cdn文件渲染"},"40.3":{t:"替换web-app 增加额外的js\r",p:`把构建好的web-app包 -v到docker内即可
`,l:"blogs/coding-learning-record/onlyoffice.html#替换web-app-增加额外的js",a:"替换web-app-增加额外的js"},"42.0":{t:"# 打包你的js sdk\r",p:`场景： 需要二次封装一个js库 输出一个自己的库
&lt;!-- 安装依赖 --&gt;
pnpm add webpack  ...`,l:"blogs/coding-learning-record/package-sdk.html",a:"打包你的js-sdk"},"43.0":{t:"# qiankun 源码解析\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html",a:"qiankun-源码解析"},"43.1":{t:"css隔离\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#css隔离",a:"css隔离"},"43.2":{t:"js隔离\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#js隔离",a:"js隔离"},"43.3":{t:"子应用加载方式\r",p:"无界获取子应用的脚本采用的是qiankun的import-html-entry方案，这个方案是通过正则表达式将 子应用的 h ...",l:"blogs/coding-learning-record/qiankun.html#子应用加载方式",a:"子应用加载方式"},"43.4":{t:"乾坤子应用keepalive\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#乾坤子应用keepalive",a:"乾坤子应用keepalive"},"43.5":{t:"缓存场景下 css加载404异常捕捉不到的问题\r",p:`思路： debug 进一步定位抛错位置 尝试捕获到之后重试
`,l:"blogs/coding-learning-record/qiankun.html#缓存场景下-css加载404异常捕捉不到的问题",a:"缓存场景下-css加载404异常捕捉不到的问题"},"43.6":{t:"状态管理\r",p:`qiankun 提供了集中式的状态管理方案，它通过 props 和全局状态对象来实现子应用之间的通信和状态共享。
singl ...`,l:"blogs/coding-learning-record/qiankun.html#状态管理",a:"状态管理"},"44.0":{t:"# 润词典\r",p:`
[!TIP]
旨在陪伴kids
私有单词库
科学review
互动式学英语
场景例句巩固

`,l:"blogs/coding-learning-record/rdic.html",a:"润词典"},"44.1":{t:"进度汇总\r",p:`&lt;!-- 1. 2023年12月2日21点49分   --&gt;
单词本下面增加分类


后端

新增分类接口
分类 ...`,l:"blogs/coding-learning-record/rdic.html#进度汇总",a:"进度汇总"},"44.2":{t:"项目介绍\r",p:`
v0.0.1
查询词典、发音
加入分享、私有单词库（默认所有人可以编辑）
分享编辑单词库

`,l:"blogs/coding-learning-record/rdic.html#项目介绍",a:"项目介绍"},"44.3":{t:"接口\r",p:"",l:"blogs/coding-learning-record/rdic.html#接口",a:"接口"},"44.4":{t:"添加单词本\r",p:`注意isDelete字段 数据库需要设置默认值0 然后需要添加
@TableLogic
private Integer is ...`,l:"blogs/coding-learning-record/rdic.html#添加单词本",a:"添加单词本"},"44.5":{t:"私有单词本内-单词分页查询\r",p:`使用mybatis page获取 第一个参数默认传分页参数
第一个参数传分页参数
    /**
     * 根据 id  ...`,l:"blogs/coding-learning-record/rdic.html#私有单词本内-单词分页查询",a:"私有单词本内-单词分页查询"},"44.6":{t:" 接口实现\r",p:"    &lt;select id=&quot;getDictionariesByWorkbookId&quot; resu ...",l:"blogs/coding-learning-record/rdic.html#接口实现",a:"接口实现"},"45.0":{t:"# reactNative\r",p:"\r",l:"blogs/coding-learning-record/reactNative-start.html",a:"reactnative"},"45.1":{t:"rn 和 flutter对比  \r",p:`
rn 大厂使用比较多 flutter 中小厂使用比较多
flutter 增长趋势较好
rn 社区活跃度较高 js技术栈
总 ...`,l:"blogs/coding-learning-record/reactNative-start.html#rn-和-flutter对比",a:"rn-和-flutter对比"},"45.2":{t:"reactNative安装  \r",p:`powershell管理员执行
Set-ExecutionPolicy Bypass -Scope Process -For ...`,l:"blogs/coding-learning-record/reactNative-start.html#reactnative安装",a:"reactnative安装"},"46.0":{t:"按照官网文档部署即可\r",p:`npx react-native doctor


sdk 设置系统环境变量 sdk 、platform tools、com ...`,l:"blogs/coding-learning-record/reactNative.html",a:"按照官网文档部署即可"},"47.0":{t:"# java版本管理 \r",p:"\r",l:"blogs/coding-learning-record/sdk-manage.html",a:"java版本管理"},"47.1":{t:"idea\r",p:`比较方便 有界面操作
`,l:"blogs/coding-learning-record/sdk-manage.html#idea",a:"idea"},"47.2":{t:"本地环境java版本\r",p:`jabba install openjdk@1.17.0
jabba install openjdk@1.11.0
jabb ...`,l:"blogs/coding-learning-record/sdk-manage.html#本地环境java版本",a:"本地环境java版本"},"48.0":{t:"# shared-worker\r",p:"\r",l:"blogs/coding-learning-record/shared-worker.html",a:"shared-worker"},"48.1":{t:"shared-worker-demo\r",p:`git仓库 / 在线 demo
功能：多个不同tab页面之间数据交互
落地场景：


electron render进程之间 ...`,l:"blogs/coding-learning-record/shared-worker.html#shared-worker-demo",a:"shared-worker-demo"},"48.2":{t:"参考资料\r",p:`mdn demo
`,l:"blogs/coding-learning-record/shared-worker.html#参考资料",a:"参考资料"},"49.0":{t:"# 苍穹外卖\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html",a:"苍穹外卖"},"49.1":{t:"SSM实践\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#ssm实践",a:"ssm实践"},"49.2":{t:"pojo 数据库实体 dto entity vo\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#pojo-数据库实体-dto-entity-vo",a:"pojo-数据库实体-dto-entity-vo"},"49.3":{t:"common 全局异常处理 通用包装类等\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#common-全局异常处理-通用包装类等",a:"common-全局异常处理-通用包装类等"},"49.4":{t:"server 项目主体\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#server-项目主体",a:"server-项目主体"},"49.5":{t:"AutoFill注解\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#autofill注解",a:"autofill注解"},"49.6":{t:"mybatis插件\r",p:`mybatisX 安装之后 设置schema 有代码提示

其他功能

官网文档




后端的代码 写起来好丝滑

`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis插件",a:"mybatis插件"},"49.7":{t:"entity中的 @Builder注解\r",p:`/**

@Builder 注解 构建器
用于创建对象
如实现类中
Employee employee = Employee ...`,l:"blogs/coding-learning-record/sky-take-out.html#entity中的-builder注解",a:"entity中的-builder注解"},"49.8":{t:"mybatis 配置\r",p:`update动态sql
    &lt;update id=&quot;update&quot; parameterType ...`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis-配置",a:"mybatis-配置"},"50.0":{t:"type-challenges",p:"",l:"blogs/coding-learning-record/typescript.html",a:"type-challenges"},"51.0":{t:"组件二次封装\r",p:`hooks
坑

onMounted问题解决
全局样式覆盖

`,l:"blogs/coding-learning-record/vue-ui-component.html",a:"组件二次封装"},"52.0":{t:"keep alive\r",p:`
实现原理
微前端场景下如何服用子Vue实例的component
嵌套路由场景下 keep alive的问题

解决方案

 ...`,l:"blogs/coding-learning-record/vue3.html",a:"keep-alive"},"52.1":{t:"nextTick\r",p:`

一定能获取到更新之后的DOM吗

结论： 调用nextTick之前的同步任务，微任务队列排在nextTick之前的都能获 ...`,l:"blogs/coding-learning-record/vue3.html#nexttick",a:"nexttick"},"52.2":{t:" ",p:"",l:"blogs/coding-learning-record/vue3.html#",a:""},"52.3":{t:"forceUpdate -->\r",p:`&lt;!-- 在 --&gt;
`,l:"blogs/coding-learning-record/vue3.html#forceupdate",a:"forceupdate"},"52.4":{t:"unref 和 toRaw 有什么区别\r",p:`以下是自己测试之后的总结
unref是获取引用值 但并不会递归获取
toRaw是获取响应式对象的原始对象 会递归解开prox ...`,l:"blogs/coding-learning-record/vue3.html#unref-和-toraw-有什么区别",a:"unref-和-toraw-有什么区别"},"53.0":{t:"<!--\r",p:`
@Author: yaolinhong yaolinhong1024@gmail.com
@Date: 2023-09-2 ...`,l:"blogs/coding-learning-record/web3d.html",a:""},"53.1":{t:"three.js\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#three-js",a:"three-js"},"53.2":{t:"迭代日志\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#迭代日志",a:"迭代日志"},"53.3":{t:"2023-11-20\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-11-20",a:"_2023-11-20"},"53.4":{t:"Add\r",p:`feat: 模型压缩调研 gltf-transform
gltf-transform optimize ./revit.gl ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"53.5":{t:"压缩方式基本原理\r",p:`

减少模型的多边形数量：多边形数量越多，模型的复杂度和文件大小就会增加。你可以使用3D建模软件，如Blender或Maya ...`,l:"blogs/coding-learning-record/web3d.html#压缩方式基本原理",a:"压缩方式基本原理"},"53.6":{t:"2023-07-23\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-07-23",a:"_2023-07-23"},"53.7":{t:"Add\r",p:`feat: revit模型渲染 mvp
预览 |
仓库地址
&lt;!-- 安装revit https://mp.weixi ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"53.8":{t:"2023-06-15\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#_2023-06-15",a:"_2023-06-15"},"53.9":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.10":{t:"Removed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#removed",a:"removed"},"53.11":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.12":{t:"Add -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"53.13":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.14":{t:"Fixed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#fixed",a:"fixed"},"53.15":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.16":{t:"Changed -->\r",p:"",l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"53.17":{t:"Changed\r",p:`我的three.js训练场

feat: 🎸 Metaverse游戏 按住空格 加速跑动 2023-06-15

`,l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"53.18":{t:"learn webgpu\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#learn-webgpu",a:"learn-webgpu"},"53.19":{t:"why learn\r",p:`贴一个吗目标公司岗位的jd；

某目标公司
webGL开发岗位职责:
开发和维护用于Web端设计工具的高性能图形系统，包括： ...`,l:"blogs/coding-learning-record/web3d.html#why-learn",a:"why-learn"},"53.20":{t:"learn what\r",p:`抽象几个关键的技术要素
WebGL API Web图形领域 CPU和GPU的性能优化方法；

熟练掌握基本的线性代数、几何、 ...`,l:"blogs/coding-learning-record/web3d.html#learn-what",a:"learn-what"},"53.21":{t:"how to learn\r",p:`主要目标

有业余开源项目供技术参考（找相关开源项目）
找webGL下的问题场景，直接解决相关的问题，提供commit

过 ...`,l:"blogs/coding-learning-record/web3d.html#how-to-learn",a:"how-to-learn"},"53.22":{t:"一些思考\r",p:"",l:"blogs/coding-learning-record/web3d.html#一些思考",a:"一些思考"},"53.23":{t:"什么场景需要web 3d\r",p:`最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现，一看是直接放的video；

对于需要seo的页面来说，或许b ...`,l:"blogs/coding-learning-record/web3d.html#什么场景需要web-3d",a:"什么场景需要web-3d"},"54.0":{t:"# 微信相关业务逻辑\r",p:"\r",l:"blogs/coding-learning-record/wechat.html",a:"微信相关业务逻辑"},"54.1":{t:"微信公众号登陆\r",p:`!alt text

订阅号无法开通此接口
服务号必须通过微信认证

`,l:"blogs/coding-learning-record/wechat.html#微信公众号登陆",a:"微信公众号登陆"},"54.2":{t:"微信支付\r",p:`坑

native支付并不能用网站引用的appid申请

必须将微信支付id 绑定服务号或者订阅号的微信公众号id 才可以开 ...`,l:"blogs/coding-learning-record/wechat.html#微信支付",a:"微信支付"},"55.0":{t:"api开放平台\r",p:"",l:"blogs/coding-learning-record/yupi-learning-record.html",a:"api开放平台"},"55.1":{t:"gateway 模块 需要单独打开项目\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#gateway-模块-需要单独打开项目",a:"gateway-模块-需要单独打开项目"},"55.2":{t:"todo 整合到主项目启动\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#todo-整合到主项目启动",a:"todo-整合到主项目启动"},"55.3":{t:"mysql 执行sql插入报错 not null的字段没有写入 补充该字段\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#mysql-执行sql插入报错-not-null的字段没有写入-补充该字段",a:"mysql-执行sql插入报错-not-null的字段没有写入-补充该字段"},"55.4":{t:"注册接口的逻辑\r",p:`synchronized 关键字

加锁和释放锁 无论方法正常执行完毕还是抛出异常，都会释放锁
一把锁只能同时被一个线程获取 ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#注册接口的逻辑",a:"注册接口的逻辑"},"55.5":{t:"YuApiClient 调用接口上线报错\r",p:`原因 gateway挂了 远程调用失败
`,l:"blogs/coding-learning-record/yupi-learning-record.html#yuapiclient-调用接口上线报错",a:"yuapiclient-调用接口上线报错"},"55.6":{t:"invoke 报错\r",p:`
{
  &quot;code&quot;: 50000,
  &quot;data&quot;: null,
  &quo ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#invoke-报错",a:"invoke-报错"},"56.0":{t:"# coding plan\r",p:`* 沉淀代码资产，不限于工具库、ui库
* 重视输出；
    * 少些demo项目 多些深入探索 
    * 要有产出成 ...`,l:"blogs/fe-sumary/2024-coding-plan.html",a:"coding-plan"},"57.0":{t:"2023 总结\r",p:"\r",l:"blogs/fe-sumary/2024-plan.html",a:"_2023-总结"},"57.1":{t:"这一年，我取得了一些不错的成绩。\r",p:`

技术钻研：

服务端渲染应用落地、docker compose部署、二开
用react的 useDapp 发布了自己的w ...`,l:"blogs/fe-sumary/2024-plan.html#这一年-我取得了一些不错的成绩。",a:"这一年-我取得了一些不错的成绩。"},"57.2":{t:" 当然，也有一些需要提升的地方。\r",p:`

任务管理：

目标管理意识较差、严格工时评估的能力差，需求评审不够严谨
松散的目标意识，如saas中，错误估计整体提测时 ...`,l:"blogs/fe-sumary/2024-plan.html#当然-也有一些需要提升的地方。",a:"当然-也有一些需要提升的地方。"},"57.3":{t:"朋友们的反馈和建议\r",p:`这里只挑点缺点讲
a: 有时候会眼高手低，得下场多做
b: 需求做的糙 思路是正确、效率也ok 但得深入点细节和产品、测试对 ...`,l:"blogs/fe-sumary/2024-plan.html#朋友们的反馈和建议",a:"朋友们的反馈和建议"},"57.4":{t:"新的一年的计划：\r",p:`
持续长跑 按季度复盘

娱乐消遣控制在每周2天左右
学习打卡 每周至少3天  时间不限 需要有学习产出的记录（笔记、代码库 ...`,l:"blogs/fe-sumary/2024-plan.html#新的一年的计划",a:"新的一年的计划"},"58.0":{t:"# 上上份工作难点\r",p:"\r",l:"blogs/fe-sumary/qd-fe.html",a:"上上份工作难点"},"58.1":{t:"等保三级处理（国家级）\r",p:"",l:"blogs/fe-sumary/qd-fe.html#等保三级处理-国家级",a:"等保三级处理-国家级"},"58.2":{t:"onlyoffice项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#onlyoffice项目",a:"onlyoffice项目"},"58.3":{t:"c# webview word插件项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#c-webview-word插件项目",a:"c-webview-word插件项目"},"58.4":{t:"小程序项目 \r",p:"",l:"blogs/fe-sumary/qd-fe.html#小程序项目",a:"小程序项目"},"58.5":{t:"websocket im优化 （前端消息确认）\r",p:`



Description




背景



难点



选型
sse、轮询、ws？


落地



总结




`,l:"blogs/fe-sumary/qd-fe.html#websocket-im优化-前端消息确认",a:"websocket-im优化-前端消息确认"},"58.6":{t:"jssip 实时音频交互处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#jssip-实时音频交互处理",a:"jssip-实时音频交互处理"},"58.7":{t:"trtc 视频流处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#trtc-视频流处理",a:"trtc-视频流处理"},"58.8":{t:"electron项目",p:"",l:"blogs/fe-sumary/qd-fe.html#electron项目",a:"electron项目"},"59.0":{t:"# 最近一份工作的难点\r",p:"\r",l:"blogs/fe-sumary/xz-fe.html",a:"最近一份工作的难点"},"59.1":{t:"seo、服务端渲染\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#seo、服务端渲染",a:"seo、服务端渲染"},"59.2":{t:"微前端\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#微前端",a:"微前端"},"59.3":{t:"虚拟列表 性能优化\r",p:`
列表方案
不定高度？（从下往上滑动 页面抖动、删除节点页面跳动）

复杂业务代码改造，（item 处理为计算属性）
一些个 ...`,l:"blogs/fe-sumary/xz-fe.html#虚拟列表-性能优化",a:"虚拟列表-性能优化"},"59.4":{t:"动画、多页面响应式适配、i18n\r",p:`

动态rem；


所有图片加载完成之后进入页面
i18n


总结： rem有局限性吗？ TODO
`,l:"blogs/fe-sumary/xz-fe.html#动画、多页面响应式适配、i18n",a:"动画、多页面响应式适配、i18n"},"59.5":{t:"小程序路由权限校验\r",p:`

首页路由切换闪烁


公共组件库处理 二次封装组件；支持透传slot attrs props等（原生组件有坑）


`,l:"blogs/fe-sumary/xz-fe.html#小程序路由权限校验",a:"小程序路由权限校验"},"59.6":{t:"weboffice定制功能\r",p:`
只允许排版功能


iframe 限制

electron

太生硬 用户接受程度


chrome插件

分发问题 -  ...`,l:"blogs/fe-sumary/xz-fe.html#weboffice定制功能",a:"weboffice定制功能"},"60.0":{t:"# 博客系统推荐\r",p:`面向前端同学：
可以使用默认布局 可基于vue扩展
vitepress vue-theme-hope
SEO友好、框架无关
 ...`,l:"blogs/tools/blog-dev.html",a:"博客系统推荐"},"61.0":{t:"# 使用linux命令\r",p:`&lt;!-- node程序的进程 --&gt;
ps -ef | grep node
&lt;!-- 解压到当前文件夹 - ...`,l:"blogs/tools/linux.html",a:"使用linux命令"},"62.0":{t:"# postman 快速导入swagger接口",p:"",l:"blogs/tools/postman.html",a:"postman-快速导入swagger接口"},"64.0":{t:"#  https://gitee.com/ylh1995/Blog/pages",p:"",l:"readme.html",a:"https-gitee-com-ylh1995-blog-pages"}},t={previewLength:62,buttonLabel:"Search",placeholder:"Search docs",allow:[],ignore:[]},o={INDEX_DATA:e,PREVIEW_LOOKUP:n,Options:t};export{o as default};
