const e={map:'[{"runtime":["0.0"],"results":["0.1","0.5"],"theme":["0.2","0.6"],"page":["0.3","0.4","0.7","0.8"],"more":["0.9"],"stable":["1.0"],"原理":["2.0"],"加密":["2.1"],"哈希":["2.2"],"共识算法":["2.3"],"基于共识的智能合约":["2.4"],"跨境电商":["3.0"],"coding":["4.0","56.0"],"life":["4.1"],"测试环境表结构同步到生产环境":["5.0"],"使用frp实现内网穿透管理物联网设备":["6.0"],"课代表立正":["7.0"],"gpt4":["7.1"],"static关键字":["8.0"],"jenkins":["9.0"],"联系我":["10.0"],"h1":["11.0"],"h2":["11.1"],"h3":["11.2"],"h4":["11.3"],"h5":["11.4"],"h6":["11.5"],"horizontal":["11.6"],"typographic":["11.7"],"emphasis":["11.8"],"blockquotes":["11.9"],"lists":["11.10"],"code":["11.11"],"tables":["11.12"],"links":["11.13"],"images":["11.14"],"plugins":["11.15"],"emojies":["11.16"],"subscript":["11.17"],"ins":["11.18"],"mark":["11.19"],"footnotes":["11.20"],"definition":["11.21"],"abbreviations":["11.22"],"custom":["11.23"],"js中调用c":["12.0"],"实现方式":["12.1"],"api":["13.0"],"左耳听风":["14.0"],"分割一切的py":["15.0"],"springboot":["16.0"],"项目启动":["17.0"],"生成式ai":["18.0"],"多维数据向量存储词性":["18.1"],"自注意力":["18.2"],"知识库":["19.0"],"qiankun":["20.0","43.0"],"其他":["20.1"],"backend":["21.0"],"自定义线程池":["21.1"],"业务场景":["21.2","27.1"],"核心线程数":["21.3"],"最大线程数":["21.4"],"工作队列":["21.5"],"osi":["21.6"],"tcp":["21.7"],"effective":["21.8"],"词典实现":["22.0"],"需求背景":["22.1"],"核心功能":["22.2"],"组件设计":["23.0"],"css踩坑":["24.0"],"depends":["25.0"],"常用docker操作":["26.0"],"长列表大表单性能优化":["27.0"],"落地选型":["27.2"],"技术难点":["27.3"],"前端代码规范":["28.0"],"calculator":["29.0"],"docker":["30.0"],"步骤":["30.1"],"lambda表达式":["31.0"],"jssip":["32.0","32.2","58.6"],"折腾的起因":["32.1"],"折腾freeswitch":["32.3"],"k8s":["33.0"],"kubernetes解决了什么问题":["33.1"],"container":["33.2"],"部署流程":["33.3"],"主从机器":["33.4"],"pod":["33.5"],"mysql":["34.0","55.3"],"默认引擎":["34.1"],"关闭mysql的strict":["34.2"],"总结":["34.3"],"做题内容":["34.4"],"总结难点":["34.5"],"nacos":["35.0"],"位运算":["36.0"],"消除异步传染性":["36.1"],"非对称加密":["36.2"],"vo":["36.3"],"next":["37.0"],"项目脚手架":["37.1"],"sse功能开发":["37.2"],"wps":["38.0"],"技术选型":["38.1"],"面板配置":["38.2"],"业务开发":["38.3"],"clickone部署":["38.4"],"构建兼容wps":["38.5"],"插件效果":["38.7"],"过程中坑":["38.8"],"两行代码":["39.0"],"项目":["39.1"],"运行":["39.2"],"onlyoffice":["40.0"],"服务端渲染docx":["40.1"],"接入cdn文件渲染":["40.2"],"替换web":["40.3"],"打包你的js":["42.0"],"css隔离":["43.1"],"js隔离":["43.2"],"子应用加载方式":["43.3"],"乾坤子应用keepalive":["43.4"],"缓存场景下":["43.5"],"状态管理":["43.6"],"润词典":["44.0"],"进度汇总":["44.1"],"项目介绍":["44.2"],"接口":["44.3"],"添加单词本":["44.4"],"私有单词本内":["44.5"],"接口实现":["44.6"],"reactnative":["45.0"],"rn":["45.1"],"reactnative安装":["45.2"],"按照官网文档部署即可":["46.0"],"java版本管理":["47.0"],"idea":["47.1"],"本地环境java版本":["47.2"],"shared":["48.0","48.1"],"参考资料":["48.2"],"苍穹外卖":["49.0"],"ssm实践":["49.1"],"pojo":["49.2"],"common":["49.3"],"server":["49.4"],"autofill注解":["49.5"],"mybatis插件":["49.6"],"entity中的":["49.7"],"mybatis":["49.8"],"type":["50.0"],"组件二次封装":["51.0"],"keep":["52.0"],"nexttick":["52.1"],"forceupdate":["52.3"],"unref":["52.4"],"three":["53.1"],"迭代日志":["53.2"],"add":["53.4","53.7","53.12"],"压缩方式基本原理":["53.5"],"removed":["53.10"],"fixed":["53.14"],"changed":["53.16","53.17"],"learn":["53.18","53.20"],"why":["53.19"],"how":["53.21"],"一些思考":["53.22"],"什么场景需要web":["53.23"],"微信相关业务逻辑":["54.0"],"微信公众号登陆":["54.1"],"微信支付":["54.2"],"api开放平台":["55.0"],"gateway":["55.1"],"todo":["55.2"],"注册接口的逻辑":["55.4"],"yuapiclient":["55.5"],"invoke":["55.6"],"这一年":["57.1"],"当然":["57.2"],"朋友们的反馈和建议":["57.3"],"新的一年的计划":["57.4"],"上上份工作难点":["58.0"],"等保三级处理":["58.1"],"onlyoffice项目":["58.2"],"c":["58.3"],"小程序项目":["58.4"],"websocket":["58.5"],"trtc":["58.7"],"electron项目":["58.8"],"最近一份工作的难点":["59.0"],"seo":["59.1"],"微前端":["59.2"],"虚拟列表":["59.3"],"动画":["59.4"],"小程序路由权限校验":["59.5"],"weboffice定制功能":["59.6"],"博客系统推荐":["60.0"],"使用linux命令":["61.0"],"postman":["62.0"],"https":["64.0"]},{"0":["17.0","38.2"],"1":["11.20","11.21","16.0","17.0","21.1","24.0","27.2","29.0","32.2","32.4","33.1","34.4","37.2","38.1","38.2","38.4","38.5","38.8","44.1","53.5","59.2"],"2":["17.0","32.5","34.4","44.1"],"3":["17.0","34.4"],"4":["17.0"],"8":["17.0","38.2"],"10":["17.0"],"11":["17.0"],"18":["17.0"],"20":["34.4"],"60":["34.4"],"500":["34.4"],"609":["17.0"],"802":["17.0"],"2023":["53.3","53.6","53.8","57.0"],"43708":["17.0"],"50000":["55.6"],"10781466":["17.0"],"api":["0.0","38.1"],"examples":["0.0"],"this":["0.0","11.8","11.22"],"page":["0.0"],"demonstrates":["0.0"],"data":["0.2","0.3","0.6","0.7","11.12","17.0","55.6"],"frontmatter":["0.4","0.8"],"check":["0.9"],"diffusion":["1.0"],"ui实操":["1.0"],"数字签名":["2.1"],"默克尔树":["2.2"],"solidty":["2.4"],"明通":["3.0"],"user":["4.0"],"can":["4.1","11.9"],"dump":["5.0"],"知乎":["6.0"],"目前有代差":["7.1"],"技术发展是s型曲线":["7.1"],"举例计算机产生有5次":["7.1"],"表象差距大":["7.1"],"静态变量在以下情况下比较合适":["8.0"],"共享数据":["8.0"],"当某个数据需要在类的所有实例之间共享时":["8.0"],"gitee":["9.0","64.0"],"cicd":["9.0"],"配置":["9.0","49.8"],"安装jenkins镜像":["9.0"],"邮箱":["10.0"],"heading":["11.0","11.1","11.2","11.3","11.4","11.5"],"rules":["11.6"],"replacements":["11.7"],"enable":["11.7"],"typographer":["11.7"],"is":["11.8","11.22","17.0"],"unordered":["11.10"],"create":["11.10"],"a":["11.10","17.0"],"list":["11.10","17.0"],"by":["11.10","17.0","34.4"],"starting":["11.10"],"line":["11.10"],"with":["11.10"],"or":["11.10","34.4"],"inline":["11.11"],"indented":["11.11"],"option":["11.12"],"description":["11.12","59.1","59.2"],"path":["11.12"],"to":["11.12","17.0","53.21"],"files":["11.12"],"supply":["11.12"],"link":["11.13","11.20"],"text":["11.13","16.0"],"minion":["11.14"],"stormtroopocat":["11.14"],"like":["11.14","34.4"],"links":["11.14"],"the":["11.15","17.0"],"classic":["11.16"],"markup":["11.16"],"superscript":["11.17"],"inserted":["11.18"],"marked":["11.19"],"footnote":["11.20"],"lists":["11.21"],"term":["11.21"],"html":["11.22","30.1"],"containers":["11.23"],"方法":["12.0"],"使用node":["12.1"],"addons":["12.1"],"node官方的":["12.1"],"npm":["12.2"],"一些优质的官方prompt":["13.0"],"https":["13.0","17.0","36.0","38.7"],"程序员如何用技术变现":["14.0"],"关注有价值的东西":["14.0"],"价值取决于供需关系":["14.0"],"分清什么是主流技术":["14.0"],"什么是过渡式的技术":["14.0"],"图形分割":["15.0"],"配置篇":["16.0"],"alt":["16.0","54.1"],"多环境配置":["16.0"],"点击可以切换环境":["16.0"],"pom":["16.0"],"xml":["16.0","17.0","38.2","44.6","49.8"],"启动依赖安装问题":["17.0"],"从pom":["17.0"],"xml中看java":["17.0"],"maven版本":["17.0"],"本机java版本也要与项目要求java版本一致":["17.0"],"内网包无法拉到":["17.0"],"需要配置maven私有仓库":["17.0"],"todo":["17.0","38.3"],"解决私有仓库配置":["17.0"],"pre":["17.0"],"class":["17.0","34.4"],"console":["17.0"],"output":["17.0"],"started":["17.0"],"timer":["17.0"],"running":["17.0"],"as":["17.0"],"system":["17.0","45.2"],"building":["17.0"],"in":["17.0"],"workspace":["17.0"],"jenkins":["17.0"],"test2":["17.0"],"xizhao":["17.0"],"java":["17.0","21.8","31.0","44.5"],"ins":["17.0"],"recommended":["17.0"],"git":["17.0"],"tool":["17.0"],"none":["17.0"],"using":["17.0"],"credential":["17.0"],"5bc2":["17.0"],"4ab2":["17.0"],"90da":["17.0"],"91285e13c47a":["17.0"],"gt":["17.0"],"rev":["17.0"],"parse":["17.0"],"resolve":["17.0"],"dir":["17.0"],"timeout":["17.0"],"fetching":["17.0"],"changes":["17.0"],"from":["17.0","30.1","34.4"],"remote":["17.0"],"repository":["17.0"],"config":["17.0"],"origin":["17.0"],"url":["17.0"],"href":["17.0"],"http":["17.0"],"gitlab":["17.0"],"raritag":["17.0"],"cn":["17.0"],"backend":["17.0"],"business":["17.0"],"platform":["17.0"],"institution":["17.0"],"upstream":["17.0"],"version":["17.0","38.2"],"askpass":["17.0"],"set":["17.0","45.2","49.8"],"credentials":["17.0"],"fetch":["17.0"],"tags":["17.0"],"progress":["17.0"],"refs":["17.0"],"heads":["17.0"],"remotes":["17.0"],"test":["17.0","49.8"],"commit":["17.0"],"checking":["17.0"],"out":["17.0"],"revision":["17.0"],"3edab892f3efe98472bafba406e5b324398e509d":["17.0"],"core":["17.0","21.3"],"sparsecheckout":["17.0"],"checkout":["17.0"],"f":["17.0","33.3"],"message":["17.0","55.6"],"merge":["17.0"],"branch":["17.0"],"prod":["17.0"],"into":["17.0"],"no":["17.0"],"walk":["17.0"],"bin":["17.0"],"sh":["17.0"],"xe":["17.0"],"tmp":["17.0"],"jenkins8726267618464466461":["17.0"],"home":["17.0"],"var":["17.0"],"local":["17.0"],"jdk":["17.0"],"apache":["17.0"],"maven":["17.0"],"mvn":["17.0"],"clean":["17.0"],"install":["17.0","47.2"],"dmaven":["17.0"],"skip":["17.0"],"true":["17.0"],"u":["17.0"],"info":["17.0"],"scanning":["17.0"],"for":["17.0"],"projects":["17.0"],"downloading":["17.0"],"rdc":["17.0"],"snapshots":["17.0"],"repo":["17.0"],"aliyun":["17.0"],"com":["17.0","36.0","53.0"],"snapshot":["17.0"],"4gwswi":["17.0"],"dependency":["17.0"],"center":["17.0"],"metadata":["17.0"],"releases":["17.0"],"release":["17.0"],"x4vplw":["17.0"],"archetype":["17.0"],"b":["17.0"],"downloaded":["17.0"],"at":["17.0"],"s":["17.0","36.0"],"避免生成错误":["18.2"],"内容导航":["19.0"],"子应用更新异常":["20.0"],"js级别的缓存解决方案":["20.1"],"interview":["21.0"],"核心业务场景":["21.2"],"pool":["21.3"],"maximum":["21.4"],"work":["21.5"],"queue":["21.5"],"七层模型是什么样的":["21.6"],"如何保证可靠连接":["21.7"],"支持自添加单词的单词本":["22.1"],"实现概述":["22.2"],"查词":["22.2"],"避免冗余数据":["23.0"],"offsettop是相对relative的父级":["24.0"],"on":["25.0"],"docker":["26.0","57.1"],"vue2":["27.1"],"虚拟列表路线":["27.2"],"简略列表":["27.3"],"文件名建议全部连字符":["28.0"],"使用flutter构建的计算器demo":["29.0"],"nginx":["30.0","30.1"],"yourservicename":["30.1"],"youdomin替换成你自己的":["30.1"],"证书下载":["30.1"],"腾讯云":["30.1"],"dockerfile":["30.1"],"latest":["30.1"],"copy":["30.1"],"cert":["30.1"],"etc":["30.1"],"usr":["30.1"],"share":["30.1"],"conf":["30.1"],"d":["30.1"],"default":["30.1"],"idsspaceareaservice":["31.0"],"renegotiaton":["32.0"],"需要帮朋友解决renegotiaton的问题":["32.1"],"关键api":["32.2"],"监听renegotiate":["32.2"],"一个开源的容器编排平台":["33.0"],"应用程序部署和管理":["33.1"],"自动化应用程序的部署":["33.1"],"扩缩容和滚动更新":["33.1"],"减少了手动操作的风险和开销":["33.1"],"支持批量管理和编排多个应用程序及其依赖关系":["33.1"],"容器运行时":["33.2"],"master安装k8s集群模式的包":["33.3"],"node节点安装子节点需要的包":["33.3"],"配置master":["33.3"],"node节点":["33.3"],"集群中直接根据配置文件起对应服务":["33.3"],"kubectl":["33.3"],"apply":["33.3"],"frontend":["33.3"],"deployment":["33.3"],"yaml":["33.3"],"service":["33.3"],"master":["33.4"],"container":["33.5"],"pod是kubernetes中最小的可部署单元":["33.5"],"innodb":["34.1"],"myisam":["34.1"],"和":["34.1","45.1","52.4"],"是":["34.1"],"mysql":["34.1"],"数据库中的两个存储引擎":["34.1"],"它们在功能和性能上有一些区别":["34.1"],"让我详细解释一下":["34.1"],"事务支持":["34.1"],"支持事务":["34.1"],"而":["34.1"],"mode":["34.2"],"注释掉":["34.2"],"my":["34.2"],"join":["34.3","34.5"],"inner":["34.3","34.5"],"select":["34.4","44.6"],"name":["34.4"],"score":["34.4"],"student":["34.4"],"where":["34.4"],"not":["34.4"],"李":["34.4"],"请在此处输入":["34.4"],"sql":["34.4"],"请编写一条":["34.4"],"查询语句":["34.4"],"从名为":["34.4"],"的数据表中选择出所有不重复的班级":["34.4"],"id":["34.4","44.5","44.6","49.8"],"和考试编号":["34.4"],"exam":["34.4"],"num":["34.4"],"的组合":["34.4"],"distinct":["34.4"],"的数据表中选择出学生姓名":["34.4"],"年龄":["34.4"],"age":["34.4"],"和成绩":["34.4"],"首先按照成绩从大到小排序":["34.4"],"如果成绩相同":["34.4"],"则按照年龄从小到大排序":["34.4"],"order":["34.4"],"desc":["34.4"],"asc":["34.4"],"的数据表中选择学生姓名":["34.4"],"和年龄":["34.4"],"按照年龄从小到大排序":["34.4"],"从第":["34.4"],"条数据开始":["34.4"],"截取":["34.4"],"个学生的信息":["34.4"],"limit":["34.4"],"从第二条截取三个":["34.4"],"假设有一个学生表":["34.4"],"包含以下字段":["34.4"],"姓名":["34.4"],"请你编写一个":["34.4"],"查询":["34.4"],"将学生按照年龄划分为三个年龄等级":["34.4"],"level":["34.4"],"岁以上为":["34.4"],"老同学":["34.4"],"岁以上":["34.4"],"不包括":["34.4"],"为":["34.4"],"年轻":["34.4"],"岁及以下":["34.4"],"以及没有年龄信息为":["34.4"],"小同学":["34.4"],"返回结果应包含学生的姓名":["34.4"],"服务治理":["35.0"],"poe":["36.0"],"8e38iasslmhbmcw3orgp":["36.0"],"优点":["36.0"],"需要在catch里面做逻辑处理":["36.1"],"rsa":["36.2"],"dto":["36.3"],"js":["37.0","38.1","53.1"],"next":["37.1"],"office插件开发":["38.0"],"高度可移植性":["38.1"],"可以跨平台使用":["38.1"],"支持windows":["38.1"],"mac":["38.1"],"ios":["38.1"],"android等多个操作系统和设备":["38.1"],"ribbon配置":["38.2"],"encoding":["38.2"],"utf":["38.2"],"word的插件安装包":["38.5"],"word插件":["38.7"],"wps插件":["38.7"],"img":["38.7"],"src":["38.7"],"github":["38.7"],"运行llm":["39.0"],"ollama":["39.1"],"win11":["39.2"],"wsl":["39.2"],"ubuntu22":["39.2"],"文件服务":["40.1"],"修改初始化中给onlyoffice服务的地址换成cdn":["40.2"],"url即可":["40.2"],"修改callbackurl中持久化的操作":["40.2"],"改为文件整体上传oss":["40.2"],"app":["40.3"],"sdk":["42.0"],"场景":["42.0"],"需要二次封装一个js库":["42.0"],"输出一个自己的库":["42.0"],"安装依赖":["42.0"],"pnpm":["42.0"],"add":["42.0"],"webpack":["42.0"],"cli":["42.0"],"源码解析":["43.0"],"无界获取子应用的脚本采用的是qiankun的import":["43.3"],"css加载404异常捕捉不到的问题":["43.5"],"qiankun":["43.6"],"tip":["44.0"],"2023年12月2日21点49分":["44.1"],"单词本下面增加分类":["44.1"],"后端":["44.1"],"新增分类接口":["44.1"],"分类编辑接口":["44.1"],"v0":["44.2"],"注意isdelete字段":["44.4"],"单词分页查询":["44.5"],"使用mybatis":["44.5"],"page获取":["44.5"],"第一个参数默认传分页参数":["44.5"],"第一个参数传分页参数":["44.5"],"根据":["44.5"],"获取":["44.5"],"getdictionariesbyworkbookid":["44.6"],"flutter对比":["45.1"],"powershell管理员执行":["45.2"],"shell":["45.2"],"executionpolicy":["45.2"],"bypass":["45.2"],"scope":["45.2"],"process":["45.2"],"force":["45.2"],"npx":["46.0"],"react":["46.0"],"比较方便":["47.1"],"jabba":["47.2"],"openjdk":["47.2"],"worker":["48.0","48.1"],"demo":["48.1"],"git仓库":["48.1"],"mdn":["48.2"],"数据库实体":["49.2"],"全局异常处理":["49.3"],"项目主体":["49.4"],"mybatisx":["49.6"],"builder注解":["49.7"],"builder":["49.7"],"注解":["49.7"],"update动态sql":["49.8"],"update":["49.8"],"parametertype":["49.8"],"employee":["49.8"],"if":["49.8"],"challenges":["50.0"],"hooks":["51.0"],"alive":["52.0"],"一定能获取到更新之后的dom吗":["52.1"],"结论":["52.1"],"调用nexttick之前的同步任务":["52.1"],"微任务队列排在nexttick之前的都能获取到":["52.1"],"由nexttick的源码可以看出":["52.1"],"nexttick本质就是创建了一个微任务":["52.1"],"不考虑settimeout":["52.1"],"将其回调推入微任务队列":["52.1"],"vue中一个事件循环中的所有dom更新操作也是一个微任务":["52.1"],"两者属于同一优先级":["52.1"],"执行先后只于入队的先后有关":["52.1"],"换句话说":["52.1"],"如果你先写了nexttick":["52.1"],"再写赋值语句":["52.1"],"在此之前没有触发dom更新的操作":["52.1"],"那在nexttick中获取的可就不是更新后的dom了":["52.1"],"在":["52.3"],"author":["53.0"],"yaolinhong":["53.0"],"yaolinhong1024":["53.0"],"gmail":["53.0"],"date":["53.0"],"feat":["53.4","53.7"],"模型压缩调研":["53.4"],"gltf":["53.4"],"transform":["53.4"],"optimize":["53.4"],"revit":["53.4"],"减少模型的多边形数量":["53.5"],"多边形数量越多":["53.5"],"模型的复杂度和文件大小就会增加":["53.5"],"你可以使用3d建模软件":["53.5"],"如blender或maya":["53.5"],"我的three":["53.17"],"webgpu":["53.18"],"learn":["53.19","53.21"],"贴一个吗目标公司岗位的jd":["53.19"],"某目标公司":["53.19"],"webgl开发岗位职责":["53.19"],"开发和维护用于web端设计工具的高性能图形系统":["53.19"],"包括":["53.19"],"what":["53.20"],"3d":["53.23"],"坑":["54.2"],"模块":["55.1"],"整合到主项目启动":["55.2"],"执行sql插入报错":["55.3"],"synchronized":["55.4","55.6"],"关键字":["55.4"],"调用接口上线报错":["55.5"],"报错":["55.6"],"code":["55.6"],"null":["55.6"],"connectexception":["55.6"],"connection":["55.6"],"refused":["55.6"],"connect":["55.6"],"useraccount":["55.6"],"intern":["55.6"],"plan":["56.0"],"沉淀代码资产":["56.0"],"不限于工具库":["56.0"],"ui库":["56.0"],"重视输出":["56.0"],"少些demo项目":["56.0"],"多些深入探索":["56.0"],"要有产出成果":["56.0"],"仓库开源":["56.0"],"or形成相应的技术文章":["56.0"],"我取得了一些不错的成绩":["57.1"],"技术钻研":["57.1"],"服务端渲染应用落地":["57.1"],"compose部署":["57.1"],"二开":["57.1"],"用react的":["57.1"],"usedapp":["57.1"],"也有一些需要提升的地方":["57.2"],"任务管理":["57.2"],"目标管理意识较差":["57.2"],"这里只挑点缺点讲":["57.3"],"持续长跑":["57.4"],"按季度复盘":["57.4"],"娱乐消遣控制在每周2天左右":["57.4"],"学习打卡":["57.4"],"每周至少3天":["57.4"],"时间不限":["57.4"],"需要有学习产出的记录":["57.4"],"国家级":["58.1"],"webview":["58.3"],"im优化":["58.5"],"实时音频交互处理":["58.6"],"视频流处理":["58.7"],"服务端渲染":["59.1"],"div":["59.1","59.2"],"style":["59.1","59.2"],"width":["59.1","59.2"],"30px":["59.1","59.2"],"背景":["59.1","59.2"],"计划全站seo":["59.1"],"业务要新开一个saas系统":["59.2"],"后续可能做paas":["59.2"],"子系统多根据用户开通情况分配权限":["59.2"],"难点":["59.2"],"子系统用户权限":["59.2"],"页面路由":["59.2"],"数据权限":["59.2"],"性能优化":["59.3"],"列表方案":["59.3"],"不定高度":["59.3"],"从下往上滑动":["59.3"],"多页面响应式适配":["59.4"],"首页路由切换闪烁":["59.5"],"只允许排版功能":["59.6"],"面向前端同学":["60.0"],"可以使用默认布局":["60.0"],"node程序的进程":["61.0"],"ps":["61.0"],"ef":["61.0"],"grep":["61.0"],"快速导入swagger接口":["62.0"]},{"0":["44.2","47.2"],"1":["11.11","27.3","46.0","47.2","53.19","59.1"],"2":["11.10","11.20","32.2","33.1","53.19","59.1","59.2"],"3":["30.1","44.1","53.19","59.2"],"4":["44.1"],"5":["44.1"],"8":["11.0"],"11":["53.3"],"17":["47.2"],"19":["11.17"],"21":["17.0"],"22":["53.0"],"23":["53.0"],"47":["53.0"],"53":["53.0"],"80":["30.1"],"135":["17.0"],"192":["17.0"],"199":["17.0"],"443":["30.1"],"798":["17.0"],"992":["17.0"],"2009":["38.2"],"2023":["53.0"],"3072":["45.2"],"usage":["0.0"],"of":["0.0","11.11","17.0","53.5"],"some":["0.0","11.11","17.0"],"the":["0.0","0.9","11.12","34.2"],"pre":["0.2","0.3","0.4","0.6","0.7","0.8"],"out":["0.9"],"cmd":["1.0"],"args":["1.0"],"参数集合":["1.0"],"确保语言的确定性":["2.4"],"免税店":["3.0"],"总代理":["3.0"],"interface":["4.0"],"i":["4.1"],"with":["5.0","11.13","11.21"],"知乎文章":["6.0"],"实际背后差距可能更大":["7.1"],"数据处理能力":["7.1"],"工程能力":["7.1"],"用户数正反馈":["7.1"],"静态变量非常有用":["8.0"],"例如":["8.0"],"一个类代表一个公司的员工":["8.0"],"公司的名称对于所有员工来说都是相同的":["8.0"],"注意使用开源版本":["9.0"],"时区变量":["9.0"],"e":["9.0"],"php":["9.0"],"tz":["9.0"],"yaolinhong1024":["10.0"],"option":["11.7"],"to":["11.7"],"see":["11.7"],"bold":["11.8"],"text":["11.8","11.18","11.19","54.1"],"also":["11.9","11.14"],"be":["11.9","11.12","17.0"],"nested":["11.9"],"sub":["11.10"],"are":["11.10"],"made":["11.10"],"indenting":["11.10"],"spaces":["11.10"],"marker":["11.10"],"character":["11.10"],"comments":["11.11"],"line":["11.11","17.0"],"that":["11.12"],"will":["11.12"],"passed":["11.12"],"into":["11.12"],"templates":["11.12"],"engine":["11.12"],"have":["11.14"],"a":["11.14","57.3"],"footnote":["11.14"],"killer":["11.15"],"feature":["11.15"],"wink":["11.16"],"cry":["11.16"],"first":["11.20"],"lazy":["11.21"],"continuation":["11.21"],"abbreviation":["11.22"],"example":["11.22"],"it":["11.22","17.0"],"warning":["11.23","17.0"],"examples":["12.1"],"使用步骤":["12.1"],"npm":["12.1"],"install":["12.1","12.2"],"platform":["13.0"],"openai":["13.0"],"关注技术付费点":["14.0"],"一个是":["14.0"],"能帮别人":["14.0"],"挣钱":["14.0"],"的地方":["14.0"],"profiles":["16.0"],"profile":["16.0"],"id":["16.0"],"dev":["16.0"],"properties":["16.0"],"profileactive":["16.0"],"problems":["17.0"],"were":["17.0"],"encountered":["17.0"],"while":["17.0"],"effective":["17.0"],"model":["17.0"],"jar":["17.0"],"dependencies":["17.0"],"groupid":["17.0"],"artifactid":["17.0"],"type":["17.0"],"classifier":["17.0"],"must":["17.0"],"unique":["17.0"],"baomidou":["17.0"],"mybatis":["17.0"],"plus":["17.0"],"boot":["17.0"],"starter":["17.0"],"duplicate":["17.0"],"declaration":["17.0"],"column":["17.0"],"build":["17.0","30.1"],"plugins":["17.0"],"plugin":["17.0","42.0"],"org":["17.0"],"resources":["17.0"],"missing":["17.0"],"deploy":["17.0"],"highly":["17.0"],"fix":["17.0"],"these":["17.0"],"because":["17.0"],"they":["17.0"],"threaten":["17.0"],"stability":["17.0"],"your":["17.0"],"this":["17.0"],"reason":["17.0"],"future":["17.0"],"versions":["17.0"],"might":["17.0"],"longer":["17.0"],"support":["17.0"],"such":["17.0"],"malformed":["17.0"],"lt":["17.0"],"cloud":["17.0"],"feign":["17.0"],"kb":["17.0"],"swarm":["17.0"],"coding":["19.0","57.4"],"现象":["20.0"],"不缓存html":["20.1"],"questions":["21.0"],"核心线程数":["21.1"],"处理订单请求":["21.2"],"包括验证订单信息":["21.2"],"size":["21.3","21.4"],"业务场景关联":["21.3","21.5"],"pool":["21.4"],"工作队列用于存储尚未被执行的订单处理任务":["21.5"],"应该能够满足高并发请求下的任务排队需求":["21.5"],"路由器工作在哪一层":["21.6"],"要点":["21.8"],"记录小孩的单词量":["22.1"],"百度翻译api申请":["22.2"],"调用":["22.2"],"ecdict":["22.2"],"单一职责":["23.0"],"不一定是父元素":["24.0"],"定位元素":["24.0"],"追加的服务可以在应用内直接映射访问":["25.0"],"run":["26.0"],"项目":["27.1"],"400个表单需要校验":["27.1"],"不定高度内容":["27.2"],"快速滚动会产生高度跳变":["27.2"],"虚拟列表滚动":["27.2"],"调研中遇到了动态选10个显示":["27.2"],"单个sku表单":["27.3"],"否则git大小写有的折腾呢":["28.0"],"若flutter":["29.0"],"doctor":["29.0","46.0"],"dockerfile":["30.0"],"expose":["30.1"],"yml":["30.1"],"docker":["30.1"],"compose":["30.1"],"version":["30.1"],"services":["30.1","33.3"],"image":["30.1"],"container":["30.1"],"name":["30.1","49.8"],"restart":["30.1"],"always":["30.1"],"ports":["30.1"],"server":["30.1"],"lambdaupdate":["31.0"],"eq":["31.0","55.6"],"dsspacearea":["31.0"],"freeswitch探索":["32.0"],"玩了一下jssip的api":["32.1"],"reinvite事件":["32.2"],"若是直接用浏览器rtc的api":["32.2"],"安装":["32.4"],"wss配置":["32.5"],"高可用性和容错":["33.1"],"通过自动重启容器和自动重新调度pod":["33.1"],"提高了应用程序的可靠性和容错能力":["33.1"],"支持多副本部署":["33.1"],"实现负载均衡和服务高可用":["33.1"],"docker只是其中一种":["33.2"],"get":["33.3","44.5"],"是的":["33.3"],"在应用了上述":["33.3"],"kubernetes":["33.3"],"部署配置之后":["33.3"],"会自动将前端应用动态部署到集群中的":["33.3"],"node":["33.3","61.0"],"节点上":["33.3"],"不需要手动将应用程序部署到特定的节点":["33.3"],"会根据在":["33.3"],"文件中定义的规则":["33.3"],"自动选择合适的节点来调度和运行":["33.3"],"集群":["33.4"],"它包含一个或多个container":["33.5"],"pod中的所有container共享相同的网络命名空间":["33.5"],"network":["33.5"],"不支持":["34.1"],"对于":["34.1"],"每一条":["34.1"],"sql":["34.1","34.2"],"语句都默认封装成事务进行提交":["34.1"],"这可能会影响速度":["34.1"],"优化速度的方式是将多条":["34.1"],"语句放在":["34.1"],"begin":["34.1"],"commit":["34.1"],"ini中的":["34.2"],"set":["34.2"],"交集":["34.3","34.5"],"left":["34.3","34.5"],"right":["34.3","34.5"],"和年龄等级":["34.4"],"并按姓名升序排序":["34.4"],"case":["34.4"],"when":["34.4"],"then":["34.4","52.1"],"else":["34.4"],"end":["34.4"],"as":["34.4"],"date":["34.4"],"当前日期":["34.4"],"学号":["34.4"],"筛选出姓名为":["34.4"],"热dog":["34.4"],"的学生":["34.4"],"展示其学号":["34.4"],"及其大写姓名":["34.4"],"upper":["34.4"],"avg":["34.4"],"平均":["34.4"],"班级编号":["34.4"],"成绩":["34.4"],"汇总学生表中所有学生的总成绩":["34.4"],"total":["34.4"],"平均成绩":["34.4"],"最高成绩":["34.4"],"max":["34.4"],"和最低成绩":["34.4"],"min":["34.4"],"sum":["34.4"],"group":["34.4"],"heimashangcheng":["35.0"],"效率高":["36.0"],"位运算是对二进制位的直接操作":["36.0"],"比一般的算术运算和逻辑运算更高效":["36.0"],"它可以在一条指令中完成多个操作":["36.0"],"因此可以提高代码的执行速度和性能":["36.0"],"节省空间":["36.0"],"位运算可以将多个状态或选项使用较少的二进制位表示":["36.0"],"场景":["36.1"],"公钥私钥配对":["36.2"],"sse":["37.1"],"群聊实现demo":["37.2"],"与web技术无缝集成":["38.1"],"开发门槛较低":["38.1"],"可以使用html":["38.1"],"css":["38.1"],"javascript等web技术进行开发":["38.1"],"方便与web应用的集成":["38.1"],"安全性高":["38.1"],"api是基于沙箱模型进行开发":["38.1"],"可以有效避免恶意代码对系统造成的影响":["38.1"],"customui":["38.2"],"xmlns":["38.2"],"http":["38.2"],"schemas":["38.2"],"microsoft":["38.2"],"com":["38.2","38.7","44.6","64.0"],"office":["38.2"],"07":["38.2","53.6"],"clickone部署自动更新":["38.4"],"优点":["38.4"],"advance":["38.5"],"installer":["38.5"],"yaolinhong":["38.7"],"blog":["38.7"],"blob":["38.7"],"main":["38.7"],"static":["38.7"],"word":["38.7"],"office文档机翻":["38.8"],"curl":["39.2"],"fssl":["39.2"],"https":["39.2"],"给onlyoffice":["40.1"],"callbackurl的实现":["40.2"],"当用户保存时":["40.2"],"文档服务会调用文档储存服务的":["40.2"],"callbackurl":["40.2"],"文档body中返回一个url地址和status":["40.2"],"增加额外的js":["40.3"],"terser":["42.0"],"uglify":["42.0"],"js":["42.0"],"javascript":["42.0","52.1","56.0"],"config":["42.0"],"const":["42.0"],"html":["43.3"],"思路":["43.5"],"提供了集中式的状态管理方案":["43.6"],"它通过":["43.6"],"旨在陪伴kids":["44.0"],"单词本下面":["44.1"],"所有分类接口":["44.1"],"单词列表中返回分类id":["44.1"],"单词关联分类接口":["44.1"],"xml中新增字段飘红":["44.1"],"alt":["44.1"],"数据库需要设置默认值0":["44.4"],"单词本单词":["44.5"],"xml版本":["44.5"],"支持分页加载":["44.5"],"param":["44.5"],"return":["44.5"],"getmapping":["44.5"],"words":["44.5"],"resultmap":["44.6"],"yao":["44.6"],"wxmp":["44.6"],"大厂使用比较多":["45.1"],"net":["45.2"],"servicepointmanager":["45.2"],"securityprotocol":["45.2"],"bor":["45.2"],"iex":["45.2"],"native":["46.0"],"有界面操作":["47.1"],"在线":["48.1"],"功能":["48.1"],"多个不同tab页面之间数据交互":["48.1"],"demo":["48.2"],"dto":["49.2"],"通用包装类等":["49.3"],"安装之后":["49.6"],"构建器":["49.7"],"用于创建对象":["49.7"],"如实现类中":["49.7"],"null":["49.8"],"username":["49.8"],"坑":["51.0"],"实现原理":["52.0"],"如何阻塞nexttick内依赖改变的内容导致的页面更新":["52.1"],"不停地push微任务":["52.1"],"本轮事件循环就一直不会结束":["52.1"],"代码如下":["52.1"],"let":["52.1"],"queue":["52.1"],"promise":["52.1"],"resolve":["52.1"],"function":["52.1"],"cb":["52.1"],"toraw":["52.4"],"09":["53.0"],"lasteditors":["53.0"],"glb":["53.4"],"compressed":["53.4"],"texture":["53.4"],"compress":["53.4"],"webp":["53.4"],"一键压缩效果":["53.4"],"来减少模型中的多边形数量":["53.5"],"这可以通过简化几何形状":["53.5"],"合并顶点或使用lod":["53.5"],"level":["53.5"],"detail":["53.5"],"技术来实现":["53.5"],"revit模型渲染":["53.7"],"mvp":["53.7"],"06":["53.8"],"js训练场":["53.17"],"渲染引擎的性能和效果优化":["53.19"],"前后端及上下游工具链图形能力建设":["53.19"],"显示素材数据的转化和优化处理":["53.19"],"抽象几个关键的技术要素":["53.20"],"webgl":["53.20"],"主要目标":["53.21"],"有业余开源项目供技术参考":["53.21"],"最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现":["53.23"],"一看是直接放的video":["53.23"],"native支付并不能用网站引用的appid申请":["54.2"],"需要单独打开项目":["55.1"],"not":["55.3"],"加锁和释放锁":["55.4"],"无论方法正常执行完毕还是抛出异常":["55.4"],"原因":["55.5"],"账户不能重复":["55.6"],"querywrapper":["55.6"],"user":["55.6"],"new":["55.6"],"long":["55.6"],"count":["55.6"],"usermapper":["55.6"],"记笔记":["56.0"],"主要是过后自己翻阅可以加深理解":["56.0"],"分享给他人的内容":["56.0"],"当然需要再深度加工产出博客":["56.0"],"上面说的还是一些原则性的东西":["56.0"],"下面是具体的计划":["56.0"],"前端技术沉淀":["56.0"],"作用域":["56.0"],"闭包":["56.0"],"原型链":["56.0"],"总结":["57.0"],"发布了自己的web3测试链":["57.1"],"c":["57.1"],"webview落地word插件":["57.1"],"发布实践":["57.1"],"oneclick部署":["57.1"],"electron":["57.1"],"网盘应用源码精读":["57.1"],"调试":["57.1"],"electron原理书泛读":["57.1"],"严格工时评估的能力差":["57.2"],"需求评审不够严谨":["57.2"],"松散的目标意识":["57.2"],"如saas中":["57.2"],"有时候会眼高手低":["57.3"],"笔记":["57.4"],"代码库":["57.4"],"沉淀代码资产":["57.4"],"不限于工具库":["57.4"],"ui库":["57.4"],"重视输出":["57.4"],"word插件项目":["58.3"],"前端消息确认":["58.5"],"description":["58.5"],"工期紧":["59.1"],"一期迭代要求一周":["59.1"],"难点":["59.1"],"原单页面改全站seo":["59.1"],"br":["59.1","59.2"],"主子页面登录态共享":["59.1"],"选型":["59.1","59.2"],"设计":["59.2"],"多子系统共用组件库":["59.2"],"共享依赖":["59.2"],"全局组件库":["59.2"],"css隔离":["59.2"],"样式隔离":["59.2"],"rbac":["59.2"],"页面抖动":["59.3"],"删除节点页面跳动":["59.3"],"复杂业务代码改造":["59.3"],"item":["59.3"],"i18n":["59.4"],"公共组件库处理":["59.5"],"iframe":["59.6"],"可基于vue扩展":["60.0"],"vitepress":["60.0"],"解压到当前文件夹":["61.0"],"tar":["61.0"],"zxvf":["61.0"]},{"0":["55.6"],"1":["33.3","36.1","44.2","48.1"],"2":["11.11","11.21","21.1","33.3","37.2","38.5","53.5","55.6"],"3":["32.2","33.1"],"5":["17.0"],"6":["17.0"],"11":["53.0"],"15":["53.4","53.8"],"19":["33.3"],"20":["53.3"],"23":["53.6"],"92":["38.7"],"150":["34.4"],"768":["17.0"],"apis":["0.0"],"provided":["0.0"],"by":["0.0","11.9"],"vitepress":["0.0"],"documentation":["0.9"],"修改":["1.0"],"webui":["1.0"],"user":["1.0"],"the":["2.4"],"不给货":["3.0"],"大宗商品":["3.0"],"ui":["4.0"],"connect":["4.1"],"format":["5.0"],"需要配置服务器":["6.0"],"已经让openai有了代差":["7.1"],"进入了增长飞轮":["7.1"],"国产模型":["7.1"],"替代开源模型难以企及":["7.1"],"这时可以使用静态变量来表示公司的名称":["8.0"],"常量":["8.0"],"静态变量通常用于表示常量":["8.0"],"因为它们的值在整个程序执行期间保持不变":["8.0"],"asia":["9.0"],"shanghai":["9.0"],"获取密码":["9.0"],"登录":["9.0"],"安装gitee插件":["9.0"],"gmail":["10.0"],"result":["11.7"],"c":["11.7"],"r":["11.7"],"using":["11.9"],"additional":["11.9"],"change":["11.10"],"forces":["11.10"],"new":["11.10","45.2"],"start":["11.10"],"ac":["11.10"],"tristique":["11.10"],"libero":["11.10"],"volutpat":["11.10"],"at":["11.10"],"used":["11.12"],"for":["11.12"],"processing":["11.12"],"handlebars":["11.12"],"is":["11.12"],"default":["11.12"],"title":["11.13"],"autoconverted":["11.13"],"style":["11.14"],"syntax":["11.14"],"alt":["11.14"],"text":["11.14","11.20","44.1"],"of":["11.15"],"markdown":["11.15"],"laughing":["11.16"],"yum":["11.16"],"th":["11.17"],"second":["11.20"],"inline":["11.20"],"withinline":["11.21"],"markup":["11.21"],"converts":["11.22"],"but":["11.22"],"here":["11.23"],"g":["12.1","12.2"],"node":["12.1","33.4"],"gyp":["12.1"],"对应的python版本":["12.1"],"com":["13.0","30.1","39.2"],"examples":["13.0"],"另一个是":["14.0"],"省钱":["14.0"],"付费的前提是信任":["14.0"],"只有你提升自己的能力和经历后":["14.0"],"activation":["16.0"],"activebydefault":["16.0"],"true":["16.0","42.0"],"base":["17.0"],"common":["17.0"],"alibaba":["17.0"],"reos":["17.0"],"open":["17.0"],"file":["17.0"],"api":["17.0","53.20"],"sdk":["17.0","46.0"],"learning":["19.0"],"record":["19.0"],"偶先页面渲染异常":["20.0"],"最大线程数":["21.1"],"扣除库存":["21.2"],"生成订单号等":["21.2"],"核心线程数应该根据订单的日均请求量和处理时间来确定":["21.3"],"对于一个电商平台":["21.3"],"业务场景关联":["21.4"],"最大线程数应该根据系统的资源限制和预期的最大并发量来确定":["21.4"],"在电商平台中":["21.5"],"可以选择一个适当大小的有界队列来限制订单处理的并发量":["21.5"],"如何建立可靠的连接":["21.7"],"支持分享单词本":["22.1"],"社区词典数据库":["22.2"],"单词发音":["22.2"],"tts":["22.2"],"渲染列表":["23.0"],"position属性为relative":["24.0"],"absolute":["24.0"],"build":["26.0"],"每个表单有20个左右的校验项":["27.1"],"高度跳变的问题":["27.2"],"也有解决方案":["27.2"],"但实现成本大":["27.2"],"整体表单校验":["27.3"],"使用nextick方式":["27.3"],"不通过":["29.0"],"使用java8":["29.0"],"https配置":["30.0"],"listen":["30.1"],"ssl":["30.1"],"youdomin":["30.1"],"certificate":["30.1"],"crt":["30.1"],"下载下来的证书名称不能改":["30.1"],"key":["30.1"],"tokens":["30.1"],"off":["30.1"],"getid":["31.0"],"dto":["31.0"],"仓库名称":["32.0"],"vue":["32.0","60.0"],"replacetrack替换轨道":["32.2"],"重新offer":["32.2"],"jssip库":["32.2"],"windows下":["32.4"],"参考博客":["32.5"],"资源利用率和集群管理":["33.1"],"通过自动调度":["33.1"],"充分利用集群资源":["33.1"],"提高资源利用率":["33.1"],"支持自动伸缩":["33.1"],"根据应用程序负载动态调整资源分配":["33.1"],"还有":["33.2"],"pod":["33.3"],"它会考虑诸如节点资源可用性":["33.3"],"节点标签":["33.3"],"污点和容忍等多种调度策略":["33.3"],"从而实现高效且合理的应用程序分布":["33.3"],"在部署过程中":["33.3"],"不需要处理太多其他逻辑":["33.3"],"会自动为处理以下任务":["33.3"],"拉取容器镜像":["33.3"],"会从配置的容器镜像仓库中拉取":["33.3"],"nginx":["33.3"],"alpine":["33.3"],"镜像":["33.3"],"namespace":["33.5"],"和存储卷":["33.5"],"volumes":["33.5"],"之间":["34.1"],"组成一个事务":["34.1"],"如果你的应用需要高度的事务处理":["34.1"],"选择":["34.1"],"是更好的选择":["34.1"],"外键支持":["34.1"],"支持外键":["34.1"],"外键是关系数据库中的重要概念":["34.1"],"用于维护表之间的数据完整性":["34.1"],"to":["34.2"],"strict":["34.2"],"左右其中一张的全表":["34.3","34.5"],"加上选集":["34.3","34.5"],"cross":["34.3"],"统计学生表中的班级编号":["34.4"],"和每个班级的平均成绩":["34.4"],"考试次数":["34.4"],"统计学生表中每个班级每次考试的总学生人数":["34.4"],"count":["34.4"],"统计学生表中班级的总成绩超过":["34.4"],"分的班级编号":["34.4"],"和总成绩":["34.4"],"having子句":["34.4"],"对goup":["34.4"],"by的内容进行筛选":["34.4"],"在":["34.4"],"中":["34.4"],"having":["34.4"],"子句用于在分组聚合后对分组进行过滤":["34.4"],"它允许我们对分组后的结果进行条件筛选":["34.4"],"只保留满足特定条件的分组":["34.4"],"子句与条件查询":["34.4"],"子句的区别在于":["34.4"],"docker启动":["35.0"],"从而节省存储空间":["36.0"],"这在需要处理大量数据或对性能要求较高的场景中特别有用":["36.0"],"适用于某些特定问题":["36.0"],"位运算在某些问题和算法中非常有用":["36.0"],"例如处理图像":["36.0"],"压缩算法":["36.0"],"权限控制等":["36.0"],"https中的加密":["36.2"],"data":["36.3"],"transfer":["36.3"],"体验一下国际服玩家的利器next":["37.1"],"高度扩展性":["38.1"],"可以通过使用office":["38.1"],"add":["38.1"],"ins等技术进行扩展":["38.1"],"增加插件的功能和适用范围":["38.1"],"开发负担":["38.1"],"无法抹平两套sdk差异":["38.1"],"资源发布需要上架审核":["38.1"],"应用分别受两家厂商限制":["38.1"],"2套代码":["38.1"],"onload":["38.2"],"ribbon":["38.2"],"load":["38.2"],"tabs":["38.2"],"tab":["38.2"],"id":["38.2"],"tab1":["38.2"],"安装之后":["38.4"],"innosetup":["38.5"],"e6":["38.7"],"8f":["38.7"],"e4":["38.7"],"bb":["38.7"],"b6":["38.7"],"社区参考资料少":["38.8"],"ollama":["39.2"],"install":["39.2"],"editing服务提供文件":["40.1"],"status为6":["40.2"],"此时储存服务去保存":["40.2"],"保存成功失败返回对应的状态码":["40.2"],"status":["40.2"],"把构建好的web":["40.3"],"terserplugin":["42.0"],"require":["42.0"],"module":["42.0"],"exports":["42.0"],"mode":["42.0"],"production":["42.0"],"experiments":["42.0"],"outputmodule":["42.0"],"entry方案":["43.3"],"这个方案是通过正则表达式将":["43.3"],"debug":["43.5"],"props":["43.6"],"和全局状态对象来实现子应用之间的通信和状态共享":["43.6"],"私有单词库":["44.0"],"前端":["44.1"],"单词本列表中请求所有分类":["44.1"],"点击编辑":["44.1"],"可以关联分类":["44.1"],"关联分类之后刷新列表":["44.1"],"列表中分类展示":["44.1"],"根据分类list接口map展示":["44.1"],"查询词典":["44.2"],"然后需要添加":["44.4"],"xml":["44.5"],"public":["44.5"],"baseresponse":["44.5"],"page":["44.5"],"dics":["44.5"],"getwordsbyid":["44.5"],"int":["44.5"],"requestparam":["44.5"],"defaultvalue":["44.5"],"mapper":["44.6"],"dicsmapper":["44.6"],"baseresultmap":["44.6"],"d":["44.6"],"flutter":["45.1"],"中小厂使用比较多":["45.1"],"object":["45.2"],"webclient":["45.2"],"downloadstring":["45.2"],"https":["45.2"],"community":["45.2"],"chocolatey":["45.2"],"org":["45.2"],"设置系统环境变量":["46.0"],"落地场景":["48.1"],"electron":["48.1","59.6"],"render进程之间交互":["48.1"],"entity":["49.2"],"设置schema":["49.6"],"employee":["49.7"],"password":["49.8"],"phone":["49.8"],"onmounted问题解决":["51.0"],"微前端场景下如何服用子vue实例的component":["52.0"],"嵌套路由场景下":["52.0"],"模拟无限添加微任务":["52.1"],"addinfinitetask":["52.1"],"console":["52.1"],"log":["52.1"],"infinite":["52.1"],"task":["52.1"],"这里会无线阻塞主进程":["52.1"],"什么时候更新":["52.1"],"下次更新dom之前":["52.1"],"能拿到更新后的虚拟dom":["52.1"],"运行的时候只是提交更新":["52.1"],"并不会直接执行渲染":["52.1"],"有什么区别":["52.4"],"lastedittime":["53.0"],"info":["53.4"],"mb":["53.4"],"压缩纹理":["53.5"],"纹理是模型中常用的图像贴图":["53.5"],"可以给模型增加细节和颜色":["53.5"],"你可以使用图像压缩工具":["53.5"],"如jpeg或png压缩算法":["53.5"],"来减小纹理文件的大小":["53.5"],"预览":["53.7"],"仓库地址":["53.7"],"feat":["53.17"],"metaverse游戏":["53.17"],"岗位要求":["53.19"],"计算机或相关专业":["53.19"],"或丰富从业经验":["53.19"],"本科及以上学历":["53.19"],"计算机基础扎实":["53.19"],"web图形领域":["53.20"],"找相关开源项目":["53.21"],"找webgl下的问题场景":["53.21"],"直接解决相关的问题":["53.21"],"对于需要seo的页面来说":["53.23"],"订阅号无法开通此接口":["54.1"],"必须将微信支付id":["54.2"],"null的字段没有写入":["55.3"],"都会释放锁":["55.4"],"一把锁只能同时被一个线程获取":["55.4"],"没有获得锁的线程只能等待":["55.4"],"gateway挂了":["55.5"],"selectcount":["55.6"],"if":["55.6"],"throw":["55.6"],"businessexception":["55.6"],"errorcode":["55.6"],"params":["55.6"],"error":["55.6"],"账号重复":["55.6"],"加密":["55.6"],"算法与数据结构":["56.0"],"常态学习":["56.0"],"阅读笔记":["56.0"],"leecode":["56.0"],"快排":["56.0"],"爬楼梯":["56.0"],"暴力解":["56.0"],"不做的事情":["56.0"],"除非有好的深入的项目":["56.0"],"否则不摸客户端类":["56.0"],"3d":["57.1"],"钻研了revit转glb":["57.1"],"drao模型压缩":["57.1"],"three":["57.1"],"js模型渲染":["57.1"],"revit模型选然后":["57.1"],"构建选择":["57.1"],"jssip":["57.1"],"错误估计整体提测时间":["57.2"],"需求侧不确定的情况下":["57.2"],"花很多时间做一些不确定的需求":["57.2"],"重复劳动":["57.2"],"得下场多做":["57.3"],"b":["57.3"],"少些demo项目":["57.4"],"多些深入探索":["57.4"],"要有产出成果":["57.4"],"仓库开源":["57.4"],"or形成相应的技术文章":["57.4"],"记笔记":["57.4"],"主要是过后自己翻阅可以加深理解":["57.4"],"分享给他人的内容":["57.4"],"背景":["58.5"],"session方案":["59.1"],"vue2":["59.1"],"nuxt2":["59.1"],"cv简单修改即可":["59.1"],"落地快":["59.1"],"or":["59.2"],"rbac1":["59.2"],"角色继承":["59.2"],"省空间":["59.2"],"制定路由规范":["59.2"],"一级规定指向应用":["59.2"],"主应用控制应用进入的权限":["59.2"],"子应用内路由首位使用基座的共享方法去控制具体页面的路由权限":["59.2"],"公共组件库":["59.2"],"主应用分发":["59.2"],"处理为计算属性":["59.3"],"一些个人的经验":["59.3"],"关于虚拟列表相关的优化它真的就只是在优化":["59.3"],"直接限制你每次滚动的范围":["59.3"],"就类似之前看到大屏做上下幻灯片滚动一样":["59.3"],"动态rem":["59.4"],"二次封装组件":["59.5"],"限制":["59.6"],"theme":["60.0"],"maotai":["61.0"],"fe":["61.0"],"gz":["61.0"],"ylh1995":["64.0"]},{"1":["30.1","40.2","44.5"],"2":["27.2","29.0","30.1","38.1"],"3":["11.11","21.1","33.3","53.5","55.6"],"4":["33.1","59.2"],"5":["30.1"],"10":["44.5"],"11":["47.2"],"20":["53.0"],"21":["53.0"],"33":["53.0"],"56":["53.0"],"81":["53.4"],"88":["38.7"],"95":["38.7"],"100":["34.4"],"390":["53.4"],"main":["0.0"],"usedata":["0.0"],"can":["0.0"],"be":["0.0","11.23"],"for":["0.9"],"bat里":["1.0"],"set":["1.0","31.0"],"dao":["2.4"],"店铺资源":["3.0"],"you":["4.1"],"导出ddl":["5.0"],"服务端":["6.0"],"使用gpt是最优解":["7.1"],"套壳gpt":["7.1"],"固定prompt":["7.1"],"没有意义":["7.1"],"数学中的π":["8.0"],"圆周率":["8.0"],"配置hooks":["9.0"],"这里选择的是scm的方式":["9.0"],"每15分钟拉取git仓库":["9.0"],"比较最新的哈希值":["9.0"],"com":["10.0","38.1","52.1"],"tm":["11.7"],"greater":["11.9"],"than":["11.9"],"signs":["11.9"],"facilisis":["11.10"],"in":["11.10"],"pretium":["11.10"],"nisl":["11.10"],"aliquet":["11.10"],"nulla":["11.10"],"aliquam":["11.10"],"velit":["11.10"],"very":["11.10"],"block":["11.11"],"ext":["11.12"],"extension":["11.12"],"dest":["11.12"],"right":["11.12"],"aligned":["11.12"],"https":["11.13","32.2","52.1","53.7"],"id":["11.14","49.7"],"with":["11.14"],"reference":["11.14"],"later":["11.14"],"it":["11.15"],"is":["11.15"],"shortcuts":["11.16"],"emoticons":["11.16"],"h":["11.17"],"of":["11.20","11.21"],"some":["11.21"],"code":["11.21"],"part":["11.21"],"keep":["11.22"],"intact":["11.22"],"partial":["11.22"],"可以构建一个可以给调用的cc文件":["12.1"],"node":["12.2"],"fine":["13.0"],"tune":["13.0"],"别人才会对你有一定的信任":["14.0"],"才会觉得你靠谱":["14.0"],"才会给你机会":["14.0"],"而这个信任需要用你的能力和经历来填补":["14.0"],"比如":["14.0"],"test":["16.0"],"代码":["19.0"],"css没加载完全":["20.0"],"技术栈":["21.2"],"java后端开发":["21.2"],"订单请求可能会呈现出明显的日周期性波动":["21.3"],"因此核心线程数应该足够以应对峰值时段的订单处理需求":["21.3"],"在电商平台中":["21.4"],"最大线程数的设置应该考虑服务器的cpu和内存资源":["21.4"],"以防止系统资源被无限制地占用":["21.5"],"技术实现":["21.5"],"在threadpooltaskexecutor中":["21.5"],"三次握手的详细过程":["21.7"],"家人范围内共享":["22.1"],"使用社区免费的tts":["22.2"],"使用社区开源tts":["22.2"],"http":["22.2"],"渲染组件":["23.0"],"fixed或sticky":["24.0"],"会影响其后代元素的offsettop":["24.0"],"多选":["27.1"],"单选":["27.1"],"也有loading":["27.2"],"表单提交时前端校验需要校验所有数据":["27.2"],"需要改造校验逻辑":["27.2"],"替换数据":["27.3"],"循环赋值":["27.3"],"anroid":["29.0"],"前置步骤":["30.0"],"keepalive":["30.1"],"timeout":["30.1"],"session":["30.1"],"5m":["30.1"],"protocols":["30.1"],"tlsv1":["30.1"],"可参考此":["30.1"],"协议进行配置":["30.1"],"ciphers":["30.1"],"ecdhe":["30.1"],"rsa":["30.1"],"aes128":["30.1"],"gcm":["30.1"],"sha256":["30.1"],"high":["30.1"],"anull":["30.1"],"md5":["30.1"],"rc4":["30.1"],"dhe":["30.1"],"getname":["31.0"],"fs":["32.0"],"dtmf":["32.2"],"下载msi":["32.4"],"并配置nginx之后":["32.5"],"提供集中式监控和管理工具":["33.1"],"简化了集群操作":["33.1"],"一致性和隔离性":["33.1"],"通过容器和命名空间":["33.1"],"实现了应用程序之间的隔离和一致性部署":["33.1"],"containerd":["33.2"],"创建":["33.3"],"会根据":["33.3"],"中的配置":["33.3"],"创建包含前端应用容器的":["33.3"],"挂载卷":["33.3"],"会将指定的本地构建产物目录挂载到":["33.3"],"容器中的":["33.3"],"usr":["33.3"],"share":["33.3"],"html":["33.3"],"子节点":["33.4"],"pod是一个临时性的实体":["33.5"],"如果pod中的某个container终止":["33.5"],"整个pod也会被重新创建":["33.5"],"如果你的数据模型需要外键约束":["34.1"],"索引结构":["34.1"],"使用":["34.1","34.4"],"b":["34.1"],"树的非聚集索引":["34.1"],"存储的是实际数据的地址值":["34.1"],"索引和实际数据是分开的":["34.1"],"树的聚集索引":["34.1"],"trans":["34.2"],"tables":["34.2"],"笛卡尔积":["34.3","34.5"],"聚合":["34.3","34.5"],"子句用于在":["34.4"],"分组之前":["34.4"],"进行过滤":["34.4"],"而":["34.4"],"分组之后":["34.4"],"子句查询订单总金额超过":["34.4"],"的客户":["34.4"],"查询总成绩超过200的班级":["34.4"],"customer":["34.4"],"amount":["34.4"],"orders":["34.4"],"cross":["34.4","34.5"],"join":["34.4"],"其中":["34.4"],"是一种简单的关联查询":["34.4"],"不需要任何条件来匹配行":["34.4"],"它直接将左表的":["34.4"],"每一行":["34.4"],"与右表的":["34.4"],"进行组合":["34.4"],"返回的结果是两个表的笛卡尔积":["34.4"],"还有一个班级表":["34.4"],"班级名称":["34.4"],"将学生表和班级表的所有行组合在一起":["34.4"],"并返回学生姓名":["34.4"],"学生年龄":["34.4"],"以及班级名称":["34.4"],"s":["34.4"],"它可以简化代码实现并提高处理效率":["36.0"],"缺点":["36.0"],"可读性较差":["36.0"],"位运算涉及对二进制位的直接操作":["36.0"],"对于不熟悉位运算的开发者来说":["36.0"],"代码可读性较差":["36.0"],"如任意api":["36.1"],"为啥需要证书":["36.2"],"object":["36.3"],"js":["37.1"],"打字机推送效果":["37.2"],"无法兼容":["38.1"],"加载项":["38.1"],"功能强大":["38.1"],"使用com加载项可以实现更复杂的功能和操作":["38.1"],"js版本的接口相对阉割":["38.1"],"高性能":["38.1"],"com加载项可以直接访问本地api":["38.1"],"不需要通过网络访问":["38.1"],"label":["38.2"],"应用名称":["38.2"],"group":["38.2"],"contentgroup":["38.2"],"aegis":["38.2"],"button":["38.2"],"更新服务器资源后":["38.4"],"用户端每次重启word均会拉取最新版本word":["38.4"],"好处":["38.5"],"9e":["38.7"],"9c":["38.7"],"png":["38.7"],"raw":["38.7"],"sh":["39.2"],"给对应加密信息":["40.1"],"描述":["40.2"],"出现条件":["40.2"],"正在编辑文档":["40.2"],"每次用户连接或断开文档共同编辑时都会收到它":["40.2"],"app包":["40.3"],"optimization":["42.0"],"minimize":["42.0"],"minimizer":["42.0"],"new":["42.0"],"minify":["42.0"],"uglifyjsminify":["42.0"],"terseroptions":["42.0"],"options":["42.0"],"will":["42.0"],"子应用的":["43.3"],"进一步定位抛错位置":["43.5"],"singlespa":["43.6"],"则更加灵活":["43.6"],"科学review":["44.0"],"中文词典搜索":["44.1"],"添加全文索引":["44.1"],"regexp和like使用了表扫描而不是索引":["44.1"],"但对中文不友好":["44.1"],"搜索不到":["44.1"],"所以用like匹配":["44.1"],"alter":["44.1"],"table":["44.1"],"dics":["44.1"],"发音":["44.2"],"tablelogic":["44.4"],"current":["44.5"],"size":["44.5"],"httpservletrequest":["44.5"],"from":["44.6"],"rdic":["44.6"],"custom":["44.6"],"words":["44.6"],"增长趋势较好":["45.1"],"install":["45.2"],"ps1":["45.2"],"安装":["45.2"],"jdk17":["45.2"],"choco":["45.2"],"y":["45.2"],"microsoft":["45.2"],"openjdk17":["45.2"],"platform":["46.0"],"tools":["46.0"],"主进程设置了一个messagechannel":["48.1"],"分发给不同的渲染进程":["48.1"],"进程间通信":["48.1"],"vo":["49.2"],"有代码提示":["49.6"],"status":["49.7"],"sex":["49.8"],"idnumber":["49.8"],"number":["49.8"],"全局样式覆盖":["51.0"],"什么时候执行渲染":["52.1"],"在事件循环的任务队列执行完毕后进行的":["52.1"],"如何确保dom已经更新":["52.1"],"而不是虚拟dom更新":["52.1"],"双requestanimationframe":["52.1"],"github":["52.1"],"twickstrom":["52.1"],"vue":["52.1"],"force":["52.1"],"next":["52.1"],"tick":["52.1"],"blob":["52.1"],"master":["52.1"],"src":["52.1"],"以下是自己测试之后的总结":["52.4"],"filepath":["53.0"],"ylh":["53.0"],"blog":["53.0","64.0"],"kb":["53.4"],"报错":["53.4"],"console":["53.4"],"error":["53.4"],"missing":["53.4"],"parent":["53.4"],"同时":["53.5"],"还可以考虑使用纹理压缩格式":["53.5"],"如draco":["53.5"],"压缩算法":["53.5"],"dds或astc":["53.5"],"以减少文件大小":["53.5"],"安装revit":["53.7"],"按住空格":["53.17"],"熟悉常用算法数据结构设计模式":["53.19"],"有良好的编程习惯":["53.19"],"熟练掌握基本的线性代数":["53.19","53.20"],"几何":["53.19"],"图形学和渲染技术":["53.19"],"cpu和gpu的性能优化方法":["53.20"],"提供commit":["53.21"],"过程中完善":["53.21"],"或许blender建模后支出video":["53.23"],"整体对客户端来说":["53.23"],"服务号必须通过微信认证":["54.1"],"绑定服务号或者订阅号的微信公众号id":["54.2"],"补充该字段":["55.3"],"每个实例都对应有自己的一把锁":["55.4"],"this":["55.4"],"远程调用失败":["55.5"],"string":["55.6"],"encryptpassword":["55.6"],"digestutils":["55.6"],"md5digestashex":["55.6"],"salt":["55.6"],"userpassword":["55.6"],"getbytes":["55.6"],"分配":["55.6"],"accesskey":["55.6"],"secretkey":["55.6"],"electron":["56.0"],"react":["56.0"],"native":["56.0"],"element":["56.0"],"ui组件库源码阅读":["56.0"],"分析":["56.0"],"qiankun源码":["56.0"],"阅读":["56.0"],"后端技术沉淀":["56.0"],"项目":["56.0"],"renegotiate落地语音通话转视频通话的处理":["57.1"],"自己前后端":["57.1"],"部署做了rdic":["57.1"],"这个应用":["57.1"],"支持自建单词本":["57.1"],"支持共享":["57.1"],"修改":["57.1"],"单词发音的应用":["57.1"],"针对小孩子学英语的场景":["57.1"],"团队管理协调":["57.2"],"团队进度滞后":["57.2"],"只是自己默默承担":["57.2"],"不敢分bug":["57.2"],"需求做的糙":["57.3"],"思路是正确":["57.3"],"当然需要再深度加工产出博客":["57.4"],"生活方面":["57.4"],"english":["57.4"],"first":["57.4"],"练刀工":["57.4"],"厨艺精进":["57.4"],"每周2次运动":["57.4"],"难点":["58.5"],"选型":["58.5"],"团队成员好上手":["59.1"],"落地":["59.1"],"seo不收录问题解决":["59.1"],"主动提交":["59.1"],"sitemap":["59.1"],"robots正确配置":["59.1"],"footer":["59.1"],"link标签":["59.1"],"增加内链与外链":["59.1"],"构建组件库":["59.2"],"qiankun":["59.2"],"webcomponent方案":["59.2"],"京东的":["59.2"],"iframe方案":["59.2"],"路由方案":["59.2"],"用微前端分目的是分割功能单元":["59.2"],"精简代码库":["59.2"],"控制发版单元":["59.2"],"长期可迭代":["59.2"],"技术无关性":["59.2"],"你滚动一下就滚动了整个屏幕":["59.3"],"可以观察小红书":["59.3"],"限制了只能滚动":["59.3"],"没有滚动条":["59.3"],"所有图片加载完成之后进入页面":["59.4"],"支持透传slot":["59.5"],"太生硬":["59.6"],"hope":["60.0"],"seo友好":["60.0"],"unzip":["61.0"],"zip":["61.0"]},{"0":["32.2","44.5"],"1":["11.10"],"2":["11.17","27.3","36.1","40.2","48.1"],"3":["40.2","59.1"],"4":["33.3","53.19"],"5":["9.0","33.1","33.3","53.19","55.6"],"8":["11.16"],"75":["22.2"],"159":["22.2"],"170":["22.2"],"used":["0.0"],"to":["0.0","11.9","42.0"],"access":["0.0"],"site":["0.0"],"theme":["0.0"],"and":["0.0"],"full":["0.9"],"list":["0.9"],"commandline":["1.0"],"no":["1.0","34.2"],"ico":["2.4"],"供应链":["3.0"],"资金":["3.0"],"on":["4.1","30.1","34.4"],"整体表结构的sql":["5.0"],"使用花生壳免费版":["6.0"],"模型能力提高10背后":["7.1"],"会颠覆掉":["7.1"],"发展模型的alignment":["7.1"],"opinion":["7.1"],"mining":["7.1"],"可以声明为静态变量":["8.0"],"工具类":["8.0"],"在编写工具类时":["8.0"],"通常会使用静态变量":["8.0"],"命令":["9.0"],"h":["9.0"],"如果忘记设置时区":["9.0"],"打开设置中的script":["9.0"],"github":["10.0","11.13","42.0"],"p":["11.7"],"test":["11.7"],"italic":["11.8"],"right":["11.9","34.4"],"next":["11.9"],"easy":["11.10"],"ordered":["11.10"],"lorem":["11.10"],"ipsum":["11.10"],"dolor":["11.10"],"sit":["11.10"],"amet":["11.10"],"consectetur":["11.10"],"adipiscing":["11.10"],"fences":["11.11"],"sample":["11.11"],"text":["11.11","38.2"],"here":["11.11"],"columns":["11.12"],"com":["11.13","42.0"],"nodeca":["11.13"],"in":["11.14"],"the":["11.14"],"document":["11.14"],"defining":["11.14"],"very":["11.15"],"effective":["11.15"],"see":["11.16"],"how":["11.16"],"definition":["11.20"],"duplicated":["11.20"],"reference":["11.20"],"third":["11.21"],"paragraph":["11.21"],"entries":["11.22"],"like":["11.22"],"xxxhtmlyyy":["11.22"],"dragons":["11.23"],"调用hello":["12.1"],"cc":["12.1"],"代码":["12.1"],"javascript":["12.1","48.1"],"gyp":["12.2"],"微调需要":["13.0"],"上千上万条数据":["13.0"],"能处理更复杂的问题":["13.0"],"你是一个很知名的开源软件的核心开发人员":["14.0"],"或是你是某知名公司核心项目的核心开发人员":["14.0"],"等等":["14.0"],"关注技术趋势":["14.0"],"找到能体现价值的地方":["14.0"],"prod":["16.0"],"ib":["17.0"],"cloudapigateway":["17.0"],"autoconfigure":["17.0"],"autoconfigures":["17.0"],"framework":["17.0","38.1"],"学习记录":["19.0"],"tools":["19.0"],"页面排版混乱":["20.0"],"工作队列":["21.1"],"在一个电商平台的后端系统中":["21.1"],"spring框架":["21.2"],"核心实现":["21.2"],"同时避免过多的线程闲置":["21.3"],"技术实现":["21.3","21.4"],"在spring框架中":["21.3"],"以及数据库连接池等外部资源的限制":["21.4"],"可以通过设置queuecapacity属性来指定工作队列的大小":["21.5"],"难点解决":["21.5"],"避免因队列溢出而导致的订单丢失或系统性能下降":["21.5"],"常规单词本功能":["22.1"],"数据流转清晰":["23.0"],"因为定位元素会创建一个新的包含块":["24.0"],"如果元素的祖先元素中没有定位元素":["24.0"],"i":["26.0","61.0"],"t":["26.0"],"input":["27.1"],"图片上传组件":["27.1"],"简略列表":["27.2"],"单个sku表单":["27.2"],"重写校验方法":["27.3"],"studio中command":["29.0"],"tool需要使用8":["29.0"],"安装dockerfile":["30.0"],"安装dockercompose":["30.0"],"可按照此加密套件配置":["30.1"],"写法遵循":["30.1"],"openssl":["30.1"],"标准":["30.1"],"prefer":["30.1"],"root":["30.1"],"index":["30.1","44.1","52.1"],"location":["30.1"],"alias":["30.1"],"try":["30.1"],"files":["30.1"],"uri":["30.1"],"meeting":["32.0"],"net":["32.2","38.1"],"documentation":["32.2"],"一路点安装即可":["32.4"],"启动freeswitch":["32.5"],"支持版本回滚":["33.1"],"降低了部署风险":["33.1"],"云原生和微服务":["33.1"],"为微服务架构提供了理想的编排平台":["33.1"],"支持服务发现":["33.1"],"负载均衡和灵活部署":["33.1"],"cri":["33.2"],"路径下":["33.3"],"配置网络":["33.3"],"会为每个":["33.3"],"分配一个集群内部的":["33.3"],"ip":["33.3"],"地址":["33.3"],"并设置适当的网络规则":["33.3"],"以便":["33.3"],"之间可以相互通信":["33.3"],"启动":["33.3"],"会创建一个":["33.3"],"loadbalancer":["33.3"],"pod是kubernetes中调度和管理的基本单位":["33.5"],"container是pod中的工作负载单元":["33.5"],"存储的是实际的数据":["34.1"],"因此":["34.1"],"表本身就是按照主键聚集的":["34.1"],"查询性能":["34.1"],"在读取方面的性能较好":["34.1"],"但在写入和并发性能方面相对较弱":["34.1"],"在写入和并发性能方面更强":["34.1"],"但读取速度稍慢":["34.1"],"表行数统计":["34.1"],"保存有表的总行数":["34.1"],"可以直接使用":["34.1"],"auto":["34.2"],"create":["34.2"],"user":["34.2","49.8"],"having":["34.3","34.5"],"筛选goup":["34.3","34.5"],"by的子句":["34.3","34.5"],"创建新的聚合字段":["34.3","34.5"],"c":["34.4"],"inner":["34.4"],"条件连接":["34.4"],"数量是两表的交际":["34.4"],"outer":["34.4"],"left":["34.4","44.6"],"和":["34.4"],"包括":["34.4"],"两种类型":["34.4"],"它们分别表示查询左表和右表的所有行":["34.4"],"即使没有被匹配":["34.4"],"再加上满足条件的交集部分":["34.4"],"左表或者右表长度":["34.4"],"加上交集":["34.4"],"实现right":["34.4"],"主表":["34.4"],"关联表顺序需要调换":["34.4"],"这可能导致代码难以理解":["36.0"],"维护和调试":["36.0"],"可移植性差":["36.0"],"位运算的结果可能依赖于底层的二进制表示和硬件架构":["36.0"],"在不同的平台和环境中":["36.0"],"位运算的结果可能不一致":["36.0"],"导致代码在不同环境下表现不同":["36.0"],"全局自动前端刷新token":["36.1"],"和vo":["36.3"],"api":["37.1","53.21"],"因此速度更快":["38.1"],"性能更高":["38.1"],"支持更广泛":["38.1"],"com加载项支持更广泛":["38.1"],"只需要有对应的":["38.1"],"vsto":["38.1"],"runtime运行环境":["38.1"],"有更好的word":["38.1"],"textbutton":["38.2"],"按钮1":["38.2"],"screentip":["38.2"],"onaction":["38.2"],"ontextbutton":["38.2"],"supertip":["38.2"],"inserts":["38.2"],"坑":["38.4"],"安装可配置注册表":["38.5"],"依赖项":["38.5"],"true":["38.7"],"run":["39.2"],"llama3":["39.2"],"业务服务端":["40.1"],"调用documentbuilder解析word文件":["40.1"],"用户连接或断开连接时":["40.2"],"文档已准备好保存":["40.2"],"用户完成编辑并准备保存文档时":["40.2"],"v到docker内即可":["40.3"],"be":["42.0"],"passed":["42.0"],"link":["42.0"],"https":["42.0"],"mishoo":["42.0"],"uglifyjs":["42.0"],"按照顺序拿出来":["43.3"],"尝试捕获到之后重试":["43.5"],"它并没有内置的状态管理功能":["43.6"],"而是鼓励开发者使用其他流行的状态管理库":["43.6"],"互动式学英语":["44.0"],"add":["44.1"],"fulltext":["44.1"],"content":["44.1"],"ftindex":["44.1"],"translation":["44.1"],"select":["44.1"],"from":["44.1"],"加入分享":["44.2"],"private":["44.4"],"request":["44.5"],"if":["44.5"],"throw":["44.5"],"new":["44.5"],"businessexception":["44.5"],"errorcode":["44.5"],"params":["44.5"],"error":["44.5"],"cw":["44.6"],"join":["44.6"],"社区活跃度较高":["45.1"],"js技术栈":["45.1"],"需要注意的是":["45.2"],"如果需要编译ios应用":["45.2"],"则需要":["45.2"],"安装xcode":["45.2"],"macos虚拟机":["45.2"],"build":["45.2","49.7"],"repositories":["45.2"],"maven":["45.2"],"url":["45.2"],"command":["46.0"],"line":["46.0"],"tools三者":["46.0"],"amazon":["47.2"],"corretto":["47.2"],"worker进程":["48.1"],"避免主进程中继":["48.1"],"其他功能":["49.6"],"官网文档":["49.6"],"相当于":["49.7"],"updatetime":["49.8"],"time":["49.8"],"updateuser":["49.8"],"alive的问题":["52.0"],"js":["52.1","53.0"],"在vue中":["52.1"],"渲染阶段是在事件循环的任务队列执行完毕后进行的":["52.1"],"如果一次事件循环中":["52.1"],"调用了nexttick":["52.1"],"传入了回调":["52.1"],"那么nexttick改变的值会在":["52.1"],"在dom更新队列被刷新之后执行回调函数":["52.1"],"dom更新队列刷新之后":["52.1"],"并不一定会进入渲染阶段":["52.1"],"如果nexttick中":["52.1"],"还有微任务":["52.1"],"那么会等微任务执行完了之后再渲染相关的dom更新队列":["52.1"],"当vue检测到需要进行重新渲染时":["52.1"],"它会将渲染的任务添加到任务队列中":["52.1"],"该任务会在当前任务执行完毕后立即执行":["52.1"],"unref是获取引用值":["52.4"],"但并不会递归获取":["52.4"],"blogs":["53.0"],"coding":["53.0"],"learning":["53.0"],"record":["53.0"],"three":["53.0"],"mesh":["53.4"],"draco":["53.4"],"移除不必要的数据":["53.5"],"在gltf":["53.5"],"glb文件中":["53.5"],"可能包含一些不必要的数据":["53.5"],"如动画":["53.5"],"骨骼":["53.5"],"材质等":["53.5"],"mp":["53.7","56.0"],"weixin":["53.7"],"加速跑动":["53.17"],"及常见显示效果的实现方式":["53.19"],"了解web图形领域":["53.19"],"cpu和gpu端的性能优化方法":["53.19"],"熟悉web技术栈":["53.19"],"几何":["53.20"],"图形学和渲染技术":["53.20"],"webgl":["53.21"],"体积最小":["53.23"],"效果最好":["53.23"],"才可以开通微信支付":["54.2"],"不同实例之间互不影响":["55.4"],"例外":["55.4"],"digestutil":["55.6"],"md5hex":["55.6"],"randomutil":["55.6"],"randomnumbers":["55.6"],"rdic词典":["56.0"],"分类":["56.0"],"分享加入":["56.0"],"微信公众号登录":["56.0"],"过程中":["56.0"],"plus":["56.0"],"redis":["56.0"],"熟悉好":["56.0"],"背背八股文":["56.0"],"换成邮箱登陆":["56.0"],"技术栈spring":["57.1"],"boot":["57.1"],"vue3":["57.1","59.2"],"ts":["57.1"],"微前端调研":["57.1"],"qiankun项目落地":["57.1"],"wsl":["57.1"],"nginx部署":["57.1"],"微前端权限管理设计落地":["57.1"],"不敢问成员进度":["57.2"],"怕招人口舌":["57.2"],"封装组件":["57.2"],"缺少大的整体规划":["57.2"],"效率也ok":["57.3"],"但得深入点细节和产品":["57.3"],"改掉臭毛病":["57.4"],"做的不对的时候":["57.4"],"需要承认不行":["57.4"],"不自夸":["57.4"],"不给别人负面的评价":["57.4"],"关注家人的心理健康":["57.4"],"定期组织集体的运动":["57.4"],"sse":["58.5"],"轮询":["58.5"],"收录meta方式无法收录":["59.1"],"因为meta多了data":["59.1"],"属性":["59.1"],"域名下放认证文件的模式":["59.1"],"落地":["59.2"],"vue2":["59.2"],"history控制权冲突":["59.2"],"同时有两个实例时":["59.2"],"弹窗应用使用虚拟路由":["59.2"],"部署":["59.2"],"运维用k8s不熟":["59.2"],"混淆了redirect与tryfiles":["59.2"],"微博":["59.3"],"从上往下时":["59.3"],"nexttick中节点渲染好了就把container高度固定死":["59.3"],"滑动过快到底部往上走":["59.3"],"高度跳变":["59.3"],"总结":["59.4"],"attrs":["59.5"],"用户接受程度":["59.6"],"chrome插件":["59.6"],"框架无关":["60.0"],"astro":["60.0"],"其他同学":["60.0"],"ubuntu安装deb包":["61.0"],"sudo":["61.0"],"dpkg":["61.0"],"package":["61.0"],"pages":["64.0"]},{"0":["29.0"],"1":["52.1"],"2":["16.0","46.0","52.1"],"3":["11.10","52.1"],"4":["40.2","53.5","55.6"],"5":["59.2"],"6":["33.1","33.3","53.19"],"8":["47.2","55.6"],"105":["22.2"],"232":["47.2"],"301":["30.1"],"373":["17.0"],"2023":["53.17"],"8880":["22.2"],"data":["0.0"],"for":["0.0"],"current":["0.0"],"of":["0.9"],"gradio":["1.0"],"queue":["1.0"],"api":["1.0","22.2","32.2","53.19"],"360w以太币":["2.4"],"供应商货物":["3.0"],"品质稳定":["3.0"],"wechat":["4.1"],"使用":["5.0"],"dialogue":["7.1"],"这些能力":["7.1"],"才是未来":["7.1"],"ai出现后":["7.1"],"比如":["8.0"],"一个数学计算工具类中可能包含一些常用的数学常数":["8.0"],"这些常数可以声明为静态变量":["8.0"],"计数器":["8.0"],"console":["9.0","42.0"],"system":["9.0"],"setproperty":["9.0"],"org":["9.0"],"apache":["9.0"],"each":["11.9"],"other":["11.9"],"or":["11.9"],"elit":["11.10"],"integer":["11.10","44.4"],"molestie":["11.10"],"massa":["11.10"],"you":["11.10"],"can":["11.10"],"syntax":["11.11"],"highlighting":["11.11"],"js":["11.11","56.0"],"var":["11.11","12.1"],"foo":["11.11"],"pica":["11.13"],"enable":["11.13"],"url":["11.14"],"location":["11.14","38.2"],"https":["11.14","30.1"],"support":["11.15"],"to":["11.16"],"change":["11.16"],"o":["11.17","33.2"],"footnotecan":["11.20"],"have":["11.20"],"compact":["11.21"],"style":["11.21"],"and":["11.22"],"so":["11.22"],"on":["11.22","44.6"],"addon":["12.1"],"require":["12.1"],"bindings":["12.1"],"法律文书撰写":["13.0"],"公文撰写":["13.0"],"成为一个好的leader":["14.0"],"帮人解决问题":["14.0"],"被人依赖":["14.0"],"能做关键决定":["14.0"],"开放心态":["14.0"],"倾向性价值观":["14.0"],"build":["16.0"],"application":["16.0"],"client":["17.0"],"user":["17.0"],"好用的工具":["19.0"],"线索第二次进入":["20.0"],"假设我们需要设计一个用于处理订单的自定义线程池":["21.1"],"自定义线程池用于管理订单处理的并发执行":["21.2"],"重点难点":["21.2"],"可以使用threadpooltaskexecutor来创建自定义线程池":["21.3"],"并通过设置corepoolsize属性来指定核心线程数":["21.3"],"在threadpooltaskexecutor中":["21.4"],"可以通过设置maxpoolsize属性来指定最大线程数":["21.4"],"需要根据系统负载和任务处理时间来动态调整工作队列的大小":["21.5"],"并采取适当的任务拒绝策略":["21.5"],"查词":["22.1"],"代码逻辑":["23.0"],"offsettop就是相对于":["24.0"],"html":["24.0"],"p":["26.0"],"总的组件数有上万个":["27.1"],"同上2":["27.2"],"引入validate":["27.3"],"读取elform下面的elformitem数据":["27.3"],"apk安装包":["29.0"],"获取ssl证书":["30.0"],"填写您的证书绑定的域名":["30.1"],"例如":["30.1"],"cloud":["30.1"],"tencent":["30.1"],"return":["30.1"],"host":["30.1"],"request":["30.1"],"将http的域名请求转成https":["30.1"],"shell":["30.1"],"sh":["30.1"],"down":["30.1"],"getnameen":["31.0"],"webrtc":["32.0"],"x":["32.2"],"session":["32.2"],"用管理员方式运行":["32.4"],"管理员方式启动":["32.5"],"可以无缝地与其他云原生工具":["33.1"],"如prometheus":["33.1"],"istio等":["33.1"],"集成":["33.1"],"构建完整的云原生应用程序堆栈":["33.1"],"类型的":["33.3"],"并将其与":["33.3"],"关联":["33.3"],"该":["33.3"],"会获取一个集群外部可访问的":["33.3"],"并将流量转发到后端":["33.3"],"自动扩缩容":["33.3"],"如果应用程序负载发生变化":["33.3"],"可以根据":["33.3"],"中定义的副本数量":["33.3"],"它包含了应用程序代码和所需的依赖库":["33.5"],"每个container都是隔离的":["33.5"],"拥有自己的文件系统":["33.5"],"select":["34.1"],"count":["34.1"],"from":["34.1"],"table":["34.1"],"获取":["34.1"],"没有保存表的总行数":["34.1"],"因此在使用":["34.1"],"时会遍历整个表":["34.1"],"消耗较大":["34.1"],"engine":["34.2"],"substitution":["34.2"],"推荐sql学习":["34.2"],"sum":["34.3","34.5"],"rank":["34.3","34.5"],"开窗函数":["34.3","34.5"],"中分组":["34.3"],"分数":["34.4"],"使用子查询的方式来获取存在对应班级的学生的所有数据":["34.4"],"返回学生姓名":["34.4"],"字段":["34.4"],"in":["34.4","44.1"],"是否存在":["34.4"],"exists":["34.4"],"子查询的方式来获取":["34.4"],"不存在对应班级的":["34.4"],"学生的所有数据":["34.4"],"难以调试":["36.0"],"由于位运算操作是直接在二进制位上进行的":["36.0"],"调试过程中很难直观地观察和理解中间结果":["36.0"],"这可能增加调试的复杂性和困难度":["36.0"],"综上所述":["36.0"],"位运算在":["36.0"],"javascript":["36.0"],"react":["36.1"],"value":["36.3"],"声明式router":["37.1"],"wps客户端兼容性":["38.1"],"可定制性更强":["38.1"],"com加载项可以使用本地编程语言进行开发":["38.1"],"支持更多的编程语言特性和库函数":["38.1"],"发布受厂商限制少3":["38.1"],"采用的技术选型":["38.1"],"com加载项":["38.1"],"结合webview":["38.1"],"优势":["38.1"],"at":["38.2"],"the":["38.2"],"cursor":["38.2"],"tablebutton":["38.2"],"按钮2":["38.2"],"代码证书":["38.4"],"一套代码":["38.5"],"打包后一次性安装":["38.5"],"wps":["38.7"],"70b":["39.2"],"用户端服务":["40.1"],"发生文档保存错误":["40.2"],"在尝试保存文档时出现错误":["40.2"],"文档已关闭":["40.2"],"compress":["42.0"],"drop":["42.0"],"debugger":["42.0"],"pure":["42.0"],"funcs":["42.0"],"然后用fetch":["43.3"],"如":["43.6"],"redux":["43.6"],"场景例句巩固":["44.0"],"where":["44.1","49.8"],"match":["44.1"],"against":["44.1"],"润":["44.1"],"boolean":["44.1"],"mode":["44.1"],"私有单词库":["44.2"],"默认所有人可以编辑":["44.2"],"dicspage":["44.5"],"调用mybatis":["44.5"],"plus包装的mapper接口":["44.5"],"dics":["44.6"],"wordid":["44.6"],"总的来说":["45.1"],"不分伯仲":["45.1"],"aliyun":["45.2"],"com":["45.2","53.7","59.1"],"repository":["45.2"],"public":["45.2"],"android":["46.0"],"不报错了":["46.0"],"09":["47.2"],"const":["48.1"],"new":["48.1","49.7"],"browserwindow":["48.1"],"后端的代码":["49.6"],"status":["49.8"],"添加配置之后":["49.8"],"解决方案":["52.0"],"路由拍平":["52.0"],"一旦进入渲染阶段":["52.1"],"vue会执行以下操作":["52.1"],"比对虚拟dom":["52.1"],"virtual":["52.1"],"dom":["52.1"],"vue会比对当前的虚拟dom和上一次渲染时的虚拟dom":["52.1"],"找出两者之间的差异":["52.1"],"执行dom更新":["52.1"],"根据比对的结果":["52.1"],"vue会将需要更新的dom元素添加到更新队列中":["52.1"],"执行异步更新":["52.1"],"vue会将dom更新操作放入微任务队列中":["52.1"],"以便在当前任务执行完毕后立即执行":["52.1"],"toraw是获取响应式对象的原始对象":["52.4"],"md":["53.0"],"description":["53.0"],"这是默认设置":["53.0"],"请设置":["53.0"],"custommade":["53.0"],"打开korofileheader查看配置":["53.0"],"进行设置":["53.0"],"draco算法优化":["53.4"],"如果你的应用程序不需要这些数据":["53.5"],"可以考虑在导出模型时将其移除":["53.5"],"以减小文件大小":["53.5"],"优化模型结构":["53.5"],"检查模型的结构":["53.5"],"确保没有重复的顶点或面片":["53.5"],"qq":["53.7"],"06":["53.17"],"及webgl":["53.19"],"有较强的学习能力":["53.19"],"问题分析与解决能力":["53.19"],"热爱技术和软件开发":["53.19"],"加分项":["53.19"],"及常见显示效果的实现方式":["53.20"],"了解rust":["53.20"],"rust":["53.21"],"webassembly":["53.21"],"图形学":["53.21"],"如果没有复杂交互":["53.23"],"锁对象是":["55.4"],"class以及synchronized修饰的是static方法的时候":["55.4"],"所有对象公用同一把锁":["55.4"],"插入数据":["55.6"],"setuseraccount":["55.6"],"setuserpassword":["55.6"],"前端项目沉淀":["56.0"],"next":["56.0"],"项目脚手架":["56.0"],"headless":["56.0"],"ui组件库":["56.0"],"选择开源项目细分领域":["56.0"],"给领域知名项目提pr":["56.0"],"可以从bug修复开始":["56.0"],"参与知名项目的技术事务":["56.0"],"读完了":["57.1"],"vue":["57.1"],"js设计与实现":["57.1"],"react技术揭秘":["57.1"],"深入浅出electron原理":["57.1"],"工程与实践":["57.1"],"等书籍":["57.1"],"antd":["57.1"],"如设计机构saas中的组件库规划":["57.2"],"过于专注于技术测":["57.2"],"但缺少对产品本身":["57.2"],"交互的钻研":["57.2"],"测试对好":["57.3"],"从同事":["57.3"],"露营":["57.4"],"短途旅行":["57.4"],"给家人做饭":["57.4"],"新家装修":["57.4"],"风格":["57.4"],"整体方案确认":["57.4"],"初步定设计图":["57.4"],"ws":["58.5"],"用户反馈登录态过期":["59.1"],"实际上www":["59.1"],"abc":["59.1"],"com访问和abc":["59.1"],"com存的cookie":["59.1"],"domain分别是":["59.1"],"和abc":["59.1"],"element冲突主应用":["59.2"],"elemtnplus":["59.2"],"基座影响子应用":["59.2"],"解决方式是对子应用postcss":["59.2"],"依赖包处理增加prevfix处理":["59.2"],"也可以主应用本身cs也用打包工具处理":["59.2"],"加scoped或者前缀":["59.2"],"发版时已经加载的页面":["59.2"],"白屏问题":["59.3"],"小红书的瀑布流虚拟列表":["59.3"],"直接把滚动条隐藏了":["59.3"],"只能滑轮滚":["59.3"],"rem有局限性吗":["59.4"],"props等":["59.5"],"分发问题":["59.6"],"多主题":["60.0"],"配置ui":["60.0"],"deb":["61.0"],"杀掉8888端口应用":["61.0"],"lsof":["61.0"]},{"1":["53.4"],"2":["38.4"],"4":["52.1","56.0"],"5":["52.1","53.5"],"6":["40.2"],"7":["33.3"],"8":["33.3"],"12":["17.0"],"13":["17.0"],"15":["53.17"],"30":["17.0"],"41":["17.0"],"46":["53.4"],"241":["17.0"],"349":["17.0"],"2024":["17.0"],"3306":["26.0"],"8888":["61.0"],"it":["0.0"],"works":["0.0"],"in":["0.0"],"both":["0.0"],"md":["0.0"],"runtime":["0.9"],"apis":["0.9"],"xformers":["1.0"],"打开文档":["1.0"],"防止梯子问题":["1.0"],"结论传统产业":["3.0"],"也ok":["3.0"],"选择性update":["5.0"],"做模型是没有意义的":["7.1"],"就像iphone出来后":["7.1"],"大量的山寨手机":["7.1"],"很快就会被市场淘汰":["7.1"],"静态变量可以用于跟踪类的实例创建了多少次":["8.0"],"或者用于记录某个事件发生的次数":["8.0"],"总的来说":["8.0","33.1"],"静态变量适合用于表示类级别的属性":["8.0"],"commons":["9.0"],"jelly":["9.0"],"tags":["9.0"],"fmt":["9.0"],"timezone":["9.0"],"link":["10.0"],"smartypants":["11.7"],"double":["11.7"],"quotes":["11.7"],"and":["11.7"],"with":["11.9","11.16","17.0"],"spaces":["11.9"],"between":["11.9"],"use":["11.10","17.0","47.2"],"sequential":["11.10"],"numbers":["11.10"],"keep":["11.10","57.4"],"all":["11.10","34.4"],"the":["11.10"],"as":["11.10"],"function":["11.11"],"bar":["11.11"],"return":["11.11"],"console":["11.11","12.1"],"linkify":["11.13"],"to":["11.13"],"octodex":["11.14"],"github":["11.14","34.2","53.0"],"com":["11.14","34.2"],"dojocat":["11.14"],"syntax":["11.15"],"output":["11.16","42.0"],"markupand":["11.20"],"multiple":["11.20"],"paragraphs":["11.20"],"hyper":["11.22"],"text":["11.22"],"hello":["12.1"],"log":["12.1","42.0"],"等领域模型":["13.0"],"上下文提示":["13.0"],"热情":["14.0"],"冲劲":["14.0"],"抓住重点":["14.0"],"看透本质":["14.0"],"能画饼":["14.0"],"yml中添加占位":["16.0"],"yml":["16.0"],"spring":["16.0","17.0"],"name":["16.0"],"wxmp":["16.0"],"默认":["16.0"],"artifact":["17.0"],"hibernate":["17.0"],"validator":["17.0"],"final":["17.0"],"has":["17.0"],"been":["17.0"],"relocated":["17.0"],"default":["17.0"],"deleting":["17.0"],"target":["17.0"],"utf":["17.0"],"encoding":["17.0"],"copy":["17.0"],"filtered":["17.0"],"copying":["17.0"],"compiler":["17.0"],"compile":["17.0"],"detected":["17.0"],"recompiling":["17.0"],"module":["17.0"],"compiling":["17.0"],"source":["17.0"],"files":["17.0"],"classes":["17.0"],"src":["17.0"],"main":["17.0"],"executor":["17.0"],"namedthreadfactory":["17.0"],"uses":["17.0"],"or":["17.0"],"overrides":["17.0"],"deprecated":["17.0"],"that":["17.0"],"marked":["17.0"],"removal":["17.0"],"recompile":["17.0"],"xlint":["17.0"],"details":["17.0"],"controller":["17.0"],"institutionreportskucontroller":["17.0"],"input":["17.0"],"unchecked":["17.0"],"unsafe":["17.0"],"operations":["17.0"],"testresources":["17.0"],"not":["17.0"],"testcompile":["17.0"],"sources":["17.0"],"surefire":["17.0"],"tests":["17.0"],"are":["17.0"],"skipped":["17.0"],"repackage":["17.0"],"replacing":["17.0"],"repackaged":["17.0"],"archive":["17.0"],"installing":["17.0"],"pom":["17.0"],"success":["17.0"],"total":["17.0"],"time":["17.0"],"finished":["17.0"],"02":["17.0"],"07t08":["17.0"],"08":["17.0"],"00":["17.0"],"cp":["17.0"],"rf":["17.0"],"anything":["19.0"],"分享一些代码":["19.0"],"没有请求html":["20.0"],"最大线程数和工作队列的设计时需要注意":["21.1"],"保证订单处理的高并发和可靠性":["21.2"],"避免资源竞争和订单丢失":["21.2"],"难点解决":["21.3","21.4"],"通过监控订单请求量和系统资源利用率":["21.3"],"避免因线程过多而导致资源竞争或内存溢出的问题":["21.4"],"通过以上的结构化设计考量":["21.5"],"可以设计出一个高效":["21.5"],"稳定的订单处理线程池":["21.5"],"发音":["22.1"],"translate":["22.2"],"getresult":["22.2"],"query":["22.2"],"越少分支越好":["23.0"],"元素的":["24.0"],"所以offsettop是相对于最近的定位祖先元素":["24.0"],"页面性能问题严重":["27.1"],"200多个物料的场景就卡的动不了":["27.1"],"总结":["27.2","58.5","59.1","59.2"],"多了个":["27.2"],"不定高度虚拟列表处理":["27.2"],"拿到需要校验的validator":["27.3"],"循环列表传入数据":["27.3"],"点击下载":["29.0"],"git仓库":["29.0"],"sl证书解析配置":["30.0"],"stop":["30.1"],"f":["30.1"],"rm":["30.1"],"rmi":["30.1"],"up":["30.1"],"updatedist":["30.1"],"mv":["30.1"],"backup":["30.1"],"date":["30.1"],"y":["30.1"],"m":["30.1"],"update":["31.0"],"entity的方法":["31.0"],"是一个webrtc的封装库":["32.0"],"javascript":["32.2"],"替换轨道":["32.2"],"7443的端口":["32.5"],"供应商无关性":["33.1"],"kubernetes可以运行在各种环境中":["33.1"],"包括本地数据中心":["33.1"],"公有云和私有云":["33.1"],"提供了环境抽象和可移植性":["33.1"],"kubernetes通过自动化":["33.1"],"等":["33.2","43.6"],"自动水平扩展或缩容":["33.3"],"实例数量":["33.3"],"自动恢复":["33.3"],"如果某个":["33.3"],"出现故障":["33.3"],"会自动重新创建一个新的":["33.3"],"以保持应用程序的运行状态":["33.3"],"滚动更新":["33.3"],"当需要更新应用程序时":["33.3"],"支持滚动更新策略":["33.3"],"可以一次更新一部分":["33.3"],"cpu":["33.5"],"内存和进程空间":["33.5"],"一个pod可以包含一个或多个container":["33.5"],"但在加了":["34.1"],"where":["34.1","44.6"],"条件后":["34.1"],"处理方式相同":["34.1"],"总之":["34.1"],"如果你的应用需要事务支持":["34.1"],"外键约束以及更好的并发性能":["34.1"],"如果你对读取速度和全文索引有更高的要求":["34.1"],"或者处理静态数据":["34.1"],"https":["34.2","53.0"],"liyupi":["34.2"],"partition":["34.3","34.4","34.5"],"by":["34.3","34.5"],"union":["34.3","34.4","34.5"],"包括两种常见的组合查询操作":["34.4"],"操作":["34.4"],"它用于将两个或多个查询的结果集合并":["34.4"],"并去除重复的行":["34.4"],"即如果两个查询的结果有相同的行":["34.4"],"则只保留一行":["34.4"],"它也用于将两个或多个查询的结果集合并":["34.4"],"但不去除重复的行":["34.4"],"则全部保留":["34.4"],"还有一个新学生表":["34.4"],"new":["34.4"],"包含的字段和学生表完全一致":["34.4"],"语句":["34.4"],"获取所有学生表和新学生表的学生姓名":["34.4"],"要求保留重复的学生记录":["34.4"],"开窗函数":["34.4"],"over":["34.4"],"打个比方":["34.4"],"可以将开窗函数想象成一种":["34.4"],"透视镜":["34.4"],"它能够将我们聚焦在某个特定的分组":["34.4"],"同时还能看到整体的全景":["34.4"],"本节我们先讲第一个开窗函数":["34.4"],"该函数用法为":["34.4"],"返回每个学生的详细信息":["34.4"],"字段顺序和原始表的字段顺序一致":["34.4"],"并计算每个班级的学生平均分":["34.4"],"中分组":["34.5"],"领域具有一些优势":["36.0"],"如高效性能和节省空间":["36.0"],"然而":["36.0"],"它也存在一些缺点":["36.0"],"如可读性较差和可移植性差":["36.0"],"在使用位运算时":["36.0"],"需权衡其优势和缺点":["36.0"],"suspense":["36.1"],"都是用于在系统之间传输数据的对象":["36.3"],"便于内网部署":["38.1"],"web项目集成":["38.1"],"能同时兼容wps":["38.1"],"office":["38.1"],"web资源支持增量更新":["38.1"],"支持clickone部署":["38.1"],"一次安装":["38.1"],"后续远程自动更新":["38.1"],"难点":["38.1"],"webview":["38.1"],"table":["38.2","42.0"],"ontablebutton":["38.2"],"a":["38.2"],"自建证书不支持自动更新":["38.4"],"word":["38.5"],"wps":["38.5"],"rest":["39.2"],"api就启动好在本地了":["39.2"],"http":["39.2"],"传参给业务服务端渲染word":["40.1"],"没有任何更改":["40.2"],"用户关闭文档且未做任何更改":["40.2"],"编辑中保存":["40.2"],"用户在编辑过程中保存了文档的当前状态":["40.2"],"sourcemap":["42.0"],"false":["42.0","48.1"],"entry":["42.0"],"foo":["42.0"],"sdk文件入口":["42.0"],"请求回来":["43.3"],"按照顺序内联在子应用里面运行":["43.3"],"vuex":["43.6"],"单词本":["44.1"],"增加":["44.1"],"done":["44.1"],"单词本分享":["44.1"],"单词本分类":["44.1"],"单词本改名":["44.1"],"单词":["44.1"],"分享编辑单词库":["44.2"],"isdelete":["44.4"],"list":["44.5"],"dicslist":["44.5"],"customwordsmapper":["44.5"],"getdictionariesbyworkbookid":["44.5"],"workbookid":["44.5"],"customwordspage":["44.5"],"国际服上对flutter的技术认可度高些":["45.1"],"reactnative":["45.1"],"google":["45.2","57.1"],"project":["46.0"],"structure":["46.0"],"设置sdk为33":["46.0"],"show":["48.1"],"webpreferences":["48.1"],"nodeintegration":["48.1"],"写起来好丝滑":["49.6"],"setstatus":["49.7"],"支持别名":["49.8"],"不用引用完整路径":["49.8"],"mapper配置文件":["49.8"],"mapper":["49.8"],"locations":["49.8"],"classpath":["49.8"],"扫描包名":["49.8"],"type":["49.8"],"aliases":["49.8"],"每一层路由都需要加keepalive":["52.0"],"执行实际的dom操作":["52.1"],"在微任务队列执行时":["52.1"],"vue会遍历更新队列":["52.1"],"并根据具体的dom操作":["52.1"],"添加":["52.1"],"删除":["52.1"],"修改等":["52.1"],"对真实的dom进行操作":["52.1"],"渲染完成":["52.1"],"一旦完成dom的更新":["52.1"],"vue会触发":["52.1"],"mounted":["52.1"],"或":["52.1"],"updated":["52.1"],"会递归解开proxy对象":["52.4"],"obkoro1":["53.0"],"koro1fileheader":["53.0"],"wiki":["53.0"],"e9":["53.0"],"正常加载":["53.4"],"感兴趣的朋友可以了解一下":["53.4"],"压缩的技术":["53.4"],"优化模型结构可以减小文件大小":["53.5"],"并提高渲染性能":["53.5"],"使用压缩工具":["53.5"],"你可以使用gltf":["53.5"],"glb的压缩工具来进一步减小文件大小":["53.5"],"这些工具可以对模型进行压缩和优化":["53.5"],"s":["53.7"],"g4whbdmgnj5ol2t1d":["53.7"],"有业余开源项目供技术参考":["53.19"],"深入了解过至少一款渲染引擎的内部实现架构和技术细节":["53.19"],"了解rust":["53.19"],"webassembly":["53.20"],"webgpu等技术":["53.20"],"渲染技术":["53.21"],"几何":["53.21"],"只是循环的3d动画":["53.23"],"只根据白天晚上切换video":["53.23"],"synchronized修饰的方法":["55.4"],"setaccesskey":["55.6"],"setsecretkey":["55.6"],"boolean":["55.6"],"saveresult":["55.6"],"this":["55.6"],"save":["55.6"],"比如":["56.0"],"rfc":["56.0"],"讨论":["56.0"],"bug":["56.0"],"修":["56.0"],"成为知名项目活跃contributor":["56.0"],"成为知名项目核心成员":["56.0"],"为什么程序员要出书":["56.0"],"在行业会议演讲":["56.0"],"写系列文章":["56.0"],"g6库":["57.1"],"用":["57.1"],"svg图":["57.1"],"画类3d的图":["57.1"],"方法论":["57.1"],"重视github":["57.1"],"issue":["57.1"],"官网文档":["57.1"],"需求侧未确定导致的变动返工多":["57.2"],"技能和知识增长":["57.2"],"其实还有一些翻了一部分的书":["57.2"],"看了一部分的视频课程":["57.2"],"上级或客户那里收到了很多肯定和改进的建议":["57.3"],"对团队或公司提出了一些改进的建议":["57.3"],"todo":["57.4","59.4"],"新的一年":["57.4"],"大家都走好运":["57.4"],"looking":["57.4"],"until":["57.4"],"you":["57.4"],"find":["57.4"],"落地":["58.5"],"不一致导致的":["59.1"],"如果是不同的子域名":["59.1"],"使用oauth2":["59.1"],"做登录态共享":["59.1"],"加载了过期的已加载js":["59.2"],"请求了chunk中过期的异步加载css":["59.2"],"页面级别":["59.2"],"导致的样式错乱问题":["59.2"],"loader捕捉css加载的err":["59.2"],"ps":["59.2"],"运维手段是立即删除所有旧的资源":["59.2"],"cdn共享组件库优化":["59.2"],"多tab场景下vnode缓存todo":["59.2"],"思考":["59.2"],"并且后端接口数据中直接返回图片的宽高":["59.3"],"pc端的微博":["59.3"],"刷的过快它一定会先白屏之后再出现内容":["59.3"],"其次就是像腾讯会议里回放的文本记录":["59.3"],"每段文本记录都是item":["59.3"],"原生组件有坑":["59.5"],"谷歌市场上架":["59.6"],"onlyoffice":["59.6"],"富文本编辑器":["60.0"],"hexo":["60.0"],"kill":["61.0"],"上面的pid":["61.0"],"查看系统版本":["61.0"]},{"4":["42.0"],"5":["11.11"],"6":["53.5"],"7":["17.0","40.2","53.5"],"9":["17.0"],"57":["11.10"],"85":["53.0"],"147":["17.0"],"1364":["34.1"],"4716":["17.0"],"11434":["39.2"],"12345":["34.1"],"vue":["0.0"],"files":["0.0"],"能开放sdui的api文档接口":["1.0"],"可以进一步二开":["1.0"],"数据":["7.1"],"提到自己的公司":["7.1"],"stastic":["7.1"],"这些属性对于所有实例都是相同的":["8.0"],"或者在整个程序执行期间保持不变":["8.0"],"执行":["9.0"],"留言":["10.0"],"single":["11.7"],"strikethrough":["11.8"],"arrows":["11.9"],"numbering":["11.10"],"offset":["11.10"],"foo":["11.10"],"bar":["11.10"],"log":["11.11"],"see":["11.13","17.0"],"jpg":["11.14"],"twemoji":["11.16"],"2a":["11.21"],"2b":["11.21","17.0"],"markup":["11.22"],"language":["11.22"],"world":["12.1"],"灵活":["13.0"],"甘愿成就他人":["14.0"],"时间管理":["14.0"],"想清楚再做":["14.0"],"最短时间管理":["14.0"],"关注长期利益":["14.0"],"环境":["16.0"],"active":["16.0"],"支持":["16.0"],"swagger3":["16.0"],"docker":["17.0"],"t":["17.0","57.4"],"harbor":["17.0"],"latest":["17.0"],"instance":["17.0"],"driver":["17.0"],"internal":["17.0"],"load":["17.0"],"dockerignore":["17.0"],"transferring":["17.0"],"context":["17.0"],"done":["17.0"],"0s":["17.0"],"definition":["17.0"],"dockerfile":["17.0"],"539b":["17.0"],"io":["17.0"],"duxinglangzi":["17.0"],"alpine":["17.0"],"java11":["17.0"],"60mb":["17.0"],"4s":["17.0"],"run":["17.0"],"ln":["17.0"],"sf":["17.0"],"usr":["17.0"],"share":["17.0"],"zoneinfo":["17.0"],"asia":["17.0"],"shanghai":["17.0"],"etc":["17.0"],"localtime":["17.0"],"cached":["17.0"],"mkdir":["17.0"],"p":["17.0"],"workdir":["17.0"],"add":["17.0"],"2s":["17.0"],"opentelemetry":["17.0"],"javaagent":["17.0"],"arthas":["17.0"],"exporting":["17.0"],"image":["17.0"],"layers":["17.0"],"3s":["17.0"],"writing":["17.0"],"sha256":["17.0"],"b3f3032d24c1fd8a9b754a466ff3752f95f88fef600c7b15a72558f40375df4b":["17.0"],"naming":["17.0"],"login":["17.0"],"admin":["17.0"],"kbk6gspk8323ke639ilgqe":["17.0"],"password":["17.0"],"via":["17.0"],"cli":["17.0"],"insecure":["17.0"],"stdin":["17.0"],"will":["17.0"],"stored":["17.0"],"unencrypted":["17.0"],"lib":["17.0"],"json":["17.0"],"configure":["17.0"],"helper":["17.0"],"remove":["17.0"],"docs":["17.0"],"engine":["17.0"],"reference":["17.0"],"commandline":["17.0"],"store":["17.0"],"succeeded":["17.0"],"push":["17.0"],"refers":["17.0"],"d13869d0912e":["17.0"],"preparing":["17.0"],"12f16e5ab9ae":["17.0"],"2dedde4f174d":["17.0"],"5f70bf18a086":["17.0"],"37044c4bf4ce":["17.0"],"2e9c3dcb4310":["17.0"],"7dfcf721d46c":["17.0"],"018a9e842966":["17.0"],"bfbf3abdb35e":["17.0"],"c4d1b17971e5":["17.0"],"b311f6059b1e":["17.0"],"6b0ac22b586f":["17.0"],"4ce9227a27cf":["17.0"],"d17fd464e7c5":["17.0"],"bde76260b707":["17.0"],"54016b302478":["17.0"],"eb525327e85b":["17.0"],"3d18e271d2a5":["17.0"],"bb1b4953a69d":["17.0"],"8c2deaf64810":["17.0"],"34d5ebaa5410":["17.0"],"waiting":["17.0"],"layer":["17.0"],"already":["17.0"],"exists":["17.0"],"pushed":["17.0"],"digest":["17.0"],"32c96c17caca556b45ec7706d4740133c7498acb1bc80f04fbac831e57749d8d":["17.0"],"size":["17.0"],"rmi":["17.0"],"untagged":["17.0"],"deleted":["17.0"],"kubectl":["17.0"],"n":["17.0"],"rollout":["17.0"],"restart":["17.0"],"deployment":["17.0"],"apps":["17.0"],"restarted":["17.0"],"学习之外的东西":["19.0"],"动态调整核心线程数以适应业务需求的变化":["21.3"],"需要通过压力测试和性能调优来确定合适的最大线程数":["21.4"],"以满足业务需求的高并发和可靠性要求":["21.5"],"fuck":["22.2"],"不一定是直接的父元素":["24.0"],"体验产品":["27.2"],"业务同学也认为单个sku表单更合理":["27.2"],"结果几乎是把elform的核心校验逻辑走了一遍":["27.3"],"flutter":["29.0"],"demo":["29.0"],"h":["30.1"],"unzip":["30.1"],"o":["30.1"],"home":["30.1"],"lighthouse":["30.1"],"dist":["30.1"],"cp":["30.1"],"rf":["30.1"],"zip":["30.1"],"运行":["30.1"],"参考连接":["30.1"],"dto的值":["31.0"],"list":["31.0"],"用法":["31.0"],"若是webrtc重新createoffer":["32.2"],"替换轨道需要用发起重启createoffer":["32.2"],"编排和管理容器化应用程序":["33.1"],"大大简化了部署和运维工作":["33.1"],"提高了应用程序的可靠性":["33.1"],"可伸缩性和可移植性":["33.1"],"从而加速了企业向云原生应用程序和微服务架构的转型":["33.1"],"从而实现无停机部署":["33.3"],"总的来说":["33.3"],"在应用了上述配置后":["33.3"],"会自动处理应用程序的部署":["33.3"],"扩缩容":["33.3"],"恢复":["33.3"],"更新等生命周期管理任务":["33.3"],"只需要关注应用程序本身的开发和构建":["33.3"],"而无需处理太多的运维逻辑":["33.3"],"不过":["33.3"],"如果有特殊的需求或要对":["33.3"],"进行更多定制":["33.3"],"还是需要了解更多关于":["33.3"],"的知识":["33.3"],"这些container共享pod的资源":["33.5"],"那么":["34.1"],"可能更适合你":["34.1"],"执行sql报错":["34.1"],"http":["34.1"],"www":["34.1"],"kurui":["34.1"],"me":["34.1"],"error":["34.1"],"html":["34.1"],"mother":["34.2"],"all":["34.3","34.5"],"联表":["34.3","34.5"],"组内数据累加":["34.4"],"依次求和":["34.4"],"并且按照分数升序的方式累加计算每个班级的学生总分":["34.4"],"相当于groupby":["34.4"],"根据xxx分组":["34.4"],"此处为根据班级分组":["34.4"],"并且按照分数降序的方式计算每个班级内的学生的分数排名":["34.4"],"ranking":["34.4"],"rank":["34.4"],"根据班级分组":["34.4"],"row":["34.4"],"number":["34.4"],"几乎和rank一样":["34.4"],"完成":["34.4"],"并根据具体情况和需求选择是否使用":["36.0"],"在编写位运算代码时":["36.0"],"应注重代码的可读性":["36.0"],"可维护性和可移植性":["36.0"],"并添加适当的注释和文档说明":["36.0"],"混合开发带来的安全问题":["38.1"],"打包工具使用":["38.1"],"缺点":["38.1"],"mac系统无法兼容":["38.1"],"基于":["38.1"],"net框架":["38.1"],"以下以word插件展开讲":["38.1"],"com加载项结合webview2":["38.1"],"的技术选型":["38.1"],"vsto插件":["38.5"],"localhost":["39.2"],"桌面端配套":["39.2"],"强制保存文档时发生错误":["40.2"],"在执行强制保存操作时出现错误":["40.2"],"librarytarget":["42.0"],"esm导出":["42.0"],"适配webpack3":["42.0"],"建议用umd格式导出":["42.0"],"filename":["42.0"],"better":["42.0"],"jssip":["42.0"],"输出文件名":["42.0"],"来处理子应用之间的数据共享":["43.6"],"单词本内":["44.1"],"单词增加":["44.1"],"模糊查词":["44.1"],"单词发音":["44.1"],"customwordsservice":["44.5"],"getdictionariesbyxmlworkbookid":["44.5"],"resultutils":["44.5"],"success":["44.5"],"wordbookid":["44.6"],"workbookid":["44.6"],"对前端开发友好些":["45.1"],"gradle":["45.2"],"plugin":["45.2"],"mavenlocal":["45.2"],"mavencentral":["45.2"],"jcenter":["45.2"],"中间出啥问题":["45.2"],"doctor":["45.2"],"一下":["45.2"],"按照指令处理就可以啦":["45.2"],"此时":["46.0"],"adb设备也不报错了":["46.0"],"true":["48.1","49.8"],"某个页面需要单开的场景":["48.1"],"setid":["49.7"],"package":["49.8"],"com":["49.8"],"sky":["49.8"],"entity":["49.8"],"configuration":["49.8"],"开启驼峰命名":["49.8"],"map":["49.8"],"underscore":["49.8"],"to":["49.8"],"camel":["49.8"],"case":["49.8"],"生命周期钩子函数":["52.1"],"通知开发者渲染已完成":["52.1"],"需要注意的是":["52.1"],"vue使用了异步更新策略来优化性能":["52.1"],"它会将多个同步的数据变更操作合并为一个更新任务":["52.1"],"以减少不必要的dom操作":["52.1"],"这样可以提高性能并避免频繁的ui更新":["52.1"],"总结起来":["52.1"],"vue的渲染阶段会在事件循环的任务队列执行完毕后进行":["52.1"],"在渲染阶段":["52.1"],"vue会比对虚拟dom":["52.1"],"并最终对真实的dom进行操作":["52.1"],"完成渲染过程":["52.1"],"获取原始对象":["52.4"],"8d":["53.0"],"e7":["53.0"],"bd":["53.0"],"ae":["53.0"],"web3d":["53.0"],"webgl":["53.4"],"loader":["53.4"],"pipeline":["53.4"],"以提高加载性能和减少网络传输时间":["53.5"],"图片压缩webp格式":["53.5"],"使用drc加载":["53.5"],"bamg":["53.7"],"webassembly":["53.19"],"webgpu等技术":["53.19"],"硕士研究生及以上学历":["53.19"],"相关方向或者基础学科专业":["53.19"],"线性代数":["53.21"],"那么不太需要3d渲染这么重的东西":["53.23"],"system":["55.6"],"注册失败":["55.6"],"数据库错误":["55.6"],"return":["55.6"],"getid":["55.6"],"你在某个出版社出书":["56.0"],"相当于出版社以及出版社的其他作者给":["56.0"],"你在书对应的细分领域的心智垄断":["56.0"],"做背书":["56.0"],"你在行业会议演讲":["56.0"],"相当于会议方以及与会的其他演讲嘉宾给":["56.0"],"你在演讲主题对应的细分领域的心智垄断":["56.0"],"两者都是极高效建立心智垄断的手段":["56.0"],"不看百度":["57.1"],"csdn":["57.1"],"深入理解本质的技术点后":["57.1"],"不只是靠模糊的调试和随机的尝试":["57.1"],"能成倍提高效率":["57.1"],"好的方面":["57.1"],"脸皮变厚了":["57.1"],"但是没有写清楚为什么不看了":["57.2"],"也应该留存一些笔记":["57.2"],"过后翻阅":["57.2"],"并制定了实施这些建议的计划":["57.3"],"it":["57.4"],"don":["57.4"],"settle":["57.4"],"赶路的同时":["57.4"],"也要边享受生活":["57.4"],"服务端请求中访问vue实例":["59.1"],"nuxt2不可行":["59.1"],"服务端钩子中组件没有实例化":["59.1"],"还拿不到组件上面的方法":["59.1"],"语义化标签":["59.1"],"如果跨域子域名加载怎么做":["59.2"],"rbac1表设计":["59.2"],"几张表":["59.2"],"作用是什么":["59.2"],"关联关系是什么":["59.2"],"k8s启动一个pod":["59.2"],"cicd配置流程":["59.2"],"但是因为它的高度差不是说特别大":["59.3"],"而且是纯文本":["59.3"],"这个问题就基本不存在":["59.3"],"排版可能存在与wps不一致问题":["59.6"],"wordpress":["60.0"],"ghost":["60.0"],"lsb":["61.0"],"release":["61.0"],"a024":["61.0"]}]'},n={"0.0":{t:"# Runtime API Examples\r",p:"This page demonstrates usage of some of the runtime APIs provi ...",l:"api-examples.html",a:"runtime-api-examples"},"0.1":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.2":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.3":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.4":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;




`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.5":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.6":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.7":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.8":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;
`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.9":{t:"More\r",p:"Check out the documentation for the full list of runtime APIs. ...",l:"api-examples.html#more",a:"more"},"1.0":{t:"# stable-diffusion-ui实操\r",p:`cmd_args 参数集合
修改 webui-user.bat里
set COMMANDLINE_ARGS=--no-gra ...`,l:"blogs/ai/sdui.html",a:"stable-diffusion-ui实操"},"2.0":{t:"# 原理\r",p:"",l:"blogs/anything/block-chain.html",a:"原理"},"2.1":{t:"加密、数字签名\r",p:"",l:"blogs/anything/block-chain.html#加密、数字签名",a:"加密、数字签名"},"2.2":{t:"哈希、默克尔树\r",p:"",l:"blogs/anything/block-chain.html#哈希、默克尔树",a:"哈希、默克尔树"},"2.3":{t:"共识算法\r",p:"",l:"blogs/anything/block-chain.html#共识算法",a:"共识算法"},"2.4":{t:"基于共识的智能合约\r",p:`solidty 确保语言的确定性
the dao ico 360w以太币·
`,l:"blogs/anything/block-chain.html#基于共识的智能合约",a:"基于共识的智能合约"},"3.0":{t:"<!-- 跨境电商\r",p:`明通
免税店
总代理 不给货

大宗商品？

店铺资源 供应链 资金
供应商货物 品质稳定
--&gt;
&lt;!-- 结 ...`,l:"blogs/anything/commercial.html",a:"跨境电商"},"4.0":{t:"coding\r",p:`user interface : UI
`,l:"blogs/anything/english.html",a:"coding"},"4.1":{t:"life\r",p:`
can i connect you on wechat

`,l:"blogs/anything/english.html#life",a:"life"},"5.0":{t:"# 测试环境表结构同步到生产环境\r",p:`Dump with Format 导出ddl 整体表结构的sql 使用 选择性update
`,l:"blogs/anything/flyaway.html",a:"测试环境表结构同步到生产环境"},"6.0":{t:"使用frp实现内网穿透管理物联网设备 - 知乎-知乎文章\r",p:`需要配置服务器 服务端
使用花生壳免费版
`,l:"blogs/anything/frp.html",a:"使用frp实现内网穿透管理物联网设备-知乎-知乎文章"},"7.0":{t:"> 课代表立正\r",p:"",l:"blogs/anything/gpt.html",a:"课代表立正"},"7.1":{t:"gpt4 目前有代差\r",p:`
技术发展是s型曲线，举例计算机产生有5次
表象差距大 实际背后差距可能更大
数据处理能力、工程能力、用户数正反馈 已经让o ...`,l:"blogs/anything/gpt.html#gpt4-目前有代差",a:"gpt4-目前有代差"},"8.0":{t:"- static关键字\r",p:`
静态变量在以下情况下比较合适：

共享数据：当某个数据需要在类的所有实例之间共享时，静态变量非常有用。例如，一个类代表一个 ...`,l:"blogs/anything/java.html",a:"static关键字"},"9.0":{t:"# Jenkins gitee cicd 配置\r",p:`

安装jenkins镜像 注意使用开源版本
时区变量 -e PHP_TZ=&quot;Asia/Shanghai&quot ...`,l:"blogs/anything/jenkins.html",a:"jenkins-gitee-cicd-配置"},"10.0":{t:"# 联系我\r",p:`
邮箱: yaolinhong1024@gmail.com
github：github link
留言

`,l:"blogs/anything/link-me.html",a:"联系我"},"11.0":{t:"# h1 Heading 8-)\r",p:"",l:"blogs/anything/markdown-demo.html",a:"h1-heading-8"},"11.1":{t:"h2 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h2-heading",a:"h2-heading"},"11.2":{t:"h3 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h3-heading",a:"h3-heading"},"11.3":{t:"h4 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h4-heading",a:"h4-heading"},"11.4":{t:"h5 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h5-heading",a:"h5-heading"},"11.5":{t:"h6 Heading\r",p:`\r
\r`,l:"blogs/anything/markdown-demo.html#h6-heading",a:"h6-heading"},"11.6":{t:"Horizontal Rules\r",p:`


`,l:"blogs/anything/markdown-demo.html#horizontal-rules",a:"horizontal-rules"},"11.7":{t:"Typographic replacements\r",p:`Enable typographer option to see result.
(c) (C) (r) (R) (tm)  ...`,l:"blogs/anything/markdown-demo.html#typographic-replacements",a:"typographic-replacements"},"11.8":{t:"Emphasis\r",p:`This is bold text
This is bold text
This is italic text
This i ...`,l:"blogs/anything/markdown-demo.html#emphasis",a:"emphasis"},"11.9":{t:"Blockquotes\r",p:`
Blockquotes can also be nested...

...by using additional gre ...`,l:"blogs/anything/markdown-demo.html#blockquotes",a:"blockquotes"},"11.10":{t:"Lists\r",p:`Unordered

Create a list by starting a line with +, -, or *
Su ...`,l:"blogs/anything/markdown-demo.html#lists",a:"lists"},"11.11":{t:"Code\r",p:`Inline code
Indented code
// Some comments
line 1 of code
line ...`,l:"blogs/anything/markdown-demo.html#code",a:"code"},"11.12":{t:"Tables\r",p:`


Option
Description




data
path to data files to supply th ...`,l:"blogs/anything/markdown-demo.html#tables",a:"tables"},"11.13":{t:"Links\r",p:`link text
link with title
Autoconverted link https://github.co ...`,l:"blogs/anything/markdown-demo.html#links",a:"links"},"11.14":{t:"Images\r",p:`!Minion
!Stormtroopocat
Like links, Images also have a footnot ...`,l:"blogs/anything/markdown-demo.html#images",a:"images"},"11.15":{t:"Plugins\r",p:"The killer feature of markdown-it is very effective support of ...",l:"blogs/anything/markdown-demo.html#plugins",a:"plugins"},"11.16":{t:"Emojies\r",p:`
Classic markup: :wink: :cry: :laughing: :yum:
Shortcuts (emot ...`,l:"blogs/anything/markdown-demo.html#emojies",a:"emojies"},"11.17":{t:"Subscript / Superscript\r",p:`
19^th^
H~2~O

`,l:"blogs/anything/markdown-demo.html#subscript-superscript",a:"subscript-superscript"},"11.18":{t:"\\<ins>\r",p:`++Inserted text++
`,l:"blogs/anything/markdown-demo.html#ins",a:"ins"},"11.19":{t:"\\<mark>\r",p:`==Marked text==
`,l:"blogs/anything/markdown-demo.html#mark",a:"mark"},"11.20":{t:"Footnotes\r",p:`Footnote 1 link[^first].
Footnote 2 link[^second].
Inline foot ...`,l:"blogs/anything/markdown-demo.html#footnotes",a:"footnotes"},"11.21":{t:"Definition lists\r",p:`Term 1
:   Definition 1
with lazy continuation.
Term 2 withinl ...`,l:"blogs/anything/markdown-demo.html#definition-lists",a:"definition-lists"},"11.22":{t:"Abbreviations\r",p:`This is HTML abbreviation example.
It converts &quot;HTML&quot ...`,l:"blogs/anything/markdown-demo.html#abbreviations",a:"abbreviations"},"11.23":{t:"Custom containers\r",p:`::: warning
here be dragons
:::
`,l:"blogs/anything/markdown-demo.html#custom-containers",a:"custom-containers"},"12.0":{t:"# js中调用c++方法\r",p:"\r",l:"blogs/anything/node-addon.html",a:"js中调用c-方法"},"12.1":{t:"实现方式\r",p:`
使用node addons
node官方的 examples 使用步骤

npm install g node-gyp，对 ...`,l:"blogs/anything/node-addon.html#实现方式",a:"实现方式"},"12.2":{t:"\r",p:`npm install g node-gyp
`,l:"blogs/anything/node-addon.html#",a:""},"13.0":{t:"# api\r",p:`一些优质的官方prompt
https://platform.openai.com/examples


fine-tune ...`,l:"blogs/anything/openai-api.html",a:"api"},"14.0":{t:"- 左耳听风\r",p:`
程序员如何用技术变现


关注有价值的东西 价值取决于供需关系 分清什么是主流技术，什么是过渡式的技术


关注技术付费点 ...`,l:"blogs/anything/reading.html",a:"左耳听风"},"15.0":{t:"分割一切的py\r",p:`图形分割
`,l:"blogs/anything/segment-anything.html",a:"分割一切的py"},"16.0":{t:"Springboot 配置篇\r",p:`!Alt text


多环境配置（点击可以切换环境）
pom.xml
     &lt;profiles&gt;
     ...`,l:"blogs/anything/spring-boot.html",a:"springboot-配置篇"},"17.0":{t:"项目启动\r",p:`
启动依赖安装问题

从pom.xml中看java、maven版本
本机java版本也要与项目要求java版本一致
内网包无 ...`,l:"blogs/anything/spring-cloud.html",a:"项目启动"},"18.0":{t:"# 生成式ai\r",p:"",l:"blogs/anything/生成式ai.html",a:"生成式ai"},"18.1":{t:"多维数据向量存储词性\r",p:"",l:"blogs/anything/生成式ai.html#多维数据向量存储词性",a:"多维数据向量存储词性"},"18.2":{t:"自注意力 \r",p:`避免生成错误
`,l:"blogs/anything/生成式ai.html#自注意力",a:"自注意力"},"19.0":{t:"# 知识库\r",p:`内容导航

Coding / Learning Record 代码 学习记录
Tools 好用的工具
Anything 分享 ...`,l:"blogs/blogs.html",a:"知识库"},"20.0":{t:"# qiankun 子应用更新异常\r",p:`
现象

偶先页面渲染异常 css没加载完全、页面排版混乱


线索第二次进入 没有请求html

`,l:"blogs/bugs/qiankun-update-fail.html",a:"qiankun-子应用更新异常"},"20.1":{t:"其他\r",p:`
js级别的缓存解决方案

不缓存html



`,l:"blogs/bugs/qiankun-update-fail.html#其他",a:"其他"},"21.0":{t:"# backend interview questions\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html",a:"backend-interview-questions"},"21.1":{t:"自定义线程池\r",p:`
核心线程数
最大线程数
工作队列

在一个电商平台的后端系统中，假设我们需要设计一个用于处理订单的自定义线程池。核心线程数 ...`,l:"blogs/coding-learning-record/backend-interview.html#自定义线程池",a:"自定义线程池"},"21.2":{t:"业务场景：\r",p:`
核心业务场景：处理订单请求，包括验证订单信息、扣除库存、生成订单号等。
技术栈：Java后端开发，Spring框架。
核心 ...`,l:"blogs/coding-learning-record/backend-interview.html#业务场景",a:"业务场景"},"21.3":{t:"核心线程数（Core Pool Size）：\r",p:`
业务场景关联：核心线程数应该根据订单的日均请求量和处理时间来确定。对于一个电商平台，订单请求可能会呈现出明显的日周期性波动 ...`,l:"blogs/coding-learning-record/backend-interview.html#核心线程数-core-pool-size",a:"核心线程数-core-pool-size"},"21.4":{t:"最大线程数（Maximum Pool Size）：\r",p:`
业务场景关联：最大线程数应该根据系统的资源限制和预期的最大并发量来确定。在电商平台中，最大线程数的设置应该考虑服务器的CP ...`,l:"blogs/coding-learning-record/backend-interview.html#最大线程数-maximum-pool-size",a:"最大线程数-maximum-pool-size"},"21.5":{t:"工作队列（Work Queue）：\r",p:`
业务场景关联：工作队列用于存储尚未被执行的订单处理任务，应该能够满足高并发请求下的任务排队需求。在电商平台中，可以选择一个 ...`,l:"blogs/coding-learning-record/backend-interview.html#工作队列-work-queue",a:"工作队列-work-queue"},"21.6":{t:"OSI 七层模型是什么样的\r",p:`路由器工作在哪一层？
`,l:"blogs/coding-learning-record/backend-interview.html#osi-七层模型是什么样的",a:"osi-七层模型是什么样的"},"21.7":{t:"TCP 如何保证可靠连接？TCP 如何建立可靠的连接？三次握手的详细过程\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html#tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程",a:"tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程"},"21.8":{t:"Effective Java 要点",p:"",l:"blogs/coding-learning-record/backend-interview.html#effective-java-要点",a:"effective-java-要点"},"22.0":{t:"# 词典实现\r",p:"\r",l:"blogs/coding-learning-record/baiduTranslate.html",a:"词典实现"},"22.1":{t:"需求背景\r",p:`
支持自添加单词的单词本，记录小孩的单词量；
支持分享单词本；家人范围内共享；
常规单词本功能、查词、发音

`,l:"blogs/coding-learning-record/baiduTranslate.html#需求背景",a:"需求背景"},"22.2":{t:"核心功能 - 实现概述\r",p:`
查词

百度翻译api申请 调用
ecdict  社区词典数据库


单词发音 TTS

使用社区免费的tts
使用社区开 ...`,l:"blogs/coding-learning-record/baiduTranslate.html#核心功能-实现概述",a:"核心功能-实现概述"},"23.0":{t:"# 组件设计\r",p:`
避免冗余数据
单一职责（渲染列表 渲染组件）
数据流转清晰
代码逻辑 越少分支越好


`,l:"blogs/coding-learning-record/component-design.html",a:"组件设计"},"24.0":{t:"css踩坑\r",p:`
offsetTop是相对relative的父级 不一定是父元素


定位元素（position属性为relative、ab ...`,l:"blogs/coding-learning-record/css.html",a:"css踩坑"},"25.0":{t:"- depends_on 追加的服务可以在应用内直接映射访问\r",p:`


`,l:"blogs/coding-learning-record/docker-compose.html",a:"depends-on-追加的服务可以在应用内直接映射访问"},"26.0":{t:"# 常用docker操作\r",p:`
docker run build
docker run -i -t -p 3306:3306
&lt;!-- -  --& ...`,l:"blogs/coding-learning-record/docker.html",a:"常用docker操作"},"27.0":{t:"# 长列表大表单性能优化\r",p:"\r",l:"blogs/coding-learning-record/element-ui.html",a:"长列表大表单性能优化"},"27.1":{t:"业务场景\r",p:"vue2 项目 400个表单需要校验。每个表单有20个左右的校验项，多选，单选，input，图片上传组件。总的组件数有上万个 ...",l:"blogs/coding-learning-record/element-ui.html#业务场景",a:"业务场景"},"27.2":{t:"落地选型\r",p:`
虚拟列表路线

不定高度内容，快速滚动会产生高度跳变；虚拟列表滚动，调研中遇到了动态选10个显示 高度跳变的问题。也有解决 ...`,l:"blogs/coding-learning-record/element-ui.html#落地选型",a:"落地选型"},"27.3":{t:"技术难点\r",p:`
简略列表+单个sku表单

整体表单校验；使用nexTick方式，替换数据，循环赋值。
重写校验方法，引入validate ...`,l:"blogs/coding-learning-record/element-ui.html#技术难点",a:"技术难点"},"28.0":{t:"# 前端代码规范\r",p:`
文件名建议全部连字符、否则git大小写有的折腾呢

`,l:"blogs/coding-learning-record/eslint.html",a:"前端代码规范"},"29.0":{t:"# calculator\r",p:`使用flutter构建的计算器demo

若flutter doctor 不通过；使用java8；
anroid-studi ...`,l:"blogs/coding-learning-record/flutter-demo.html",a:"calculator"},"30.0":{t:"# Docker nginx Dockerfile https配置 \r",p:`前置步骤

安装DockerFile
安装DockerCompose
获取ssl证书、sl证书解析配置

`,l:"blogs/coding-learning-record/https.html",a:"docker-nginx-dockerfile-https配置"},"30.1":{t:"步骤\r",p:`
yourServiceName、youdomin替换成你自己的
证书下载 腾讯云

&lt;!-- DockerFile  ...`,l:"blogs/coding-learning-record/https.html#步骤",a:"步骤"},"31.0":{t:"lambda表达式 java\r",p:`        iDsSpaceAreaService.lambdaUpdate()
                .eq ...`,l:"blogs/coding-learning-record/java.html",a:"lambda表达式-java"},"32.0":{t:"# jssip-renegotiaton、FreeSwitch探索\r",p:`&lt;!-- 仓库名称 vue_fs_meeting --&gt;
webrtc
jssip 是一个webrtc的封装库
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html",a:"jssip-renegotiaton、freeswitch探索"},"32.1":{t:"折腾的起因\r",p:`需要帮朋友解决renegotiaton的问题 玩了一下jssip的api
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾的起因",a:"折腾的起因"},"32.2":{t:"jssip\r",p:`关键api

监听renegotiate、reinvite事件
若是直接用浏览器RTC的api replaceTrack替换 ...`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#jssip",a:"jssip"},"32.3":{t:"折腾FreeSwitch\r",p:"\r",l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾freeswitch",a:"折腾freeswitch"},"32.4":{t:"1. 安装\r",p:`windows下 下载msi 一路点安装即可 用管理员方式运行
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_1-安装",a:"_1-安装"},"32.5":{t:"2.wss配置\r",p:`参考博客
并配置nginx之后 启动freeswitch （管理员方式启动）7443的端口；

`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_2-wss配置",a:"_2-wss配置"},"33.0":{t:"# k8s \r",p:`一个开源的容器编排平台
`,l:"blogs/coding-learning-record/k8s.html",a:"k8s"},"33.1":{t:"Kubernetes解决了什么问题:\r",p:`

应用程序部署和管理:

自动化应用程序的部署、扩缩容和滚动更新,减少了手动操作的风险和开销。
支持批量管理和编排多个应用 ...`,l:"blogs/coding-learning-record/k8s.html#kubernetes解决了什么问题",a:"kubernetes解决了什么问题"},"33.2":{t:"container - 容器运行时\r",p:`docker只是其中一种 还有  containerd、CRI-O 等
`,l:"blogs/coding-learning-record/k8s.html#container-容器运行时",a:"container-容器运行时"},"33.3":{t:"部署流程\r",p:`master安装k8s集群模式的包，node节点安装子节点需要的包
配置master、node节点
集群中直接根据配置文件起 ...`,l:"blogs/coding-learning-record/k8s.html#部署流程",a:"部署流程"},"33.4":{t:"主从机器\r",p:`master 集群 node 子节点
`,l:"blogs/coding-learning-record/k8s.html#主从机器",a:"主从机器"},"33.5":{t:"pod container\r",p:`Pod是Kubernetes中最小的可部署单元,它包含一个或多个container。
Pod中的所有container共享相 ...`,l:"blogs/coding-learning-record/k8s.html#pod-container",a:"pod-container"},"34.0":{t:"# mysql\r",p:"\r",l:"blogs/coding-learning-record/mysql.html",a:"mysql"},"34.1":{t:"默认引擎\r",p:`
InnoDB
MyISAM

InnoDB 和 MyISAM 是 MySQL 数据库中的两个存储引擎，它们在功能和性能上有 ...`,l:"blogs/coding-learning-record/mysql.html#默认引擎",a:"默认引擎"},"34.2":{t:"关闭mysql的strict mode\r",p:`注释掉 my.ini中的
# Set the SQL mode to strict
# sql-mode=&quot;STR ...`,l:"blogs/coding-learning-record/mysql.html#关闭mysql的strict-mode",a:"关闭mysql的strict-mode"},"34.3":{t:"总结 \r",p:`

join
inner join 交集
left join right join 左右其中一张的全表 加上选集
cross ...`,l:"blogs/coding-learning-record/mysql.html#总结",a:"总结"},"34.4":{t:"做题内容\r",p:`select name,score
from student
where name not like '%李%'
-- 请在 ...`,l:"blogs/coding-learning-record/mysql.html#做题内容",a:"做题内容"},"34.5":{t:"总结难点 \r",p:`join
inner join 交集
left join right join 左右其中一张的全表 加上选集
cross j ...`,l:"blogs/coding-learning-record/mysql.html#总结难点",a:"总结难点"},"35.0":{t:"# Nacos\r",p:`服务治理
heimashangcheng
docker启动
`,l:"blogs/coding-learning-record/nacos.html",a:"nacos"},"36.0":{t:"位运算\r",p:`https://poe.com/s/8e38IAssLMHBMCW3oRgp 优点
效率高：位运算是对二进制位的直接操作，比 ...`,l:"blogs/coding-learning-record/new-knowledge.html",a:"位运算"},"36.1":{t:"消除异步传染性\r",p:`需要在catch里面做逻辑处理

场景


如任意api 全局自动前端刷新token
react suspense

`,l:"blogs/coding-learning-record/new-knowledge.html#消除异步传染性",a:"消除异步传染性"},"36.2":{t:"非对称加密\r",p:`
rsa 公钥私钥配对
https中的加密 为啥需要证书？

`,l:"blogs/coding-learning-record/new-knowledge.html#非对称加密",a:"非对称加密"},"36.3":{t:"VO 、 DTO\r",p:`DTO（Data Transfer Object）和VO（Value Object）都是用于在系统之间传输数据的对象。
`,l:"blogs/coding-learning-record/new-knowledge.html#vo-、-dto",a:"vo-、-dto"},"37.0":{t:"# next.js \r",p:"\r",l:"blogs/coding-learning-record/next-js.html",a:"next-js"},"37.1":{t:"项目脚手架\r",p:`next-sse
体验一下国际服玩家的利器next.js

api
声明式router

`,l:"blogs/coding-learning-record/next-js.html#项目脚手架",a:"项目脚手架"},"37.2":{t:"sse功能开发\r",p:`
群聊实现demo
打字机推送效果

`,l:"blogs/coding-learning-record/next-js.html#sse功能开发",a:"sse功能开发"},"38.0":{t:"#  WPS、Office插件开发\r",p:"",l:"blogs/coding-learning-record/office-dev.html",a:"wps、office插件开发"},"38.1":{t:"技术选型\r",p:`

JS Api

高度可移植性：可以跨平台使用，支持Windows、Mac、iOS、Android等多个操作系统和设备。
 ...`,l:"blogs/coding-learning-record/office-dev.html#技术选型",a:"技术选型"},"38.2":{t:"面板配置\r",p:`ribbon配置

&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF- ...`,l:"blogs/coding-learning-record/office-dev.html#面板配置",a:"面板配置"},"38.3":{t:"业务开发\r",p:`&lt;!-- TODO --&gt;

`,l:"blogs/coding-learning-record/office-dev.html#业务开发",a:"业务开发"},"38.4":{t:"clickOne部署\r",p:`
clickOne部署自动更新



优点：
安装之后，更新服务器资源后
用户端每次重启word均会拉取最新版本word

 ...`,l:"blogs/coding-learning-record/office-dev.html#clickone部署",a:"clickone部署"},"38.5":{t:"构建兼容WPS、word的插件安装包\r",p:`
Advance installer
InnoSetup


好处:


安装可配置注册表、依赖项
一套代码、打包后一次性安 ...`,l:"blogs/coding-learning-record/office-dev.html#构建兼容wps、word的插件安装包",a:"构建兼容wps、word的插件安装包"},"38.6":{t:" ",p:"",l:"blogs/coding-learning-record/office-dev.html#",a:""},"38.7":{t:"插件效果\r",p:`


word插件
wps插件




&lt;img src=&quot;https://github.com/yaoli ...`,l:"blogs/coding-learning-record/office-dev.html#插件效果",a:"插件效果"},"38.8":{t:"过程中坑: \r",p:`
office文档机翻、社区参考资料少

`,l:"blogs/coding-learning-record/office-dev.html#过程中坑",a:"过程中坑"},"39.0":{t:"两行代码 运行LLM\r",p:`\r
\r`,l:"blogs/coding-learning-record/ollama.html",a:"两行代码-运行llm"},"39.1":{t:"项目\r",p:`ollama
`,l:"blogs/coding-learning-record/ollama.html#项目",a:"项目"},"39.2":{t:"运行\r",p:`win11 wsl Ubuntu22
curl -fsSL https://ollama.com/install.sh |  ...`,l:"blogs/coding-learning-record/ollama.html#运行",a:"运行"},"40.0":{t:"# onlyoffice\r",p:"\r",l:"blogs/coding-learning-record/onlyoffice.html",a:"onlyoffice"},"40.1":{t:"服务端渲染docx\r",p:`
文件服务 给onlyoffice editing服务提供文件 给对应加密信息
业务服务端 调用documentBuilde ...`,l:"blogs/coding-learning-record/onlyoffice.html#服务端渲染docx",a:"服务端渲染docx"},"40.2":{t:"接入cdn文件渲染\r",p:`
修改初始化中给onlyoffice服务的地址换成cdn url即可
修改callbackurl中持久化的操作 改为文件整体 ...`,l:"blogs/coding-learning-record/onlyoffice.html#接入cdn文件渲染",a:"接入cdn文件渲染"},"40.3":{t:"替换web-app 增加额外的js\r",p:`把构建好的web-app包 -v到docker内即可
`,l:"blogs/coding-learning-record/onlyoffice.html#替换web-app-增加额外的js",a:"替换web-app-增加额外的js"},"42.0":{t:"# 打包你的js sdk\r",p:`场景： 需要二次封装一个js库 输出一个自己的库
&lt;!-- 安装依赖 --&gt;
pnpm add webpack  ...`,l:"blogs/coding-learning-record/package-sdk.html",a:"打包你的js-sdk"},"43.0":{t:"# qiankun 源码解析\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html",a:"qiankun-源码解析"},"43.1":{t:"css隔离\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#css隔离",a:"css隔离"},"43.2":{t:"js隔离\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#js隔离",a:"js隔离"},"43.3":{t:"子应用加载方式\r",p:"无界获取子应用的脚本采用的是qiankun的import-html-entry方案，这个方案是通过正则表达式将 子应用的 h ...",l:"blogs/coding-learning-record/qiankun.html#子应用加载方式",a:"子应用加载方式"},"43.4":{t:"乾坤子应用keepalive\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#乾坤子应用keepalive",a:"乾坤子应用keepalive"},"43.5":{t:"缓存场景下 css加载404异常捕捉不到的问题\r",p:`思路： debug 进一步定位抛错位置 尝试捕获到之后重试
`,l:"blogs/coding-learning-record/qiankun.html#缓存场景下-css加载404异常捕捉不到的问题",a:"缓存场景下-css加载404异常捕捉不到的问题"},"43.6":{t:"状态管理\r",p:`qiankun 提供了集中式的状态管理方案，它通过 props 和全局状态对象来实现子应用之间的通信和状态共享。
singl ...`,l:"blogs/coding-learning-record/qiankun.html#状态管理",a:"状态管理"},"44.0":{t:"# 润词典\r",p:`
[!TIP]
旨在陪伴kids
私有单词库
科学review
互动式学英语
场景例句巩固

`,l:"blogs/coding-learning-record/rdic.html",a:"润词典"},"44.1":{t:"进度汇总\r",p:`&lt;!-- 1. 2023年12月2日21点49分   --&gt;
单词本下面增加分类


后端

新增分类接口
分类 ...`,l:"blogs/coding-learning-record/rdic.html#进度汇总",a:"进度汇总"},"44.2":{t:"项目介绍\r",p:`
v0.0.1
查询词典、发音
加入分享、私有单词库（默认所有人可以编辑）
分享编辑单词库

`,l:"blogs/coding-learning-record/rdic.html#项目介绍",a:"项目介绍"},"44.3":{t:"接口\r",p:"",l:"blogs/coding-learning-record/rdic.html#接口",a:"接口"},"44.4":{t:"添加单词本\r",p:`注意isDelete字段 数据库需要设置默认值0 然后需要添加
@TableLogic
private Integer is ...`,l:"blogs/coding-learning-record/rdic.html#添加单词本",a:"添加单词本"},"44.5":{t:"私有单词本内-单词分页查询\r",p:`使用mybatis page获取 第一个参数默认传分页参数
第一个参数传分页参数
    /**
     * 根据 id  ...`,l:"blogs/coding-learning-record/rdic.html#私有单词本内-单词分页查询",a:"私有单词本内-单词分页查询"},"44.6":{t:" 接口实现\r",p:"    &lt;select id=&quot;getDictionariesByWorkbookId&quot; resu ...",l:"blogs/coding-learning-record/rdic.html#接口实现",a:"接口实现"},"45.0":{t:"# reactNative\r",p:"\r",l:"blogs/coding-learning-record/reactNative-start.html",a:"reactnative"},"45.1":{t:"rn 和 flutter对比  \r",p:`
rn 大厂使用比较多 flutter 中小厂使用比较多
flutter 增长趋势较好
rn 社区活跃度较高 js技术栈
总 ...`,l:"blogs/coding-learning-record/reactNative-start.html#rn-和-flutter对比",a:"rn-和-flutter对比"},"45.2":{t:"reactNative安装  \r",p:`powershell管理员执行
Set-ExecutionPolicy Bypass -Scope Process -For ...`,l:"blogs/coding-learning-record/reactNative-start.html#reactnative安装",a:"reactnative安装"},"46.0":{t:"按照官网文档部署即可\r",p:`npx react-native doctor


sdk 设置系统环境变量 sdk 、platform tools、com ...`,l:"blogs/coding-learning-record/reactNative.html",a:"按照官网文档部署即可"},"47.0":{t:"# java版本管理 \r",p:"\r",l:"blogs/coding-learning-record/sdk-manage.html",a:"java版本管理"},"47.1":{t:"idea\r",p:`比较方便 有界面操作
`,l:"blogs/coding-learning-record/sdk-manage.html#idea",a:"idea"},"47.2":{t:"本地环境java版本\r",p:`jabba install openjdk@1.17.0
jabba install openjdk@1.11.0
jabb ...`,l:"blogs/coding-learning-record/sdk-manage.html#本地环境java版本",a:"本地环境java版本"},"48.0":{t:"# shared-worker\r",p:"\r",l:"blogs/coding-learning-record/shared-worker.html",a:"shared-worker"},"48.1":{t:"shared-worker-demo\r",p:`git仓库 / 在线 demo
功能：多个不同tab页面之间数据交互
落地场景：


electron render进程之间 ...`,l:"blogs/coding-learning-record/shared-worker.html#shared-worker-demo",a:"shared-worker-demo"},"48.2":{t:"参考资料\r",p:`mdn demo
`,l:"blogs/coding-learning-record/shared-worker.html#参考资料",a:"参考资料"},"49.0":{t:"# 苍穹外卖\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html",a:"苍穹外卖"},"49.1":{t:"SSM实践\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#ssm实践",a:"ssm实践"},"49.2":{t:"pojo 数据库实体 dto entity vo\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#pojo-数据库实体-dto-entity-vo",a:"pojo-数据库实体-dto-entity-vo"},"49.3":{t:"common 全局异常处理 通用包装类等\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#common-全局异常处理-通用包装类等",a:"common-全局异常处理-通用包装类等"},"49.4":{t:"server 项目主体\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#server-项目主体",a:"server-项目主体"},"49.5":{t:"AutoFill注解\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#autofill注解",a:"autofill注解"},"49.6":{t:"mybatis插件\r",p:`mybatisX 安装之后 设置schema 有代码提示

其他功能

官网文档




后端的代码 写起来好丝滑

`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis插件",a:"mybatis插件"},"49.7":{t:"entity中的 @Builder注解\r",p:`/**

@Builder 注解 构建器
用于创建对象
如实现类中
Employee employee = Employee ...`,l:"blogs/coding-learning-record/sky-take-out.html#entity中的-builder注解",a:"entity中的-builder注解"},"49.8":{t:"mybatis 配置\r",p:`update动态sql
    &lt;update id=&quot;update&quot; parameterType ...`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis-配置",a:"mybatis-配置"},"50.0":{t:"type-challenges",p:"",l:"blogs/coding-learning-record/typescript.html",a:"type-challenges"},"51.0":{t:"组件二次封装\r",p:`hooks
坑

onMounted问题解决
全局样式覆盖

`,l:"blogs/coding-learning-record/vue-ui-component.html",a:"组件二次封装"},"52.0":{t:"keep alive\r",p:`
实现原理
微前端场景下如何服用子Vue实例的component
嵌套路由场景下 keep alive的问题

解决方案

 ...`,l:"blogs/coding-learning-record/vue3.html",a:"keep-alive"},"52.1":{t:"nextTick\r",p:`

一定能获取到更新之后的DOM吗

结论： 调用nextTick之前的同步任务，微任务队列排在nextTick之前的都能获 ...`,l:"blogs/coding-learning-record/vue3.html#nexttick",a:"nexttick"},"52.2":{t:" ",p:"",l:"blogs/coding-learning-record/vue3.html#",a:""},"52.3":{t:"forceUpdate -->\r",p:`&lt;!-- 在 --&gt;
`,l:"blogs/coding-learning-record/vue3.html#forceupdate",a:"forceupdate"},"52.4":{t:"unref 和 toRaw 有什么区别\r",p:`以下是自己测试之后的总结
unref是获取引用值 但并不会递归获取
toRaw是获取响应式对象的原始对象 会递归解开prox ...`,l:"blogs/coding-learning-record/vue3.html#unref-和-toraw-有什么区别",a:"unref-和-toraw-有什么区别"},"53.0":{t:"<!--\r",p:`
@Author: yaolinhong yaolinhong1024@gmail.com
@Date: 2023-09-2 ...`,l:"blogs/coding-learning-record/web3d.html",a:""},"53.1":{t:"three.js\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#three-js",a:"three-js"},"53.2":{t:"迭代日志\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#迭代日志",a:"迭代日志"},"53.3":{t:"2023-11-20\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-11-20",a:"_2023-11-20"},"53.4":{t:"Add\r",p:`feat: 模型压缩调研 gltf-transform
gltf-transform optimize ./revit.gl ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"53.5":{t:"压缩方式基本原理\r",p:`

减少模型的多边形数量：多边形数量越多，模型的复杂度和文件大小就会增加。你可以使用3D建模软件，如Blender或Maya ...`,l:"blogs/coding-learning-record/web3d.html#压缩方式基本原理",a:"压缩方式基本原理"},"53.6":{t:"2023-07-23\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-07-23",a:"_2023-07-23"},"53.7":{t:"Add\r",p:`feat: revit模型渲染 mvp
预览 |
仓库地址
&lt;!-- 安装revit https://mp.weixi ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"53.8":{t:"2023-06-15\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#_2023-06-15",a:"_2023-06-15"},"53.9":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.10":{t:"Removed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#removed",a:"removed"},"53.11":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.12":{t:"Add -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"53.13":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.14":{t:"Fixed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#fixed",a:"fixed"},"53.15":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"53.16":{t:"Changed -->\r",p:"",l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"53.17":{t:"Changed\r",p:`我的three.js训练场

feat: 🎸 Metaverse游戏 按住空格 加速跑动 2023-06-15

`,l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"53.18":{t:"learn webgpu\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#learn-webgpu",a:"learn-webgpu"},"53.19":{t:"why learn\r",p:`贴一个吗目标公司岗位的jd；

某目标公司
webGL开发岗位职责:
开发和维护用于Web端设计工具的高性能图形系统，包括： ...`,l:"blogs/coding-learning-record/web3d.html#why-learn",a:"why-learn"},"53.20":{t:"learn what\r",p:`抽象几个关键的技术要素
WebGL API Web图形领域 CPU和GPU的性能优化方法；

熟练掌握基本的线性代数、几何、 ...`,l:"blogs/coding-learning-record/web3d.html#learn-what",a:"learn-what"},"53.21":{t:"how to learn\r",p:`主要目标

有业余开源项目供技术参考（找相关开源项目）
找webGL下的问题场景，直接解决相关的问题，提供commit

过 ...`,l:"blogs/coding-learning-record/web3d.html#how-to-learn",a:"how-to-learn"},"53.22":{t:"一些思考\r",p:"",l:"blogs/coding-learning-record/web3d.html#一些思考",a:"一些思考"},"53.23":{t:"什么场景需要web 3d\r",p:`最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现，一看是直接放的video；

对于需要seo的页面来说，或许b ...`,l:"blogs/coding-learning-record/web3d.html#什么场景需要web-3d",a:"什么场景需要web-3d"},"54.0":{t:"# 微信相关业务逻辑\r",p:"\r",l:"blogs/coding-learning-record/wechat.html",a:"微信相关业务逻辑"},"54.1":{t:"微信公众号登陆\r",p:`!alt text

订阅号无法开通此接口
服务号必须通过微信认证

`,l:"blogs/coding-learning-record/wechat.html#微信公众号登陆",a:"微信公众号登陆"},"54.2":{t:"微信支付\r",p:`坑

native支付并不能用网站引用的appid申请

必须将微信支付id 绑定服务号或者订阅号的微信公众号id 才可以开 ...`,l:"blogs/coding-learning-record/wechat.html#微信支付",a:"微信支付"},"55.0":{t:"api开放平台\r",p:"",l:"blogs/coding-learning-record/yupi-learning-record.html",a:"api开放平台"},"55.1":{t:"gateway 模块 需要单独打开项目\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#gateway-模块-需要单独打开项目",a:"gateway-模块-需要单独打开项目"},"55.2":{t:"todo 整合到主项目启动\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#todo-整合到主项目启动",a:"todo-整合到主项目启动"},"55.3":{t:"mysql 执行sql插入报错 not null的字段没有写入 补充该字段\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#mysql-执行sql插入报错-not-null的字段没有写入-补充该字段",a:"mysql-执行sql插入报错-not-null的字段没有写入-补充该字段"},"55.4":{t:"注册接口的逻辑\r",p:`synchronized 关键字

加锁和释放锁 无论方法正常执行完毕还是抛出异常，都会释放锁
一把锁只能同时被一个线程获取 ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#注册接口的逻辑",a:"注册接口的逻辑"},"55.5":{t:"YuApiClient 调用接口上线报错\r",p:`原因 gateway挂了 远程调用失败
`,l:"blogs/coding-learning-record/yupi-learning-record.html#yuapiclient-调用接口上线报错",a:"yuapiclient-调用接口上线报错"},"55.6":{t:"invoke 报错\r",p:`
{
  &quot;code&quot;: 50000,
  &quot;data&quot;: null,
  &quo ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#invoke-报错",a:"invoke-报错"},"56.0":{t:"# coding plan\r",p:`* 沉淀代码资产，不限于工具库、ui库
* 重视输出；
    * 少些demo项目 多些深入探索 
    * 要有产出成 ...`,l:"blogs/fe-sumary/2024-coding-plan.html",a:"coding-plan"},"57.0":{t:"2023 总结\r",p:"\r",l:"blogs/fe-sumary/2024-plan.html",a:"_2023-总结"},"57.1":{t:"这一年，我取得了一些不错的成绩。\r",p:`

技术钻研：

服务端渲染应用落地、docker compose部署、二开
用react的 useDapp 发布了自己的w ...`,l:"blogs/fe-sumary/2024-plan.html#这一年-我取得了一些不错的成绩。",a:"这一年-我取得了一些不错的成绩。"},"57.2":{t:" 当然，也有一些需要提升的地方。\r",p:`

任务管理：

目标管理意识较差、严格工时评估的能力差，需求评审不够严谨
松散的目标意识，如saas中，错误估计整体提测时 ...`,l:"blogs/fe-sumary/2024-plan.html#当然-也有一些需要提升的地方。",a:"当然-也有一些需要提升的地方。"},"57.3":{t:"朋友们的反馈和建议\r",p:`这里只挑点缺点讲
a: 有时候会眼高手低，得下场多做
b: 需求做的糙 思路是正确、效率也ok 但得深入点细节和产品、测试对 ...`,l:"blogs/fe-sumary/2024-plan.html#朋友们的反馈和建议",a:"朋友们的反馈和建议"},"57.4":{t:"新的一年的计划：\r",p:`
持续长跑 按季度复盘

娱乐消遣控制在每周2天左右
学习打卡 每周至少3天  时间不限 需要有学习产出的记录（笔记、代码库 ...`,l:"blogs/fe-sumary/2024-plan.html#新的一年的计划",a:"新的一年的计划"},"58.0":{t:"# 上上份工作难点\r",p:"\r",l:"blogs/fe-sumary/qd-fe.html",a:"上上份工作难点"},"58.1":{t:"等保三级处理（国家级）\r",p:"",l:"blogs/fe-sumary/qd-fe.html#等保三级处理-国家级",a:"等保三级处理-国家级"},"58.2":{t:"onlyoffice项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#onlyoffice项目",a:"onlyoffice项目"},"58.3":{t:"c# webview word插件项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#c-webview-word插件项目",a:"c-webview-word插件项目"},"58.4":{t:"小程序项目 \r",p:"",l:"blogs/fe-sumary/qd-fe.html#小程序项目",a:"小程序项目"},"58.5":{t:"websocket im优化 （前端消息确认）\r",p:`



Description




背景



难点



选型
sse、轮询、ws？


落地



总结




`,l:"blogs/fe-sumary/qd-fe.html#websocket-im优化-前端消息确认",a:"websocket-im优化-前端消息确认"},"58.6":{t:"jssip 实时音频交互处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#jssip-实时音频交互处理",a:"jssip-实时音频交互处理"},"58.7":{t:"trtc 视频流处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#trtc-视频流处理",a:"trtc-视频流处理"},"58.8":{t:"electron项目",p:"",l:"blogs/fe-sumary/qd-fe.html#electron项目",a:"electron项目"},"59.0":{t:"# 最近一份工作的难点\r",p:"\r",l:"blogs/fe-sumary/xz-fe.html",a:"最近一份工作的难点"},"59.1":{t:"seo、服务端渲染\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#seo、服务端渲染",a:"seo、服务端渲染"},"59.2":{t:"微前端\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#微前端",a:"微前端"},"59.3":{t:"虚拟列表 性能优化\r",p:`
列表方案
不定高度？（从下往上滑动 页面抖动、删除节点页面跳动）

复杂业务代码改造，（item 处理为计算属性）
一些个 ...`,l:"blogs/fe-sumary/xz-fe.html#虚拟列表-性能优化",a:"虚拟列表-性能优化"},"59.4":{t:"动画、多页面响应式适配、i18n\r",p:`

动态rem；


所有图片加载完成之后进入页面
i18n


总结： rem有局限性吗？ TODO
`,l:"blogs/fe-sumary/xz-fe.html#动画、多页面响应式适配、i18n",a:"动画、多页面响应式适配、i18n"},"59.5":{t:"小程序路由权限校验\r",p:`

首页路由切换闪烁


公共组件库处理 二次封装组件；支持透传slot attrs props等（原生组件有坑）


`,l:"blogs/fe-sumary/xz-fe.html#小程序路由权限校验",a:"小程序路由权限校验"},"59.6":{t:"weboffice定制功能\r",p:`
只允许排版功能


iframe 限制

electron

太生硬 用户接受程度


chrome插件

分发问题 -  ...`,l:"blogs/fe-sumary/xz-fe.html#weboffice定制功能",a:"weboffice定制功能"},"60.0":{t:"# 博客系统推荐\r",p:`面向前端同学：
可以使用默认布局 可基于vue扩展
vitepress vue-theme-hope
SEO友好、框架无关
 ...`,l:"blogs/tools/blog-dev.html",a:"博客系统推荐"},"61.0":{t:"# 使用linux命令\r",p:`&lt;!-- node程序的进程 --&gt;
ps -ef | grep node
&lt;!-- 解压到当前文件夹 - ...`,l:"blogs/tools/linux.html",a:"使用linux命令"},"62.0":{t:"# postman 快速导入swagger接口",p:"",l:"blogs/tools/postman.html",a:"postman-快速导入swagger接口"},"64.0":{t:"#  https://gitee.com/ylh1995/Blog/pages",p:"",l:"readme.html",a:"https-gitee-com-ylh1995-blog-pages"}},t={previewLength:62,buttonLabel:"Search",placeholder:"Search docs",allow:[],ignore:[]},o={INDEX_DATA:e,PREVIEW_LOOKUP:n,Options:t};export{o as default};
