const e={map:'[{"runtime":["0.0"],"results":["0.1","0.5"],"theme":["0.2","0.6"],"page":["0.3","0.4","0.7","0.8"],"more":["0.9"],"两行代码":["1.0"],"项目":["1.1"],"运行":["1.2"],"stable":["2.0"],"原理":["3.0"],"加密":["3.1"],"哈希":["3.2"],"共识算法":["3.3"],"基于共识的智能合约":["3.4"],"跨境电商":["4.0"],"linux":["5.0"],"coding":["6.0","57.0"],"life":["6.1"],"测试环境表结构同步到生产环境":["7.0"],"使用frp实现内网穿透管理物联网设备":["8.0"],"课代表立正":["9.0"],"gpt4":["9.1"],"static关键字":["10.0"],"jenkins":["11.0"],"联系我":["12.0"],"h1":["13.0"],"h2":["13.1"],"h3":["13.2"],"h4":["13.3"],"h5":["13.4"],"h6":["13.5"],"horizontal":["13.6"],"typographic":["13.7"],"emphasis":["13.8"],"blockquotes":["13.9"],"lists":["13.10"],"code":["13.11"],"tables":["13.12"],"links":["13.13"],"images":["13.14"],"plugins":["13.15"],"emojies":["13.16"],"subscript":["13.17"],"ins":["13.18"],"mark":["13.19"],"footnotes":["13.20"],"definition":["13.21"],"abbreviations":["13.22"],"custom":["13.23"],"js中调用c":["14.0"],"实现方式":["14.1"],"api":["15.0"],"左耳听风":["16.0"],"分割一切的py":["17.0"],"springboot":["18.0"],"项目启动":["19.0"],"生成式ai":["20.0"],"多维数据向量存储词性":["20.1"],"自注意力":["20.2"],"知识库":["21.0"],"qiankun":["22.0","44.0"],"其他":["22.1"],"backend":["23.0"],"自定义线程池":["23.1"],"业务场景":["23.2","29.1"],"核心线程数":["23.3"],"最大线程数":["23.4"],"工作队列":["23.5"],"osi":["23.6"],"tcp":["23.7"],"effective":["23.8"],"词典实现":["24.0"],"需求背景":["24.1"],"核心功能":["24.2"],"组件设计":["25.0"],"css踩坑":["26.0"],"depends":["27.0"],"常用docker操作":["28.0"],"长列表大表单性能优化":["29.0"],"落地选型":["29.2"],"技术难点":["29.3"],"前端代码规范":["30.0"],"calculator":["31.0"],"docker":["32.0"],"步骤":["32.1"],"lambda表达式":["33.0"],"jssip":["34.0","34.2","59.6"],"折腾的起因":["34.1"],"折腾freeswitch":["34.3"],"k8s":["35.0"],"kubernetes解决了什么问题":["35.1"],"container":["35.2"],"部署流程":["35.3"],"主从机器":["35.4"],"pod":["35.5"],"mysql":["36.0","56.3"],"默认引擎":["36.1"],"关闭mysql的strict":["36.2"],"总结":["36.3"],"做题内容":["36.4"],"总结难点":["36.5"],"nacos":["37.0"],"位运算":["38.0"],"消除异步传染性":["38.1"],"非对称加密":["38.2"],"vo":["38.3"],"next":["39.0"],"项目脚手架":["39.1"],"sse功能开发":["39.2"],"wps":["40.0"],"技术选型":["40.1"],"面板配置":["40.2"],"业务开发":["40.3"],"clickone部署":["40.4"],"构建兼容wps":["40.5"],"插件效果":["40.7"],"过程中坑":["40.8"],"onlyoffice":["41.0"],"服务端渲染docx":["41.1"],"接入cdn文件渲染":["41.2"],"替换web":["41.3"],"打包你的js":["43.0"],"css隔离":["44.1"],"js隔离":["44.2"],"子应用加载方式":["44.3"],"乾坤子应用keepalive":["44.4"],"缓存场景下":["44.5"],"状态管理":["44.6"],"润词典":["45.0"],"进度汇总":["45.1"],"项目介绍":["45.2"],"接口":["45.3"],"添加单词本":["45.4"],"私有单词本内":["45.5"],"接口实现":["45.6"],"reactnative":["46.0"],"rn":["46.1"],"reactnative安装":["46.2"],"按照官网文档部署即可":["47.0"],"java版本管理":["48.0"],"idea":["48.1"],"本地环境java版本":["48.2"],"shared":["49.0","49.1"],"参考资料":["49.2"],"苍穹外卖":["50.0"],"ssm实践":["50.1"],"pojo":["50.2"],"common":["50.3"],"server":["50.4"],"autofill注解":["50.5"],"mybatis插件":["50.6"],"entity中的":["50.7"],"mybatis":["50.8"],"type":["51.0"],"组件二次封装":["52.0"],"keep":["53.0"],"nexttick":["53.1"],"forceupdate":["53.3"],"unref":["53.4"],"three":["54.1"],"迭代日志":["54.2"],"add":["54.4","54.7","54.12"],"压缩方式基本原理":["54.5"],"removed":["54.10"],"fixed":["54.14"],"changed":["54.16","54.17"],"learn":["54.18","54.20"],"why":["54.19"],"how":["54.21"],"一些思考":["54.22"],"什么场景需要web":["54.23"],"微信相关业务逻辑":["55.0"],"微信公众号登陆":["55.1"],"微信支付":["55.2"],"api开放平台":["56.0"],"gateway":["56.1"],"todo":["56.2"],"注册接口的逻辑":["56.4"],"yuapiclient":["56.5"],"invoke":["56.6"],"这一年":["58.1"],"当然":["58.2"],"朋友们的反馈和建议":["58.3"],"新的一年的计划":["58.4"],"上上份工作难点":["59.0"],"等保三级处理":["59.1"],"onlyoffice项目":["59.2"],"c":["59.3"],"小程序项目":["59.4"],"websocket":["59.5"],"trtc":["59.7"],"electron项目":["59.8"],"最近一份工作的难点":["60.0"],"seo":["60.1"],"微前端":["60.2"],"虚拟列表":["60.3"],"动画":["60.4"],"小程序路由权限校验":["60.5"],"weboffice定制功能":["60.6"],"博客系统推荐":["61.0"],"使用linux命令":["62.0"],"postman":["63.0"],"https":["65.0"]},{"0":["19.0","40.2"],"1":["13.20","13.21","18.0","19.0","23.1","26.0","29.2","31.0","34.2","34.4","35.1","36.4","39.2","40.1","40.2","40.4","40.5","40.8","45.1","54.5","60.2"],"2":["19.0","34.5","36.4","45.1"],"3":["19.0","36.4"],"4":["19.0"],"8":["19.0","40.2"],"10":["19.0"],"11":["19.0"],"18":["19.0"],"20":["36.4"],"60":["36.4"],"500":["36.4"],"609":["19.0"],"802":["19.0"],"2023":["54.3","54.6","54.8","58.0"],"43708":["19.0"],"50000":["56.6"],"10781466":["19.0"],"api":["0.0","40.1"],"examples":["0.0"],"this":["0.0","13.8","13.22"],"page":["0.0"],"demonstrates":["0.0"],"data":["0.2","0.3","0.6","0.7","13.12","19.0","56.6"],"frontmatter":["0.4","0.8"],"check":["0.9"],"运行llm":["1.0"],"ollama":["1.1"],"win11":["1.2"],"wsl":["1.2"],"ubuntu22":["1.2"],"diffusion":["2.0"],"ui实操":["2.0"],"数字签名":["3.1"],"默克尔树":["3.2"],"solidty":["3.4"],"明通":["4.0"],"设置sh定时任务":["5.0"],"打开定时任务脚本列表":["5.0"],"user":["6.0"],"can":["6.1","13.9"],"dump":["7.0"],"知乎":["8.0"],"目前有代差":["9.1"],"技术发展是s型曲线":["9.1"],"举例计算机产生有5次":["9.1"],"表象差距大":["9.1"],"静态变量在以下情况下比较合适":["10.0"],"共享数据":["10.0"],"当某个数据需要在类的所有实例之间共享时":["10.0"],"gitee":["11.0","65.0"],"cicd":["11.0"],"配置":["11.0","50.8"],"安装jenkins镜像":["11.0"],"邮箱":["12.0"],"heading":["13.0","13.1","13.2","13.3","13.4","13.5"],"rules":["13.6"],"replacements":["13.7"],"enable":["13.7"],"typographer":["13.7"],"is":["13.8","13.22","19.0"],"unordered":["13.10"],"create":["13.10"],"a":["13.10","19.0"],"list":["13.10","19.0"],"by":["13.10","19.0","36.4"],"starting":["13.10"],"line":["13.10"],"with":["13.10"],"or":["13.10","36.4"],"inline":["13.11"],"indented":["13.11"],"option":["13.12"],"description":["13.12","60.1","60.2"],"path":["13.12"],"to":["13.12","19.0","54.21"],"files":["13.12"],"supply":["13.12"],"link":["13.13","13.20"],"text":["13.13","18.0"],"minion":["13.14"],"stormtroopocat":["13.14"],"like":["13.14","36.4"],"links":["13.14"],"the":["13.15","19.0"],"classic":["13.16"],"markup":["13.16"],"superscript":["13.17"],"inserted":["13.18"],"marked":["13.19"],"footnote":["13.20"],"lists":["13.21"],"term":["13.21"],"html":["13.22","32.1"],"containers":["13.23"],"方法":["14.0"],"使用node":["14.1"],"addons":["14.1"],"node官方的":["14.1"],"npm":["14.2"],"一些优质的官方prompt":["15.0"],"https":["15.0","19.0","38.0","40.7"],"程序员如何用技术变现":["16.0"],"关注有价值的东西":["16.0"],"价值取决于供需关系":["16.0"],"分清什么是主流技术":["16.0"],"什么是过渡式的技术":["16.0"],"图形分割":["17.0"],"配置篇":["18.0"],"alt":["18.0","55.1"],"多环境配置":["18.0"],"点击可以切换环境":["18.0"],"pom":["18.0"],"xml":["18.0","19.0","40.2","45.6","50.8"],"启动依赖安装问题":["19.0"],"从pom":["19.0"],"xml中看java":["19.0"],"maven版本":["19.0"],"本机java版本也要与项目要求java版本一致":["19.0"],"内网包无法拉到":["19.0"],"需要配置maven私有仓库":["19.0"],"todo":["19.0","40.3"],"解决私有仓库配置":["19.0"],"pre":["19.0"],"class":["19.0","36.4"],"console":["19.0"],"output":["19.0"],"started":["19.0"],"timer":["19.0"],"running":["19.0"],"as":["19.0"],"system":["19.0","46.2"],"building":["19.0"],"in":["19.0"],"workspace":["19.0"],"jenkins":["19.0"],"test2":["19.0"],"xizhao":["19.0"],"java":["19.0","23.8","33.0","45.5"],"ins":["19.0"],"recommended":["19.0"],"git":["19.0"],"tool":["19.0"],"none":["19.0"],"using":["19.0"],"credential":["19.0"],"5bc2":["19.0"],"4ab2":["19.0"],"90da":["19.0"],"91285e13c47a":["19.0"],"gt":["19.0"],"rev":["19.0"],"parse":["19.0"],"resolve":["19.0"],"dir":["19.0"],"timeout":["19.0"],"fetching":["19.0"],"changes":["19.0"],"from":["19.0","32.1","36.4"],"remote":["19.0"],"repository":["19.0"],"config":["19.0"],"origin":["19.0"],"url":["19.0"],"href":["19.0"],"http":["19.0"],"gitlab":["19.0"],"raritag":["19.0"],"cn":["19.0"],"backend":["19.0"],"business":["19.0"],"platform":["19.0"],"institution":["19.0"],"upstream":["19.0"],"version":["19.0","40.2"],"askpass":["19.0"],"set":["19.0","46.2","50.8"],"credentials":["19.0"],"fetch":["19.0"],"tags":["19.0"],"progress":["19.0"],"refs":["19.0"],"heads":["19.0"],"remotes":["19.0"],"test":["19.0","50.8"],"commit":["19.0"],"checking":["19.0"],"out":["19.0"],"revision":["19.0"],"3edab892f3efe98472bafba406e5b324398e509d":["19.0"],"core":["19.0","23.3"],"sparsecheckout":["19.0"],"checkout":["19.0"],"f":["19.0","35.3"],"message":["19.0","56.6"],"merge":["19.0"],"branch":["19.0"],"prod":["19.0"],"into":["19.0"],"no":["19.0"],"walk":["19.0"],"bin":["19.0"],"sh":["19.0"],"xe":["19.0"],"tmp":["19.0"],"jenkins8726267618464466461":["19.0"],"home":["19.0"],"var":["19.0"],"local":["19.0"],"jdk":["19.0"],"apache":["19.0"],"maven":["19.0"],"mvn":["19.0"],"clean":["19.0"],"install":["19.0","48.2"],"dmaven":["19.0"],"skip":["19.0"],"true":["19.0"],"u":["19.0"],"info":["19.0"],"scanning":["19.0"],"for":["19.0"],"projects":["19.0"],"downloading":["19.0"],"rdc":["19.0"],"snapshots":["19.0"],"repo":["19.0"],"aliyun":["19.0"],"com":["19.0","38.0","54.0"],"snapshot":["19.0"],"4gwswi":["19.0"],"dependency":["19.0"],"center":["19.0"],"metadata":["19.0"],"releases":["19.0"],"release":["19.0"],"x4vplw":["19.0"],"archetype":["19.0"],"b":["19.0"],"downloaded":["19.0"],"at":["19.0"],"s":["19.0","38.0"],"避免生成错误":["20.2"],"内容导航":["21.0"],"子应用更新异常":["22.0"],"js级别的缓存解决方案":["22.1"],"interview":["23.0"],"核心业务场景":["23.2"],"pool":["23.3"],"maximum":["23.4"],"work":["23.5"],"queue":["23.5"],"七层模型是什么样的":["23.6"],"如何保证可靠连接":["23.7"],"支持自添加单词的单词本":["24.1"],"实现概述":["24.2"],"查词":["24.2"],"避免冗余数据":["25.0"],"offsettop是相对relative的父级":["26.0"],"on":["27.0"],"docker":["28.0","58.1"],"vue2":["29.1"],"虚拟列表路线":["29.2"],"简略列表":["29.3"],"文件名建议全部连字符":["30.0"],"使用flutter构建的计算器demo":["31.0"],"nginx":["32.0","32.1"],"yourservicename":["32.1"],"youdomin替换成你自己的":["32.1"],"证书下载":["32.1"],"腾讯云":["32.1"],"dockerfile":["32.1"],"latest":["32.1"],"copy":["32.1"],"cert":["32.1"],"etc":["32.1"],"usr":["32.1"],"share":["32.1"],"conf":["32.1"],"d":["32.1"],"default":["32.1"],"idsspaceareaservice":["33.0"],"renegotiaton":["34.0"],"需要帮朋友解决renegotiaton的问题":["34.1"],"关键api":["34.2"],"监听renegotiate":["34.2"],"一个开源的容器编排平台":["35.0"],"应用程序部署和管理":["35.1"],"自动化应用程序的部署":["35.1"],"扩缩容和滚动更新":["35.1"],"减少了手动操作的风险和开销":["35.1"],"支持批量管理和编排多个应用程序及其依赖关系":["35.1"],"容器运行时":["35.2"],"master安装k8s集群模式的包":["35.3"],"node节点安装子节点需要的包":["35.3"],"配置master":["35.3"],"node节点":["35.3"],"集群中直接根据配置文件起对应服务":["35.3"],"kubectl":["35.3"],"apply":["35.3"],"frontend":["35.3"],"deployment":["35.3"],"yaml":["35.3"],"service":["35.3"],"master":["35.4"],"container":["35.5"],"pod是kubernetes中最小的可部署单元":["35.5"],"innodb":["36.1"],"myisam":["36.1"],"和":["36.1","46.1","53.4"],"是":["36.1"],"mysql":["36.1"],"数据库中的两个存储引擎":["36.1"],"它们在功能和性能上有一些区别":["36.1"],"让我详细解释一下":["36.1"],"事务支持":["36.1"],"支持事务":["36.1"],"而":["36.1"],"mode":["36.2"],"注释掉":["36.2"],"my":["36.2"],"join":["36.3","36.5"],"inner":["36.3","36.5"],"select":["36.4","45.6"],"name":["36.4"],"score":["36.4"],"student":["36.4"],"where":["36.4"],"not":["36.4"],"李":["36.4"],"请在此处输入":["36.4"],"sql":["36.4"],"请编写一条":["36.4"],"查询语句":["36.4"],"从名为":["36.4"],"的数据表中选择出所有不重复的班级":["36.4"],"id":["36.4","45.5","45.6","50.8"],"和考试编号":["36.4"],"exam":["36.4"],"num":["36.4"],"的组合":["36.4"],"distinct":["36.4"],"的数据表中选择出学生姓名":["36.4"],"年龄":["36.4"],"age":["36.4"],"和成绩":["36.4"],"首先按照成绩从大到小排序":["36.4"],"如果成绩相同":["36.4"],"则按照年龄从小到大排序":["36.4"],"order":["36.4"],"desc":["36.4"],"asc":["36.4"],"的数据表中选择学生姓名":["36.4"],"和年龄":["36.4"],"按照年龄从小到大排序":["36.4"],"从第":["36.4"],"条数据开始":["36.4"],"截取":["36.4"],"个学生的信息":["36.4"],"limit":["36.4"],"从第二条截取三个":["36.4"],"假设有一个学生表":["36.4"],"包含以下字段":["36.4"],"姓名":["36.4"],"请你编写一个":["36.4"],"查询":["36.4"],"将学生按照年龄划分为三个年龄等级":["36.4"],"level":["36.4"],"岁以上为":["36.4"],"老同学":["36.4"],"岁以上":["36.4"],"不包括":["36.4"],"为":["36.4"],"年轻":["36.4"],"岁及以下":["36.4"],"以及没有年龄信息为":["36.4"],"小同学":["36.4"],"返回结果应包含学生的姓名":["36.4"],"服务治理":["37.0"],"poe":["38.0"],"8e38iasslmhbmcw3orgp":["38.0"],"优点":["38.0"],"需要在catch里面做逻辑处理":["38.1"],"rsa":["38.2"],"dto":["38.3"],"js":["39.0","40.1","54.1"],"next":["39.1"],"office插件开发":["40.0"],"高度可移植性":["40.1"],"可以跨平台使用":["40.1"],"支持windows":["40.1"],"mac":["40.1"],"ios":["40.1"],"android等多个操作系统和设备":["40.1"],"ribbon配置":["40.2"],"encoding":["40.2"],"utf":["40.2"],"word的插件安装包":["40.5"],"word插件":["40.7"],"wps插件":["40.7"],"img":["40.7"],"src":["40.7"],"github":["40.7"],"文件服务":["41.1"],"修改初始化中给onlyoffice服务的地址换成cdn":["41.2"],"url即可":["41.2"],"修改callbackurl中持久化的操作":["41.2"],"改为文件整体上传oss":["41.2"],"app":["41.3"],"sdk":["43.0"],"场景":["43.0"],"需要二次封装一个js库":["43.0"],"输出一个自己的库":["43.0"],"安装依赖":["43.0"],"pnpm":["43.0"],"add":["43.0"],"webpack":["43.0"],"cli":["43.0"],"源码解析":["44.0"],"无界获取子应用的脚本采用的是qiankun的import":["44.3"],"css加载404异常捕捉不到的问题":["44.5"],"qiankun":["44.6"],"tip":["45.0"],"2023年12月2日21点49分":["45.1"],"单词本下面增加分类":["45.1"],"后端":["45.1"],"新增分类接口":["45.1"],"分类编辑接口":["45.1"],"v0":["45.2"],"注意isdelete字段":["45.4"],"单词分页查询":["45.5"],"使用mybatis":["45.5"],"page获取":["45.5"],"第一个参数默认传分页参数":["45.5"],"第一个参数传分页参数":["45.5"],"根据":["45.5"],"获取":["45.5"],"getdictionariesbyworkbookid":["45.6"],"flutter对比":["46.1"],"powershell管理员执行":["46.2"],"shell":["46.2"],"executionpolicy":["46.2"],"bypass":["46.2"],"scope":["46.2"],"process":["46.2"],"force":["46.2"],"npx":["47.0"],"react":["47.0"],"比较方便":["48.1"],"jabba":["48.2"],"openjdk":["48.2"],"worker":["49.0","49.1"],"demo":["49.1"],"git仓库":["49.1"],"mdn":["49.2"],"数据库实体":["50.2"],"全局异常处理":["50.3"],"项目主体":["50.4"],"mybatisx":["50.6"],"builder注解":["50.7"],"builder":["50.7"],"注解":["50.7"],"update动态sql":["50.8"],"update":["50.8"],"parametertype":["50.8"],"employee":["50.8"],"if":["50.8"],"challenges":["51.0"],"hooks":["52.0"],"alive":["53.0"],"一定能获取到更新之后的dom吗":["53.1"],"结论":["53.1"],"调用nexttick之前的同步任务":["53.1"],"微任务队列排在nexttick之前的都能获取到":["53.1"],"由nexttick的源码可以看出":["53.1"],"nexttick本质就是创建了一个微任务":["53.1"],"不考虑settimeout":["53.1"],"将其回调推入微任务队列":["53.1"],"vue中一个事件循环中的所有dom更新操作也是一个微任务":["53.1"],"两者属于同一优先级":["53.1"],"执行先后只于入队的先后有关":["53.1"],"换句话说":["53.1"],"如果你先写了nexttick":["53.1"],"再写赋值语句":["53.1"],"在此之前没有触发dom更新的操作":["53.1"],"那在nexttick中获取的可就不是更新后的dom了":["53.1"],"在":["53.3"],"author":["54.0"],"yaolinhong":["54.0"],"yaolinhong1024":["54.0"],"gmail":["54.0"],"date":["54.0"],"feat":["54.4","54.7"],"模型压缩调研":["54.4"],"gltf":["54.4"],"transform":["54.4"],"optimize":["54.4"],"revit":["54.4"],"减少模型的多边形数量":["54.5"],"多边形数量越多":["54.5"],"模型的复杂度和文件大小就会增加":["54.5"],"你可以使用3d建模软件":["54.5"],"如blender或maya":["54.5"],"我的three":["54.17"],"webgpu":["54.18"],"learn":["54.19","54.21"],"贴一个吗目标公司岗位的jd":["54.19"],"某目标公司":["54.19"],"webgl开发岗位职责":["54.19"],"开发和维护用于web端设计工具的高性能图形系统":["54.19"],"包括":["54.19"],"what":["54.20"],"3d":["54.23"],"坑":["55.2"],"模块":["56.1"],"整合到主项目启动":["56.2"],"执行sql插入报错":["56.3"],"synchronized":["56.4","56.6"],"关键字":["56.4"],"调用接口上线报错":["56.5"],"报错":["56.6"],"code":["56.6"],"null":["56.6"],"connectexception":["56.6"],"connection":["56.6"],"refused":["56.6"],"connect":["56.6"],"useraccount":["56.6"],"intern":["56.6"],"plan":["57.0"],"沉淀代码资产":["57.0"],"不限于工具库":["57.0"],"ui库":["57.0"],"重视输出":["57.0"],"少些demo项目":["57.0"],"多些深入探索":["57.0"],"要有产出成果":["57.0"],"仓库开源":["57.0"],"or形成相应的技术文章":["57.0"],"我取得了一些不错的成绩":["58.1"],"技术钻研":["58.1"],"服务端渲染应用落地":["58.1"],"compose部署":["58.1"],"二开":["58.1"],"用react的":["58.1"],"usedapp":["58.1"],"也有一些需要提升的地方":["58.2"],"任务管理":["58.2"],"目标管理意识较差":["58.2"],"这里只挑点缺点讲":["58.3"],"持续长跑":["58.4"],"按季度复盘":["58.4"],"娱乐消遣控制在每周2天左右":["58.4"],"学习打卡":["58.4"],"每周至少3天":["58.4"],"时间不限":["58.4"],"需要有学习产出的记录":["58.4"],"国家级":["59.1"],"webview":["59.3"],"im优化":["59.5"],"实时音频交互处理":["59.6"],"视频流处理":["59.7"],"服务端渲染":["60.1"],"div":["60.1","60.2"],"style":["60.1","60.2"],"width":["60.1","60.2"],"30px":["60.1","60.2"],"背景":["60.1","60.2"],"计划全站seo":["60.1"],"业务要新开一个saas系统":["60.2"],"后续可能做paas":["60.2"],"子系统多根据用户开通情况分配权限":["60.2"],"难点":["60.2"],"子系统用户权限":["60.2"],"页面路由":["60.2"],"数据权限":["60.2"],"性能优化":["60.3"],"列表方案":["60.3"],"不定高度":["60.3"],"从下往上滑动":["60.3"],"多页面响应式适配":["60.4"],"首页路由切换闪烁":["60.5"],"只允许排版功能":["60.6"],"面向前端同学":["61.0"],"可以使用默认布局":["61.0"],"node程序的进程":["62.0"],"ps":["62.0"],"ef":["62.0"],"grep":["62.0"],"快速导入swagger接口":["63.0"]},{"0":["45.2","48.2"],"1":["13.11","29.3","47.0","48.2","54.19","60.1"],"2":["13.10","13.20","34.2","35.1","54.19","60.1","60.2"],"3":["32.1","45.1","54.19","60.2"],"4":["45.1"],"5":["45.1"],"8":["13.0"],"11":["54.3"],"17":["48.2"],"19":["13.17"],"21":["19.0"],"22":["54.0"],"23":["54.0"],"47":["54.0"],"53":["54.0"],"80":["32.1"],"135":["19.0"],"192":["19.0"],"199":["19.0"],"443":["32.1"],"798":["19.0"],"992":["19.0"],"2009":["40.2"],"2023":["54.0"],"3072":["46.2"],"usage":["0.0"],"of":["0.0","13.11","19.0","54.5"],"some":["0.0","13.11","19.0"],"the":["0.0","0.9","13.12","36.2"],"pre":["0.2","0.3","0.4","0.6","0.7","0.8"],"out":["0.9"],"curl":["1.2"],"fssl":["1.2"],"https":["1.2"],"cmd":["2.0"],"args":["2.0"],"参数集合":["2.0"],"确保语言的确定性":["3.4"],"免税店":["4.0"],"总代理":["4.0"],"sudo":["5.0"],"crontab":["5.0"],"e":["5.0","11.0"],"interface":["6.0"],"i":["6.1"],"with":["7.0","13.13","13.21"],"知乎文章":["8.0"],"实际背后差距可能更大":["9.1"],"数据处理能力":["9.1"],"工程能力":["9.1"],"用户数正反馈":["9.1"],"静态变量非常有用":["10.0"],"例如":["10.0"],"一个类代表一个公司的员工":["10.0"],"公司的名称对于所有员工来说都是相同的":["10.0"],"注意使用开源版本":["11.0"],"时区变量":["11.0"],"php":["11.0"],"tz":["11.0"],"yaolinhong1024":["12.0"],"option":["13.7"],"to":["13.7"],"see":["13.7"],"bold":["13.8"],"text":["13.8","13.18","13.19","55.1"],"also":["13.9","13.14"],"be":["13.9","13.12","19.0"],"nested":["13.9"],"sub":["13.10"],"are":["13.10"],"made":["13.10"],"indenting":["13.10"],"spaces":["13.10"],"marker":["13.10"],"character":["13.10"],"comments":["13.11"],"line":["13.11","19.0"],"that":["13.12"],"will":["13.12"],"passed":["13.12"],"into":["13.12"],"templates":["13.12"],"engine":["13.12"],"have":["13.14"],"a":["13.14","58.3"],"footnote":["13.14"],"killer":["13.15"],"feature":["13.15"],"wink":["13.16"],"cry":["13.16"],"first":["13.20"],"lazy":["13.21"],"continuation":["13.21"],"abbreviation":["13.22"],"example":["13.22"],"it":["13.22","19.0"],"warning":["13.23","19.0"],"examples":["14.1"],"使用步骤":["14.1"],"npm":["14.1"],"install":["14.1","14.2"],"platform":["15.0"],"openai":["15.0"],"关注技术付费点":["16.0"],"一个是":["16.0"],"能帮别人":["16.0"],"挣钱":["16.0"],"的地方":["16.0"],"profiles":["18.0"],"profile":["18.0"],"id":["18.0"],"dev":["18.0"],"properties":["18.0"],"profileactive":["18.0"],"problems":["19.0"],"were":["19.0"],"encountered":["19.0"],"while":["19.0"],"effective":["19.0"],"model":["19.0"],"jar":["19.0"],"dependencies":["19.0"],"groupid":["19.0"],"artifactid":["19.0"],"type":["19.0"],"classifier":["19.0"],"must":["19.0"],"unique":["19.0"],"baomidou":["19.0"],"mybatis":["19.0"],"plus":["19.0"],"boot":["19.0"],"starter":["19.0"],"duplicate":["19.0"],"declaration":["19.0"],"column":["19.0"],"build":["19.0","32.1"],"plugins":["19.0"],"plugin":["19.0","43.0"],"org":["19.0"],"resources":["19.0"],"missing":["19.0"],"deploy":["19.0"],"highly":["19.0"],"fix":["19.0"],"these":["19.0"],"because":["19.0"],"they":["19.0"],"threaten":["19.0"],"stability":["19.0"],"your":["19.0"],"this":["19.0"],"reason":["19.0"],"future":["19.0"],"versions":["19.0"],"might":["19.0"],"longer":["19.0"],"support":["19.0"],"such":["19.0"],"malformed":["19.0"],"lt":["19.0"],"cloud":["19.0"],"feign":["19.0"],"kb":["19.0"],"swarm":["19.0"],"coding":["21.0","58.4"],"现象":["22.0"],"不缓存html":["22.1"],"questions":["23.0"],"核心线程数":["23.1"],"处理订单请求":["23.2"],"包括验证订单信息":["23.2"],"size":["23.3","23.4"],"业务场景关联":["23.3","23.5"],"pool":["23.4"],"工作队列用于存储尚未被执行的订单处理任务":["23.5"],"应该能够满足高并发请求下的任务排队需求":["23.5"],"路由器工作在哪一层":["23.6"],"要点":["23.8"],"记录小孩的单词量":["24.1"],"百度翻译api申请":["24.2"],"调用":["24.2"],"ecdict":["24.2"],"单一职责":["25.0"],"不一定是父元素":["26.0"],"定位元素":["26.0"],"追加的服务可以在应用内直接映射访问":["27.0"],"run":["28.0"],"项目":["29.1"],"400个表单需要校验":["29.1"],"不定高度内容":["29.2"],"快速滚动会产生高度跳变":["29.2"],"虚拟列表滚动":["29.2"],"调研中遇到了动态选10个显示":["29.2"],"单个sku表单":["29.3"],"否则git大小写有的折腾呢":["30.0"],"若flutter":["31.0"],"doctor":["31.0","47.0"],"dockerfile":["32.0"],"expose":["32.1"],"yml":["32.1"],"docker":["32.1"],"compose":["32.1"],"version":["32.1"],"services":["32.1","35.3"],"image":["32.1"],"container":["32.1"],"name":["32.1","50.8"],"restart":["32.1"],"always":["32.1"],"ports":["32.1"],"server":["32.1"],"lambdaupdate":["33.0"],"eq":["33.0","56.6"],"dsspacearea":["33.0"],"freeswitch探索":["34.0"],"玩了一下jssip的api":["34.1"],"reinvite事件":["34.2"],"若是直接用浏览器rtc的api":["34.2"],"安装":["34.4"],"wss配置":["34.5"],"高可用性和容错":["35.1"],"通过自动重启容器和自动重新调度pod":["35.1"],"提高了应用程序的可靠性和容错能力":["35.1"],"支持多副本部署":["35.1"],"实现负载均衡和服务高可用":["35.1"],"docker只是其中一种":["35.2"],"get":["35.3","45.5"],"是的":["35.3"],"在应用了上述":["35.3"],"kubernetes":["35.3"],"部署配置之后":["35.3"],"会自动将前端应用动态部署到集群中的":["35.3"],"node":["35.3","62.0"],"节点上":["35.3"],"不需要手动将应用程序部署到特定的节点":["35.3"],"会根据在":["35.3"],"文件中定义的规则":["35.3"],"自动选择合适的节点来调度和运行":["35.3"],"集群":["35.4"],"它包含一个或多个container":["35.5"],"pod中的所有container共享相同的网络命名空间":["35.5"],"network":["35.5"],"不支持":["36.1"],"对于":["36.1"],"每一条":["36.1"],"sql":["36.1","36.2"],"语句都默认封装成事务进行提交":["36.1"],"这可能会影响速度":["36.1"],"优化速度的方式是将多条":["36.1"],"语句放在":["36.1"],"begin":["36.1"],"commit":["36.1"],"ini中的":["36.2"],"set":["36.2"],"交集":["36.3","36.5"],"left":["36.3","36.5"],"right":["36.3","36.5"],"和年龄等级":["36.4"],"并按姓名升序排序":["36.4"],"case":["36.4"],"when":["36.4"],"then":["36.4","53.1"],"else":["36.4"],"end":["36.4"],"as":["36.4"],"date":["36.4"],"当前日期":["36.4"],"学号":["36.4"],"筛选出姓名为":["36.4"],"热dog":["36.4"],"的学生":["36.4"],"展示其学号":["36.4"],"及其大写姓名":["36.4"],"upper":["36.4"],"avg":["36.4"],"平均":["36.4"],"班级编号":["36.4"],"成绩":["36.4"],"汇总学生表中所有学生的总成绩":["36.4"],"total":["36.4"],"平均成绩":["36.4"],"最高成绩":["36.4"],"max":["36.4"],"和最低成绩":["36.4"],"min":["36.4"],"sum":["36.4"],"group":["36.4"],"heimashangcheng":["37.0"],"效率高":["38.0"],"位运算是对二进制位的直接操作":["38.0"],"比一般的算术运算和逻辑运算更高效":["38.0"],"它可以在一条指令中完成多个操作":["38.0"],"因此可以提高代码的执行速度和性能":["38.0"],"节省空间":["38.0"],"位运算可以将多个状态或选项使用较少的二进制位表示":["38.0"],"场景":["38.1"],"公钥私钥配对":["38.2"],"sse":["39.1"],"群聊实现demo":["39.2"],"与web技术无缝集成":["40.1"],"开发门槛较低":["40.1"],"可以使用html":["40.1"],"css":["40.1"],"javascript等web技术进行开发":["40.1"],"方便与web应用的集成":["40.1"],"安全性高":["40.1"],"api是基于沙箱模型进行开发":["40.1"],"可以有效避免恶意代码对系统造成的影响":["40.1"],"customui":["40.2"],"xmlns":["40.2"],"http":["40.2"],"schemas":["40.2"],"microsoft":["40.2"],"com":["40.2","40.7","45.6","65.0"],"office":["40.2"],"07":["40.2","54.6"],"clickone部署自动更新":["40.4"],"优点":["40.4"],"advance":["40.5"],"installer":["40.5"],"yaolinhong":["40.7"],"blog":["40.7"],"blob":["40.7"],"main":["40.7"],"static":["40.7"],"word":["40.7"],"office文档机翻":["40.8"],"给onlyoffice":["41.1"],"callbackurl的实现":["41.2"],"当用户保存时":["41.2"],"文档服务会调用文档储存服务的":["41.2"],"callbackurl":["41.2"],"文档body中返回一个url地址和status":["41.2"],"增加额外的js":["41.3"],"terser":["43.0"],"uglify":["43.0"],"js":["43.0"],"javascript":["43.0","53.1","57.0"],"config":["43.0"],"const":["43.0"],"html":["44.3"],"思路":["44.5"],"提供了集中式的状态管理方案":["44.6"],"它通过":["44.6"],"旨在陪伴kids":["45.0"],"单词本下面":["45.1"],"所有分类接口":["45.1"],"单词列表中返回分类id":["45.1"],"单词关联分类接口":["45.1"],"xml中新增字段飘红":["45.1"],"alt":["45.1"],"数据库需要设置默认值0":["45.4"],"单词本单词":["45.5"],"xml版本":["45.5"],"支持分页加载":["45.5"],"param":["45.5"],"return":["45.5"],"getmapping":["45.5"],"words":["45.5"],"resultmap":["45.6"],"yao":["45.6"],"wxmp":["45.6"],"大厂使用比较多":["46.1"],"net":["46.2"],"servicepointmanager":["46.2"],"securityprotocol":["46.2"],"bor":["46.2"],"iex":["46.2"],"native":["47.0"],"有界面操作":["48.1"],"在线":["49.1"],"功能":["49.1"],"多个不同tab页面之间数据交互":["49.1"],"demo":["49.2"],"dto":["50.2"],"通用包装类等":["50.3"],"安装之后":["50.6"],"构建器":["50.7"],"用于创建对象":["50.7"],"如实现类中":["50.7"],"null":["50.8"],"username":["50.8"],"坑":["52.0"],"实现原理":["53.0"],"如何阻塞nexttick内依赖改变的内容导致的页面更新":["53.1"],"不停地push微任务":["53.1"],"本轮事件循环就一直不会结束":["53.1"],"代码如下":["53.1"],"let":["53.1"],"queue":["53.1"],"promise":["53.1"],"resolve":["53.1"],"function":["53.1"],"cb":["53.1"],"toraw":["53.4"],"09":["54.0"],"lasteditors":["54.0"],"glb":["54.4"],"compressed":["54.4"],"texture":["54.4"],"compress":["54.4"],"webp":["54.4"],"一键压缩效果":["54.4"],"来减少模型中的多边形数量":["54.5"],"这可以通过简化几何形状":["54.5"],"合并顶点或使用lod":["54.5"],"level":["54.5"],"detail":["54.5"],"技术来实现":["54.5"],"revit模型渲染":["54.7"],"mvp":["54.7"],"06":["54.8"],"js训练场":["54.17"],"渲染引擎的性能和效果优化":["54.19"],"前后端及上下游工具链图形能力建设":["54.19"],"显示素材数据的转化和优化处理":["54.19"],"抽象几个关键的技术要素":["54.20"],"webgl":["54.20"],"主要目标":["54.21"],"有业余开源项目供技术参考":["54.21"],"最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现":["54.23"],"一看是直接放的video":["54.23"],"native支付并不能用网站引用的appid申请":["55.2"],"需要单独打开项目":["56.1"],"not":["56.3"],"加锁和释放锁":["56.4"],"无论方法正常执行完毕还是抛出异常":["56.4"],"原因":["56.5"],"账户不能重复":["56.6"],"querywrapper":["56.6"],"user":["56.6"],"new":["56.6"],"long":["56.6"],"count":["56.6"],"usermapper":["56.6"],"记笔记":["57.0"],"主要是过后自己翻阅可以加深理解":["57.0"],"分享给他人的内容":["57.0"],"当然需要再深度加工产出博客":["57.0"],"上面说的还是一些原则性的东西":["57.0"],"下面是具体的计划":["57.0"],"前端技术沉淀":["57.0"],"作用域":["57.0"],"闭包":["57.0"],"原型链":["57.0"],"总结":["58.0"],"发布了自己的web3测试链":["58.1"],"c":["58.1"],"webview落地word插件":["58.1"],"发布实践":["58.1"],"oneclick部署":["58.1"],"electron":["58.1"],"网盘应用源码精读":["58.1"],"调试":["58.1"],"electron原理书泛读":["58.1"],"严格工时评估的能力差":["58.2"],"需求评审不够严谨":["58.2"],"松散的目标意识":["58.2"],"如saas中":["58.2"],"有时候会眼高手低":["58.3"],"笔记":["58.4"],"代码库":["58.4"],"沉淀代码资产":["58.4"],"不限于工具库":["58.4"],"ui库":["58.4"],"重视输出":["58.4"],"word插件项目":["59.3"],"前端消息确认":["59.5"],"description":["59.5"],"工期紧":["60.1"],"一期迭代要求一周":["60.1"],"难点":["60.1"],"原单页面改全站seo":["60.1"],"br":["60.1","60.2"],"主子页面登录态共享":["60.1"],"选型":["60.1","60.2"],"设计":["60.2"],"多子系统共用组件库":["60.2"],"共享依赖":["60.2"],"全局组件库":["60.2"],"css隔离":["60.2"],"样式隔离":["60.2"],"rbac":["60.2"],"页面抖动":["60.3"],"删除节点页面跳动":["60.3"],"复杂业务代码改造":["60.3"],"item":["60.3"],"i18n":["60.4"],"公共组件库处理":["60.5"],"iframe":["60.6"],"可基于vue扩展":["61.0"],"vitepress":["61.0"],"解压到当前文件夹":["62.0"],"tar":["62.0"],"zxvf":["62.0"]},{"0":["5.0","56.6"],"1":["35.3","38.1","45.2","49.1"],"2":["13.11","13.21","23.1","35.3","39.2","40.5","54.5","56.6"],"3":["34.2","35.1"],"5":["19.0"],"6":["19.0"],"11":["54.0"],"15":["54.4","54.8"],"19":["35.3"],"20":["54.3"],"23":["54.6"],"92":["40.7"],"150":["36.4"],"768":["19.0"],"apis":["0.0"],"provided":["0.0"],"by":["0.0","13.9"],"vitepress":["0.0"],"documentation":["0.9"],"ollama":["1.2"],"com":["1.2","15.0","32.1"],"install":["1.2"],"修改":["2.0"],"webui":["2.0"],"user":["2.0"],"the":["3.4"],"不给货":["4.0"],"大宗商品":["4.0"],"path":["5.0"],"ui":["6.0"],"connect":["6.1"],"format":["7.0"],"需要配置服务器":["8.0"],"已经让openai有了代差":["9.1"],"进入了增长飞轮":["9.1"],"国产模型":["9.1"],"替代开源模型难以企及":["9.1"],"这时可以使用静态变量来表示公司的名称":["10.0"],"常量":["10.0"],"静态变量通常用于表示常量":["10.0"],"因为它们的值在整个程序执行期间保持不变":["10.0"],"asia":["11.0"],"shanghai":["11.0"],"获取密码":["11.0"],"登录":["11.0"],"安装gitee插件":["11.0"],"gmail":["12.0"],"result":["13.7"],"c":["13.7"],"r":["13.7"],"using":["13.9"],"additional":["13.9"],"change":["13.10"],"forces":["13.10"],"new":["13.10","46.2"],"start":["13.10"],"ac":["13.10"],"tristique":["13.10"],"libero":["13.10"],"volutpat":["13.10"],"at":["13.10"],"used":["13.12"],"for":["13.12"],"processing":["13.12"],"handlebars":["13.12"],"is":["13.12"],"default":["13.12"],"title":["13.13"],"autoconverted":["13.13"],"style":["13.14"],"syntax":["13.14"],"alt":["13.14"],"text":["13.14","13.20","45.1"],"of":["13.15"],"markdown":["13.15"],"laughing":["13.16"],"yum":["13.16"],"th":["13.17"],"second":["13.20"],"inline":["13.20"],"withinline":["13.21"],"markup":["13.21"],"converts":["13.22"],"but":["13.22"],"here":["13.23"],"g":["14.1","14.2"],"node":["14.1","35.4"],"gyp":["14.1"],"对应的python版本":["14.1"],"examples":["15.0"],"另一个是":["16.0"],"省钱":["16.0"],"付费的前提是信任":["16.0"],"只有你提升自己的能力和经历后":["16.0"],"activation":["18.0"],"activebydefault":["18.0"],"true":["18.0","43.0"],"base":["19.0"],"common":["19.0"],"alibaba":["19.0"],"reos":["19.0"],"open":["19.0"],"file":["19.0"],"api":["19.0","54.20"],"sdk":["19.0","47.0"],"learning":["21.0"],"record":["21.0"],"偶先页面渲染异常":["22.0"],"最大线程数":["23.1"],"扣除库存":["23.2"],"生成订单号等":["23.2"],"核心线程数应该根据订单的日均请求量和处理时间来确定":["23.3"],"对于一个电商平台":["23.3"],"业务场景关联":["23.4"],"最大线程数应该根据系统的资源限制和预期的最大并发量来确定":["23.4"],"在电商平台中":["23.5"],"可以选择一个适当大小的有界队列来限制订单处理的并发量":["23.5"],"如何建立可靠的连接":["23.7"],"支持分享单词本":["24.1"],"社区词典数据库":["24.2"],"单词发音":["24.2"],"tts":["24.2"],"渲染列表":["25.0"],"position属性为relative":["26.0"],"absolute":["26.0"],"build":["28.0"],"每个表单有20个左右的校验项":["29.1"],"高度跳变的问题":["29.2"],"也有解决方案":["29.2"],"但实现成本大":["29.2"],"整体表单校验":["29.3"],"使用nextick方式":["29.3"],"不通过":["31.0"],"使用java8":["31.0"],"https配置":["32.0"],"listen":["32.1"],"ssl":["32.1"],"youdomin":["32.1"],"certificate":["32.1"],"crt":["32.1"],"下载下来的证书名称不能改":["32.1"],"key":["32.1"],"tokens":["32.1"],"off":["32.1"],"getid":["33.0"],"dto":["33.0"],"仓库名称":["34.0"],"vue":["34.0","61.0"],"replacetrack替换轨道":["34.2"],"重新offer":["34.2"],"jssip库":["34.2"],"windows下":["34.4"],"参考博客":["34.5"],"资源利用率和集群管理":["35.1"],"通过自动调度":["35.1"],"充分利用集群资源":["35.1"],"提高资源利用率":["35.1"],"支持自动伸缩":["35.1"],"根据应用程序负载动态调整资源分配":["35.1"],"还有":["35.2"],"pod":["35.3"],"它会考虑诸如节点资源可用性":["35.3"],"节点标签":["35.3"],"污点和容忍等多种调度策略":["35.3"],"从而实现高效且合理的应用程序分布":["35.3"],"在部署过程中":["35.3"],"不需要处理太多其他逻辑":["35.3"],"会自动为处理以下任务":["35.3"],"拉取容器镜像":["35.3"],"会从配置的容器镜像仓库中拉取":["35.3"],"nginx":["35.3"],"alpine":["35.3"],"镜像":["35.3"],"namespace":["35.5"],"和存储卷":["35.5"],"volumes":["35.5"],"之间":["36.1"],"组成一个事务":["36.1"],"如果你的应用需要高度的事务处理":["36.1"],"选择":["36.1"],"是更好的选择":["36.1"],"外键支持":["36.1"],"支持外键":["36.1"],"外键是关系数据库中的重要概念":["36.1"],"用于维护表之间的数据完整性":["36.1"],"to":["36.2"],"strict":["36.2"],"左右其中一张的全表":["36.3","36.5"],"加上选集":["36.3","36.5"],"cross":["36.3"],"统计学生表中的班级编号":["36.4"],"和每个班级的平均成绩":["36.4"],"考试次数":["36.4"],"统计学生表中每个班级每次考试的总学生人数":["36.4"],"count":["36.4"],"统计学生表中班级的总成绩超过":["36.4"],"分的班级编号":["36.4"],"和总成绩":["36.4"],"having子句":["36.4"],"对goup":["36.4"],"by的内容进行筛选":["36.4"],"在":["36.4"],"中":["36.4"],"having":["36.4"],"子句用于在分组聚合后对分组进行过滤":["36.4"],"它允许我们对分组后的结果进行条件筛选":["36.4"],"只保留满足特定条件的分组":["36.4"],"子句与条件查询":["36.4"],"子句的区别在于":["36.4"],"docker启动":["37.0"],"从而节省存储空间":["38.0"],"这在需要处理大量数据或对性能要求较高的场景中特别有用":["38.0"],"适用于某些特定问题":["38.0"],"位运算在某些问题和算法中非常有用":["38.0"],"例如处理图像":["38.0"],"压缩算法":["38.0"],"权限控制等":["38.0"],"https中的加密":["38.2"],"data":["38.3"],"transfer":["38.3"],"体验一下国际服玩家的利器next":["39.1"],"高度扩展性":["40.1"],"可以通过使用office":["40.1"],"add":["40.1"],"ins等技术进行扩展":["40.1"],"增加插件的功能和适用范围":["40.1"],"开发负担":["40.1"],"无法抹平两套sdk差异":["40.1"],"资源发布需要上架审核":["40.1"],"应用分别受两家厂商限制":["40.1"],"2套代码":["40.1"],"onload":["40.2"],"ribbon":["40.2"],"load":["40.2"],"tabs":["40.2"],"tab":["40.2"],"id":["40.2"],"tab1":["40.2"],"安装之后":["40.4"],"innosetup":["40.5"],"e6":["40.7"],"8f":["40.7"],"e4":["40.7"],"bb":["40.7"],"b6":["40.7"],"社区参考资料少":["40.8"],"editing服务提供文件":["41.1"],"status为6":["41.2"],"此时储存服务去保存":["41.2"],"保存成功失败返回对应的状态码":["41.2"],"status":["41.2"],"把构建好的web":["41.3"],"terserplugin":["43.0"],"require":["43.0"],"module":["43.0"],"exports":["43.0"],"mode":["43.0"],"production":["43.0"],"experiments":["43.0"],"outputmodule":["43.0"],"entry方案":["44.3"],"这个方案是通过正则表达式将":["44.3"],"debug":["44.5"],"props":["44.6"],"和全局状态对象来实现子应用之间的通信和状态共享":["44.6"],"私有单词库":["45.0"],"前端":["45.1"],"单词本列表中请求所有分类":["45.1"],"点击编辑":["45.1"],"可以关联分类":["45.1"],"关联分类之后刷新列表":["45.1"],"列表中分类展示":["45.1"],"根据分类list接口map展示":["45.1"],"查询词典":["45.2"],"然后需要添加":["45.4"],"xml":["45.5"],"public":["45.5"],"baseresponse":["45.5"],"page":["45.5"],"dics":["45.5"],"getwordsbyid":["45.5"],"int":["45.5"],"requestparam":["45.5"],"defaultvalue":["45.5"],"mapper":["45.6"],"dicsmapper":["45.6"],"baseresultmap":["45.6"],"d":["45.6"],"flutter":["46.1"],"中小厂使用比较多":["46.1"],"object":["46.2"],"webclient":["46.2"],"downloadstring":["46.2"],"https":["46.2"],"community":["46.2"],"chocolatey":["46.2"],"org":["46.2"],"设置系统环境变量":["47.0"],"落地场景":["49.1"],"electron":["49.1","60.6"],"render进程之间交互":["49.1"],"entity":["50.2"],"设置schema":["50.6"],"employee":["50.7"],"password":["50.8"],"phone":["50.8"],"onmounted问题解决":["52.0"],"微前端场景下如何服用子vue实例的component":["53.0"],"嵌套路由场景下":["53.0"],"模拟无限添加微任务":["53.1"],"addinfinitetask":["53.1"],"console":["53.1"],"log":["53.1"],"infinite":["53.1"],"task":["53.1"],"这里会无线阻塞主进程":["53.1"],"什么时候更新":["53.1"],"下次更新dom之前":["53.1"],"能拿到更新后的虚拟dom":["53.1"],"运行的时候只是提交更新":["53.1"],"并不会直接执行渲染":["53.1"],"有什么区别":["53.4"],"lastedittime":["54.0"],"info":["54.4"],"mb":["54.4"],"压缩纹理":["54.5"],"纹理是模型中常用的图像贴图":["54.5"],"可以给模型增加细节和颜色":["54.5"],"你可以使用图像压缩工具":["54.5"],"如jpeg或png压缩算法":["54.5"],"来减小纹理文件的大小":["54.5"],"预览":["54.7"],"仓库地址":["54.7"],"feat":["54.17"],"metaverse游戏":["54.17"],"岗位要求":["54.19"],"计算机或相关专业":["54.19"],"或丰富从业经验":["54.19"],"本科及以上学历":["54.19"],"计算机基础扎实":["54.19"],"web图形领域":["54.20"],"找相关开源项目":["54.21"],"找webgl下的问题场景":["54.21"],"直接解决相关的问题":["54.21"],"对于需要seo的页面来说":["54.23"],"订阅号无法开通此接口":["55.1"],"必须将微信支付id":["55.2"],"null的字段没有写入":["56.3"],"都会释放锁":["56.4"],"一把锁只能同时被一个线程获取":["56.4"],"没有获得锁的线程只能等待":["56.4"],"gateway挂了":["56.5"],"selectcount":["56.6"],"if":["56.6"],"throw":["56.6"],"businessexception":["56.6"],"errorcode":["56.6"],"params":["56.6"],"error":["56.6"],"账号重复":["56.6"],"加密":["56.6"],"算法与数据结构":["57.0"],"常态学习":["57.0"],"阅读笔记":["57.0"],"leecode":["57.0"],"快排":["57.0"],"爬楼梯":["57.0"],"暴力解":["57.0"],"不做的事情":["57.0"],"除非有好的深入的项目":["57.0"],"否则不摸客户端类":["57.0"],"3d":["58.1"],"钻研了revit转glb":["58.1"],"drao模型压缩":["58.1"],"three":["58.1"],"js模型渲染":["58.1"],"revit模型选然后":["58.1"],"构建选择":["58.1"],"jssip":["58.1"],"错误估计整体提测时间":["58.2"],"需求侧不确定的情况下":["58.2"],"花很多时间做一些不确定的需求":["58.2"],"重复劳动":["58.2"],"得下场多做":["58.3"],"b":["58.3"],"少些demo项目":["58.4"],"多些深入探索":["58.4"],"要有产出成果":["58.4"],"仓库开源":["58.4"],"or形成相应的技术文章":["58.4"],"记笔记":["58.4"],"主要是过后自己翻阅可以加深理解":["58.4"],"分享给他人的内容":["58.4"],"背景":["59.5"],"session方案":["60.1"],"vue2":["60.1"],"nuxt2":["60.1"],"cv简单修改即可":["60.1"],"落地快":["60.1"],"or":["60.2"],"rbac1":["60.2"],"角色继承":["60.2"],"省空间":["60.2"],"制定路由规范":["60.2"],"一级规定指向应用":["60.2"],"主应用控制应用进入的权限":["60.2"],"子应用内路由首位使用基座的共享方法去控制具体页面的路由权限":["60.2"],"公共组件库":["60.2"],"主应用分发":["60.2"],"处理为计算属性":["60.3"],"一些个人的经验":["60.3"],"关于虚拟列表相关的优化它真的就只是在优化":["60.3"],"直接限制你每次滚动的范围":["60.3"],"就类似之前看到大屏做上下幻灯片滚动一样":["60.3"],"动态rem":["60.4"],"二次封装组件":["60.5"],"限制":["60.6"],"theme":["61.0"],"maotai":["62.0"],"fe":["62.0"],"gz":["62.0"],"ylh1995":["65.0"]},{"1":["32.1","41.2","45.5"],"2":["29.2","31.0","32.1","40.1"],"3":["13.11","23.1","35.3","54.5","56.6"],"4":["35.1","60.2"],"5":["32.1"],"10":["45.5"],"11":["48.2"],"20":["54.0"],"21":["54.0"],"33":["54.0"],"56":["54.0"],"81":["54.4"],"88":["40.7"],"95":["40.7"],"100":["36.4"],"390":["54.4"],"main":["0.0"],"usedata":["0.0"],"can":["0.0"],"be":["0.0","13.23"],"for":["0.9"],"sh":["1.2"],"bat里":["2.0"],"set":["2.0","33.0"],"dao":["3.4"],"店铺资源":["4.0"],"to":["5.0"],"myscript":["5.0"],"you":["6.1"],"导出ddl":["7.0"],"服务端":["8.0"],"使用gpt是最优解":["9.1"],"套壳gpt":["9.1"],"固定prompt":["9.1"],"没有意义":["9.1"],"数学中的π":["10.0"],"圆周率":["10.0"],"配置hooks":["11.0"],"这里选择的是scm的方式":["11.0"],"每15分钟拉取git仓库":["11.0"],"比较最新的哈希值":["11.0"],"com":["12.0","40.1","53.1"],"tm":["13.7"],"greater":["13.9"],"than":["13.9"],"signs":["13.9"],"facilisis":["13.10"],"in":["13.10"],"pretium":["13.10"],"nisl":["13.10"],"aliquet":["13.10"],"nulla":["13.10"],"aliquam":["13.10"],"velit":["13.10"],"very":["13.10"],"block":["13.11"],"ext":["13.12"],"extension":["13.12"],"dest":["13.12"],"right":["13.12"],"aligned":["13.12"],"https":["13.13","34.2","53.1","54.7"],"id":["13.14","50.7"],"with":["13.14"],"reference":["13.14"],"later":["13.14"],"it":["13.15"],"is":["13.15"],"shortcuts":["13.16"],"emoticons":["13.16"],"h":["13.17"],"of":["13.20","13.21"],"some":["13.21"],"code":["13.21"],"part":["13.21"],"keep":["13.22"],"intact":["13.22"],"partial":["13.22"],"可以构建一个可以给调用的cc文件":["14.1"],"node":["14.2"],"fine":["15.0"],"tune":["15.0"],"别人才会对你有一定的信任":["16.0"],"才会觉得你靠谱":["16.0"],"才会给你机会":["16.0"],"而这个信任需要用你的能力和经历来填补":["16.0"],"比如":["16.0"],"test":["18.0"],"代码":["21.0"],"css没加载完全":["22.0"],"技术栈":["23.2"],"java后端开发":["23.2"],"订单请求可能会呈现出明显的日周期性波动":["23.3"],"因此核心线程数应该足够以应对峰值时段的订单处理需求":["23.3"],"在电商平台中":["23.4"],"最大线程数的设置应该考虑服务器的cpu和内存资源":["23.4"],"以防止系统资源被无限制地占用":["23.5"],"技术实现":["23.5"],"在threadpooltaskexecutor中":["23.5"],"三次握手的详细过程":["23.7"],"家人范围内共享":["24.1"],"使用社区免费的tts":["24.2"],"使用社区开源tts":["24.2"],"http":["24.2"],"渲染组件":["25.0"],"fixed或sticky":["26.0"],"会影响其后代元素的offsettop":["26.0"],"多选":["29.1"],"单选":["29.1"],"也有loading":["29.2"],"表单提交时前端校验需要校验所有数据":["29.2"],"需要改造校验逻辑":["29.2"],"替换数据":["29.3"],"循环赋值":["29.3"],"anroid":["31.0"],"前置步骤":["32.0"],"keepalive":["32.1"],"timeout":["32.1"],"session":["32.1"],"5m":["32.1"],"protocols":["32.1"],"tlsv1":["32.1"],"可参考此":["32.1"],"协议进行配置":["32.1"],"ciphers":["32.1"],"ecdhe":["32.1"],"rsa":["32.1"],"aes128":["32.1"],"gcm":["32.1"],"sha256":["32.1"],"high":["32.1"],"anull":["32.1"],"md5":["32.1"],"rc4":["32.1"],"dhe":["32.1"],"getname":["33.0"],"fs":["34.0"],"dtmf":["34.2"],"下载msi":["34.4"],"并配置nginx之后":["34.5"],"提供集中式监控和管理工具":["35.1"],"简化了集群操作":["35.1"],"一致性和隔离性":["35.1"],"通过容器和命名空间":["35.1"],"实现了应用程序之间的隔离和一致性部署":["35.1"],"containerd":["35.2"],"创建":["35.3"],"会根据":["35.3"],"中的配置":["35.3"],"创建包含前端应用容器的":["35.3"],"挂载卷":["35.3"],"会将指定的本地构建产物目录挂载到":["35.3"],"容器中的":["35.3"],"usr":["35.3"],"share":["35.3"],"html":["35.3"],"子节点":["35.4"],"pod是一个临时性的实体":["35.5"],"如果pod中的某个container终止":["35.5"],"整个pod也会被重新创建":["35.5"],"如果你的数据模型需要外键约束":["36.1"],"索引结构":["36.1"],"使用":["36.1","36.4"],"b":["36.1"],"树的非聚集索引":["36.1"],"存储的是实际数据的地址值":["36.1"],"索引和实际数据是分开的":["36.1"],"树的聚集索引":["36.1"],"trans":["36.2"],"tables":["36.2"],"笛卡尔积":["36.3","36.5"],"聚合":["36.3","36.5"],"子句用于在":["36.4"],"分组之前":["36.4"],"进行过滤":["36.4"],"而":["36.4"],"分组之后":["36.4"],"子句查询订单总金额超过":["36.4"],"的客户":["36.4"],"查询总成绩超过200的班级":["36.4"],"customer":["36.4"],"amount":["36.4"],"orders":["36.4"],"cross":["36.4","36.5"],"join":["36.4"],"其中":["36.4"],"是一种简单的关联查询":["36.4"],"不需要任何条件来匹配行":["36.4"],"它直接将左表的":["36.4"],"每一行":["36.4"],"与右表的":["36.4"],"进行组合":["36.4"],"返回的结果是两个表的笛卡尔积":["36.4"],"还有一个班级表":["36.4"],"班级名称":["36.4"],"将学生表和班级表的所有行组合在一起":["36.4"],"并返回学生姓名":["36.4"],"学生年龄":["36.4"],"以及班级名称":["36.4"],"s":["36.4"],"它可以简化代码实现并提高处理效率":["38.0"],"缺点":["38.0"],"可读性较差":["38.0"],"位运算涉及对二进制位的直接操作":["38.0"],"对于不熟悉位运算的开发者来说":["38.0"],"代码可读性较差":["38.0"],"如任意api":["38.1"],"为啥需要证书":["38.2"],"object":["38.3"],"js":["39.1"],"打字机推送效果":["39.2"],"无法兼容":["40.1"],"加载项":["40.1"],"功能强大":["40.1"],"使用com加载项可以实现更复杂的功能和操作":["40.1"],"js版本的接口相对阉割":["40.1"],"高性能":["40.1"],"com加载项可以直接访问本地api":["40.1"],"不需要通过网络访问":["40.1"],"label":["40.2"],"应用名称":["40.2"],"group":["40.2"],"contentgroup":["40.2"],"aegis":["40.2"],"button":["40.2"],"更新服务器资源后":["40.4"],"用户端每次重启word均会拉取最新版本word":["40.4"],"好处":["40.5"],"9e":["40.7"],"9c":["40.7"],"png":["40.7"],"raw":["40.7"],"给对应加密信息":["41.1"],"描述":["41.2"],"出现条件":["41.2"],"正在编辑文档":["41.2"],"每次用户连接或断开文档共同编辑时都会收到它":["41.2"],"app包":["41.3"],"optimization":["43.0"],"minimize":["43.0"],"minimizer":["43.0"],"new":["43.0"],"minify":["43.0"],"uglifyjsminify":["43.0"],"terseroptions":["43.0"],"options":["43.0"],"will":["43.0"],"子应用的":["44.3"],"进一步定位抛错位置":["44.5"],"singlespa":["44.6"],"则更加灵活":["44.6"],"科学review":["45.0"],"中文词典搜索":["45.1"],"添加全文索引":["45.1"],"regexp和like使用了表扫描而不是索引":["45.1"],"但对中文不友好":["45.1"],"搜索不到":["45.1"],"所以用like匹配":["45.1"],"alter":["45.1"],"table":["45.1"],"dics":["45.1"],"发音":["45.2"],"tablelogic":["45.4"],"current":["45.5"],"size":["45.5"],"httpservletrequest":["45.5"],"from":["45.6"],"rdic":["45.6"],"custom":["45.6"],"words":["45.6"],"增长趋势较好":["46.1"],"install":["46.2"],"ps1":["46.2"],"安装":["46.2"],"jdk17":["46.2"],"choco":["46.2"],"y":["46.2"],"microsoft":["46.2"],"openjdk17":["46.2"],"platform":["47.0"],"tools":["47.0"],"主进程设置了一个messagechannel":["49.1"],"分发给不同的渲染进程":["49.1"],"进程间通信":["49.1"],"vo":["50.2"],"有代码提示":["50.6"],"status":["50.7"],"sex":["50.8"],"idnumber":["50.8"],"number":["50.8"],"全局样式覆盖":["52.0"],"什么时候执行渲染":["53.1"],"在事件循环的任务队列执行完毕后进行的":["53.1"],"如何确保dom已经更新":["53.1"],"而不是虚拟dom更新":["53.1"],"双requestanimationframe":["53.1"],"github":["53.1"],"twickstrom":["53.1"],"vue":["53.1"],"force":["53.1"],"next":["53.1"],"tick":["53.1"],"blob":["53.1"],"master":["53.1"],"src":["53.1"],"以下是自己测试之后的总结":["53.4"],"filepath":["54.0"],"ylh":["54.0"],"blog":["54.0","65.0"],"kb":["54.4"],"报错":["54.4"],"console":["54.4"],"error":["54.4"],"missing":["54.4"],"parent":["54.4"],"同时":["54.5"],"还可以考虑使用纹理压缩格式":["54.5"],"如draco":["54.5"],"压缩算法":["54.5"],"dds或astc":["54.5"],"以减少文件大小":["54.5"],"安装revit":["54.7"],"按住空格":["54.17"],"熟悉常用算法数据结构设计模式":["54.19"],"有良好的编程习惯":["54.19"],"熟练掌握基本的线性代数":["54.19","54.20"],"几何":["54.19"],"图形学和渲染技术":["54.19"],"cpu和gpu的性能优化方法":["54.20"],"提供commit":["54.21"],"过程中完善":["54.21"],"或许blender建模后支出video":["54.23"],"整体对客户端来说":["54.23"],"服务号必须通过微信认证":["55.1"],"绑定服务号或者订阅号的微信公众号id":["55.2"],"补充该字段":["56.3"],"每个实例都对应有自己的一把锁":["56.4"],"this":["56.4"],"远程调用失败":["56.5"],"string":["56.6"],"encryptpassword":["56.6"],"digestutils":["56.6"],"md5digestashex":["56.6"],"salt":["56.6"],"userpassword":["56.6"],"getbytes":["56.6"],"分配":["56.6"],"accesskey":["56.6"],"secretkey":["56.6"],"electron":["57.0"],"react":["57.0"],"native":["57.0"],"element":["57.0"],"ui组件库源码阅读":["57.0"],"分析":["57.0"],"qiankun源码":["57.0"],"阅读":["57.0"],"后端技术沉淀":["57.0"],"项目":["57.0"],"renegotiate落地语音通话转视频通话的处理":["58.1"],"自己前后端":["58.1"],"部署做了rdic":["58.1"],"这个应用":["58.1"],"支持自建单词本":["58.1"],"支持共享":["58.1"],"修改":["58.1"],"单词发音的应用":["58.1"],"针对小孩子学英语的场景":["58.1"],"团队管理协调":["58.2"],"团队进度滞后":["58.2"],"只是自己默默承担":["58.2"],"不敢分bug":["58.2"],"需求做的糙":["58.3"],"思路是正确":["58.3"],"当然需要再深度加工产出博客":["58.4"],"生活方面":["58.4"],"english":["58.4"],"first":["58.4"],"练刀工":["58.4"],"厨艺精进":["58.4"],"每周2次运动":["58.4"],"难点":["59.5"],"选型":["59.5"],"团队成员好上手":["60.1"],"落地":["60.1"],"seo不收录问题解决":["60.1"],"主动提交":["60.1"],"sitemap":["60.1"],"robots正确配置":["60.1"],"footer":["60.1"],"link标签":["60.1"],"增加内链与外链":["60.1"],"构建组件库":["60.2"],"qiankun":["60.2"],"webcomponent方案":["60.2"],"京东的":["60.2"],"iframe方案":["60.2"],"路由方案":["60.2"],"用微前端分目的是分割功能单元":["60.2"],"精简代码库":["60.2"],"控制发版单元":["60.2"],"长期可迭代":["60.2"],"技术无关性":["60.2"],"你滚动一下就滚动了整个屏幕":["60.3"],"可以观察小红书":["60.3"],"限制了只能滚动":["60.3"],"没有滚动条":["60.3"],"所有图片加载完成之后进入页面":["60.4"],"支持透传slot":["60.5"],"太生硬":["60.6"],"hope":["61.0"],"seo友好":["61.0"],"unzip":["62.0"],"zip":["62.0"]},{"0":["34.2","45.5"],"1":["13.10"],"2":["13.17","29.3","38.1","41.2","49.1"],"3":["41.2","60.1"],"4":["35.3","54.19"],"5":["11.0","35.1","35.3","54.19","56.6"],"8":["13.16"],"75":["24.2"],"159":["24.2"],"170":["24.2"],"used":["0.0"],"to":["0.0","13.9","43.0"],"access":["0.0"],"site":["0.0"],"theme":["0.0"],"and":["0.0"],"full":["0.9"],"list":["0.9"],"run":["1.2"],"llama3":["1.2"],"commandline":["2.0"],"no":["2.0","36.2"],"ico":["3.4"],"供应链":["4.0"],"资金":["4.0"],"sh":["5.0"],"自己需要执行的脚本添加之后保存":["5.0"],"nano":["5.0"],"on":["6.1","32.1","36.4"],"整体表结构的sql":["7.0"],"使用花生壳免费版":["8.0"],"模型能力提高10背后":["9.1"],"会颠覆掉":["9.1"],"发展模型的alignment":["9.1"],"opinion":["9.1"],"mining":["9.1"],"可以声明为静态变量":["10.0"],"工具类":["10.0"],"在编写工具类时":["10.0"],"通常会使用静态变量":["10.0"],"命令":["11.0"],"h":["11.0"],"如果忘记设置时区":["11.0"],"打开设置中的script":["11.0"],"github":["12.0","13.13","43.0"],"p":["13.7"],"test":["13.7"],"italic":["13.8"],"right":["13.9","36.4"],"next":["13.9"],"easy":["13.10"],"ordered":["13.10"],"lorem":["13.10"],"ipsum":["13.10"],"dolor":["13.10"],"sit":["13.10"],"amet":["13.10"],"consectetur":["13.10"],"adipiscing":["13.10"],"fences":["13.11"],"sample":["13.11"],"text":["13.11","40.2"],"here":["13.11"],"columns":["13.12"],"com":["13.13","43.0"],"nodeca":["13.13"],"in":["13.14"],"the":["13.14"],"document":["13.14"],"defining":["13.14"],"very":["13.15"],"effective":["13.15"],"see":["13.16"],"how":["13.16"],"definition":["13.20"],"duplicated":["13.20"],"reference":["13.20"],"third":["13.21"],"paragraph":["13.21"],"entries":["13.22"],"like":["13.22"],"xxxhtmlyyy":["13.22"],"dragons":["13.23"],"调用hello":["14.1"],"cc":["14.1"],"代码":["14.1"],"javascript":["14.1","49.1"],"gyp":["14.2"],"微调需要":["15.0"],"上千上万条数据":["15.0"],"能处理更复杂的问题":["15.0"],"你是一个很知名的开源软件的核心开发人员":["16.0"],"或是你是某知名公司核心项目的核心开发人员":["16.0"],"等等":["16.0"],"关注技术趋势":["16.0"],"找到能体现价值的地方":["16.0"],"prod":["18.0"],"ib":["19.0"],"cloudapigateway":["19.0"],"autoconfigure":["19.0"],"autoconfigures":["19.0"],"framework":["19.0","40.1"],"学习记录":["21.0"],"tools":["21.0"],"页面排版混乱":["22.0"],"工作队列":["23.1"],"在一个电商平台的后端系统中":["23.1"],"spring框架":["23.2"],"核心实现":["23.2"],"同时避免过多的线程闲置":["23.3"],"技术实现":["23.3","23.4"],"在spring框架中":["23.3"],"以及数据库连接池等外部资源的限制":["23.4"],"可以通过设置queuecapacity属性来指定工作队列的大小":["23.5"],"难点解决":["23.5"],"避免因队列溢出而导致的订单丢失或系统性能下降":["23.5"],"常规单词本功能":["24.1"],"数据流转清晰":["25.0"],"因为定位元素会创建一个新的包含块":["26.0"],"如果元素的祖先元素中没有定位元素":["26.0"],"i":["28.0","62.0"],"t":["28.0"],"input":["29.1"],"图片上传组件":["29.1"],"简略列表":["29.2"],"单个sku表单":["29.2"],"重写校验方法":["29.3"],"studio中command":["31.0"],"tool需要使用8":["31.0"],"安装dockerfile":["32.0"],"安装dockercompose":["32.0"],"可按照此加密套件配置":["32.1"],"写法遵循":["32.1"],"openssl":["32.1"],"标准":["32.1"],"prefer":["32.1"],"root":["32.1"],"index":["32.1","45.1","53.1"],"location":["32.1"],"alias":["32.1"],"try":["32.1"],"files":["32.1"],"uri":["32.1"],"meeting":["34.0"],"net":["34.2","40.1"],"documentation":["34.2"],"一路点安装即可":["34.4"],"启动freeswitch":["34.5"],"支持版本回滚":["35.1"],"降低了部署风险":["35.1"],"云原生和微服务":["35.1"],"为微服务架构提供了理想的编排平台":["35.1"],"支持服务发现":["35.1"],"负载均衡和灵活部署":["35.1"],"cri":["35.2"],"路径下":["35.3"],"配置网络":["35.3"],"会为每个":["35.3"],"分配一个集群内部的":["35.3"],"ip":["35.3"],"地址":["35.3"],"并设置适当的网络规则":["35.3"],"以便":["35.3"],"之间可以相互通信":["35.3"],"启动":["35.3"],"会创建一个":["35.3"],"loadbalancer":["35.3"],"pod是kubernetes中调度和管理的基本单位":["35.5"],"container是pod中的工作负载单元":["35.5"],"存储的是实际的数据":["36.1"],"因此":["36.1"],"表本身就是按照主键聚集的":["36.1"],"查询性能":["36.1"],"在读取方面的性能较好":["36.1"],"但在写入和并发性能方面相对较弱":["36.1"],"在写入和并发性能方面更强":["36.1"],"但读取速度稍慢":["36.1"],"表行数统计":["36.1"],"保存有表的总行数":["36.1"],"可以直接使用":["36.1"],"auto":["36.2"],"create":["36.2"],"user":["36.2","50.8"],"having":["36.3","36.5"],"筛选goup":["36.3","36.5"],"by的子句":["36.3","36.5"],"创建新的聚合字段":["36.3","36.5"],"c":["36.4"],"inner":["36.4"],"条件连接":["36.4"],"数量是两表的交际":["36.4"],"outer":["36.4"],"left":["36.4","45.6"],"和":["36.4"],"包括":["36.4"],"两种类型":["36.4"],"它们分别表示查询左表和右表的所有行":["36.4"],"即使没有被匹配":["36.4"],"再加上满足条件的交集部分":["36.4"],"左表或者右表长度":["36.4"],"加上交集":["36.4"],"实现right":["36.4"],"主表":["36.4"],"关联表顺序需要调换":["36.4"],"这可能导致代码难以理解":["38.0"],"维护和调试":["38.0"],"可移植性差":["38.0"],"位运算的结果可能依赖于底层的二进制表示和硬件架构":["38.0"],"在不同的平台和环境中":["38.0"],"位运算的结果可能不一致":["38.0"],"导致代码在不同环境下表现不同":["38.0"],"全局自动前端刷新token":["38.1"],"和vo":["38.3"],"api":["39.1","54.21"],"因此速度更快":["40.1"],"性能更高":["40.1"],"支持更广泛":["40.1"],"com加载项支持更广泛":["40.1"],"只需要有对应的":["40.1"],"vsto":["40.1"],"runtime运行环境":["40.1"],"有更好的word":["40.1"],"textbutton":["40.2"],"按钮1":["40.2"],"screentip":["40.2"],"onaction":["40.2"],"ontextbutton":["40.2"],"supertip":["40.2"],"inserts":["40.2"],"坑":["40.4"],"安装可配置注册表":["40.5"],"依赖项":["40.5"],"true":["40.7"],"业务服务端":["41.1"],"调用documentbuilder解析word文件":["41.1"],"用户连接或断开连接时":["41.2"],"文档已准备好保存":["41.2"],"用户完成编辑并准备保存文档时":["41.2"],"v到docker内即可":["41.3"],"be":["43.0"],"passed":["43.0"],"link":["43.0"],"https":["43.0"],"mishoo":["43.0"],"uglifyjs":["43.0"],"按照顺序拿出来":["44.3"],"尝试捕获到之后重试":["44.5"],"它并没有内置的状态管理功能":["44.6"],"而是鼓励开发者使用其他流行的状态管理库":["44.6"],"互动式学英语":["45.0"],"add":["45.1"],"fulltext":["45.1"],"content":["45.1"],"ftindex":["45.1"],"translation":["45.1"],"select":["45.1"],"from":["45.1"],"加入分享":["45.2"],"private":["45.4"],"request":["45.5"],"if":["45.5"],"throw":["45.5"],"new":["45.5"],"businessexception":["45.5"],"errorcode":["45.5"],"params":["45.5"],"error":["45.5"],"cw":["45.6"],"join":["45.6"],"社区活跃度较高":["46.1"],"js技术栈":["46.1"],"需要注意的是":["46.2"],"如果需要编译ios应用":["46.2"],"则需要":["46.2"],"安装xcode":["46.2"],"macos虚拟机":["46.2"],"build":["46.2","50.7"],"repositories":["46.2"],"maven":["46.2"],"url":["46.2"],"command":["47.0"],"line":["47.0"],"tools三者":["47.0"],"amazon":["48.2"],"corretto":["48.2"],"worker进程":["49.1"],"避免主进程中继":["49.1"],"其他功能":["50.6"],"官网文档":["50.6"],"相当于":["50.7"],"updatetime":["50.8"],"time":["50.8"],"updateuser":["50.8"],"alive的问题":["53.0"],"js":["53.1","54.0"],"在vue中":["53.1"],"渲染阶段是在事件循环的任务队列执行完毕后进行的":["53.1"],"如果一次事件循环中":["53.1"],"调用了nexttick":["53.1"],"传入了回调":["53.1"],"那么nexttick改变的值会在":["53.1"],"在dom更新队列被刷新之后执行回调函数":["53.1"],"dom更新队列刷新之后":["53.1"],"并不一定会进入渲染阶段":["53.1"],"如果nexttick中":["53.1"],"还有微任务":["53.1"],"那么会等微任务执行完了之后再渲染相关的dom更新队列":["53.1"],"当vue检测到需要进行重新渲染时":["53.1"],"它会将渲染的任务添加到任务队列中":["53.1"],"该任务会在当前任务执行完毕后立即执行":["53.1"],"unref是获取引用值":["53.4"],"但并不会递归获取":["53.4"],"blogs":["54.0"],"coding":["54.0"],"learning":["54.0"],"record":["54.0"],"three":["54.0"],"mesh":["54.4"],"draco":["54.4"],"移除不必要的数据":["54.5"],"在gltf":["54.5"],"glb文件中":["54.5"],"可能包含一些不必要的数据":["54.5"],"如动画":["54.5"],"骨骼":["54.5"],"材质等":["54.5"],"mp":["54.7","57.0"],"weixin":["54.7"],"加速跑动":["54.17"],"及常见显示效果的实现方式":["54.19"],"了解web图形领域":["54.19"],"cpu和gpu端的性能优化方法":["54.19"],"熟悉web技术栈":["54.19"],"几何":["54.20"],"图形学和渲染技术":["54.20"],"webgl":["54.21"],"体积最小":["54.23"],"效果最好":["54.23"],"才可以开通微信支付":["55.2"],"不同实例之间互不影响":["56.4"],"例外":["56.4"],"digestutil":["56.6"],"md5hex":["56.6"],"randomutil":["56.6"],"randomnumbers":["56.6"],"rdic词典":["57.0"],"分类":["57.0"],"分享加入":["57.0"],"微信公众号登录":["57.0"],"过程中":["57.0"],"plus":["57.0"],"redis":["57.0"],"熟悉好":["57.0"],"背背八股文":["57.0"],"换成邮箱登陆":["57.0"],"技术栈spring":["58.1"],"boot":["58.1"],"vue3":["58.1","60.2"],"ts":["58.1"],"微前端调研":["58.1"],"qiankun项目落地":["58.1"],"wsl":["58.1"],"nginx部署":["58.1"],"微前端权限管理设计落地":["58.1"],"不敢问成员进度":["58.2"],"怕招人口舌":["58.2"],"封装组件":["58.2"],"缺少大的整体规划":["58.2"],"效率也ok":["58.3"],"但得深入点细节和产品":["58.3"],"改掉臭毛病":["58.4"],"做的不对的时候":["58.4"],"需要承认不行":["58.4"],"不自夸":["58.4"],"不给别人负面的评价":["58.4"],"关注家人的心理健康":["58.4"],"定期组织集体的运动":["58.4"],"sse":["59.5"],"轮询":["59.5"],"收录meta方式无法收录":["60.1"],"因为meta多了data":["60.1"],"属性":["60.1"],"域名下放认证文件的模式":["60.1"],"落地":["60.2"],"vue2":["60.2"],"history控制权冲突":["60.2"],"同时有两个实例时":["60.2"],"弹窗应用使用虚拟路由":["60.2"],"部署":["60.2"],"运维用k8s不熟":["60.2"],"混淆了redirect与tryfiles":["60.2"],"微博":["60.3"],"从上往下时":["60.3"],"nexttick中节点渲染好了就把container高度固定死":["60.3"],"滑动过快到底部往上走":["60.3"],"高度跳变":["60.3"],"总结":["60.4"],"attrs":["60.5"],"用户接受程度":["60.6"],"chrome插件":["60.6"],"框架无关":["61.0"],"astro":["61.0"],"其他同学":["61.0"],"ubuntu安装deb包":["62.0"],"sudo":["62.0"],"dpkg":["62.0"],"package":["62.0"],"pages":["65.0"]},{"0":["31.0"],"1":["53.1"],"2":["18.0","47.0","53.1"],"3":["13.10","53.1"],"4":["41.2","54.5","56.6"],"5":["60.2"],"6":["35.1","35.3","54.19"],"8":["48.2","56.6"],"105":["24.2"],"232":["48.2"],"301":["32.1"],"373":["19.0"],"2023":["54.17"],"8880":["24.2"],"data":["0.0"],"for":["0.0"],"current":["0.0"],"of":["0.9"],"70b":["1.2"],"gradio":["2.0"],"queue":["2.0"],"api":["2.0","24.2","34.2","54.19"],"360w以太币":["3.4"],"供应商货物":["4.0"],"品质稳定":["4.0"],"快捷键":["5.0"],"ctrl":["5.0"],"x":["5.0","34.2"],"wechat":["6.1"],"使用":["7.0"],"dialogue":["9.1"],"这些能力":["9.1"],"才是未来":["9.1"],"ai出现后":["9.1"],"比如":["10.0"],"一个数学计算工具类中可能包含一些常用的数学常数":["10.0"],"这些常数可以声明为静态变量":["10.0"],"计数器":["10.0"],"console":["11.0","43.0"],"system":["11.0"],"setproperty":["11.0"],"org":["11.0"],"apache":["11.0"],"each":["13.9"],"other":["13.9"],"or":["13.9"],"elit":["13.10"],"integer":["13.10","45.4"],"molestie":["13.10"],"massa":["13.10"],"you":["13.10"],"can":["13.10"],"syntax":["13.11"],"highlighting":["13.11"],"js":["13.11","57.0"],"var":["13.11","14.1"],"foo":["13.11"],"pica":["13.13"],"enable":["13.13"],"url":["13.14"],"location":["13.14","40.2"],"https":["13.14","32.1"],"support":["13.15"],"to":["13.16"],"change":["13.16"],"o":["13.17","35.2"],"footnotecan":["13.20"],"have":["13.20"],"compact":["13.21"],"style":["13.21"],"and":["13.22"],"so":["13.22"],"on":["13.22","45.6"],"addon":["14.1"],"require":["14.1"],"bindings":["14.1"],"法律文书撰写":["15.0"],"公文撰写":["15.0"],"成为一个好的leader":["16.0"],"帮人解决问题":["16.0"],"被人依赖":["16.0"],"能做关键决定":["16.0"],"开放心态":["16.0"],"倾向性价值观":["16.0"],"build":["18.0"],"application":["18.0"],"client":["19.0"],"user":["19.0"],"好用的工具":["21.0"],"线索第二次进入":["22.0"],"假设我们需要设计一个用于处理订单的自定义线程池":["23.1"],"自定义线程池用于管理订单处理的并发执行":["23.2"],"重点难点":["23.2"],"可以使用threadpooltaskexecutor来创建自定义线程池":["23.3"],"并通过设置corepoolsize属性来指定核心线程数":["23.3"],"在threadpooltaskexecutor中":["23.4"],"可以通过设置maxpoolsize属性来指定最大线程数":["23.4"],"需要根据系统负载和任务处理时间来动态调整工作队列的大小":["23.5"],"并采取适当的任务拒绝策略":["23.5"],"查词":["24.1"],"代码逻辑":["25.0"],"offsettop就是相对于":["26.0"],"html":["26.0"],"p":["28.0"],"总的组件数有上万个":["29.1"],"同上2":["29.2"],"引入validate":["29.3"],"读取elform下面的elformitem数据":["29.3"],"apk安装包":["31.0"],"获取ssl证书":["32.0"],"填写您的证书绑定的域名":["32.1"],"例如":["32.1"],"cloud":["32.1"],"tencent":["32.1"],"return":["32.1"],"host":["32.1"],"request":["32.1"],"将http的域名请求转成https":["32.1"],"shell":["32.1"],"sh":["32.1"],"down":["32.1"],"getnameen":["33.0"],"webrtc":["34.0"],"session":["34.2"],"用管理员方式运行":["34.4"],"管理员方式启动":["34.5"],"可以无缝地与其他云原生工具":["35.1"],"如prometheus":["35.1"],"istio等":["35.1"],"集成":["35.1"],"构建完整的云原生应用程序堆栈":["35.1"],"类型的":["35.3"],"并将其与":["35.3"],"关联":["35.3"],"该":["35.3"],"会获取一个集群外部可访问的":["35.3"],"并将流量转发到后端":["35.3"],"自动扩缩容":["35.3"],"如果应用程序负载发生变化":["35.3"],"可以根据":["35.3"],"中定义的副本数量":["35.3"],"它包含了应用程序代码和所需的依赖库":["35.5"],"每个container都是隔离的":["35.5"],"拥有自己的文件系统":["35.5"],"select":["36.1"],"count":["36.1"],"from":["36.1"],"table":["36.1"],"获取":["36.1"],"没有保存表的总行数":["36.1"],"因此在使用":["36.1"],"时会遍历整个表":["36.1"],"消耗较大":["36.1"],"engine":["36.2"],"substitution":["36.2"],"推荐sql学习":["36.2"],"sum":["36.3","36.5"],"rank":["36.3","36.5"],"开窗函数":["36.3","36.5"],"中分组":["36.3"],"分数":["36.4"],"使用子查询的方式来获取存在对应班级的学生的所有数据":["36.4"],"返回学生姓名":["36.4"],"字段":["36.4"],"in":["36.4","45.1"],"是否存在":["36.4"],"exists":["36.4"],"子查询的方式来获取":["36.4"],"不存在对应班级的":["36.4"],"学生的所有数据":["36.4"],"难以调试":["38.0"],"由于位运算操作是直接在二进制位上进行的":["38.0"],"调试过程中很难直观地观察和理解中间结果":["38.0"],"这可能增加调试的复杂性和困难度":["38.0"],"综上所述":["38.0"],"位运算在":["38.0"],"javascript":["38.0"],"react":["38.1"],"value":["38.3"],"声明式router":["39.1"],"wps客户端兼容性":["40.1"],"可定制性更强":["40.1"],"com加载项可以使用本地编程语言进行开发":["40.1"],"支持更多的编程语言特性和库函数":["40.1"],"发布受厂商限制少3":["40.1"],"采用的技术选型":["40.1"],"com加载项":["40.1"],"结合webview":["40.1"],"优势":["40.1"],"at":["40.2"],"the":["40.2"],"cursor":["40.2"],"tablebutton":["40.2"],"按钮2":["40.2"],"代码证书":["40.4"],"一套代码":["40.5"],"打包后一次性安装":["40.5"],"wps":["40.7"],"用户端服务":["41.1"],"发生文档保存错误":["41.2"],"在尝试保存文档时出现错误":["41.2"],"文档已关闭":["41.2"],"compress":["43.0"],"drop":["43.0"],"debugger":["43.0"],"pure":["43.0"],"funcs":["43.0"],"然后用fetch":["44.3"],"如":["44.6"],"redux":["44.6"],"场景例句巩固":["45.0"],"where":["45.1","50.8"],"match":["45.1"],"against":["45.1"],"润":["45.1"],"boolean":["45.1"],"mode":["45.1"],"私有单词库":["45.2"],"默认所有人可以编辑":["45.2"],"dicspage":["45.5"],"调用mybatis":["45.5"],"plus包装的mapper接口":["45.5"],"dics":["45.6"],"wordid":["45.6"],"总的来说":["46.1"],"不分伯仲":["46.1"],"aliyun":["46.2"],"com":["46.2","54.7","60.1"],"repository":["46.2"],"public":["46.2"],"android":["47.0"],"不报错了":["47.0"],"09":["48.2"],"const":["49.1"],"new":["49.1","50.7"],"browserwindow":["49.1"],"后端的代码":["50.6"],"status":["50.8"],"添加配置之后":["50.8"],"解决方案":["53.0"],"路由拍平":["53.0"],"一旦进入渲染阶段":["53.1"],"vue会执行以下操作":["53.1"],"比对虚拟dom":["53.1"],"virtual":["53.1"],"dom":["53.1"],"vue会比对当前的虚拟dom和上一次渲染时的虚拟dom":["53.1"],"找出两者之间的差异":["53.1"],"执行dom更新":["53.1"],"根据比对的结果":["53.1"],"vue会将需要更新的dom元素添加到更新队列中":["53.1"],"执行异步更新":["53.1"],"vue会将dom更新操作放入微任务队列中":["53.1"],"以便在当前任务执行完毕后立即执行":["53.1"],"toraw是获取响应式对象的原始对象":["53.4"],"md":["54.0"],"description":["54.0"],"这是默认设置":["54.0"],"请设置":["54.0"],"custommade":["54.0"],"打开korofileheader查看配置":["54.0"],"进行设置":["54.0"],"draco算法优化":["54.4"],"如果你的应用程序不需要这些数据":["54.5"],"可以考虑在导出模型时将其移除":["54.5"],"以减小文件大小":["54.5"],"优化模型结构":["54.5"],"检查模型的结构":["54.5"],"确保没有重复的顶点或面片":["54.5"],"qq":["54.7"],"06":["54.17"],"及webgl":["54.19"],"有较强的学习能力":["54.19"],"问题分析与解决能力":["54.19"],"热爱技术和软件开发":["54.19"],"加分项":["54.19"],"及常见显示效果的实现方式":["54.20"],"了解rust":["54.20"],"rust":["54.21"],"webassembly":["54.21"],"图形学":["54.21"],"如果没有复杂交互":["54.23"],"锁对象是":["56.4"],"class以及synchronized修饰的是static方法的时候":["56.4"],"所有对象公用同一把锁":["56.4"],"插入数据":["56.6"],"setuseraccount":["56.6"],"setuserpassword":["56.6"],"前端项目沉淀":["57.0"],"next":["57.0"],"项目脚手架":["57.0"],"headless":["57.0"],"ui组件库":["57.0"],"选择开源项目细分领域":["57.0"],"给领域知名项目提pr":["57.0"],"可以从bug修复开始":["57.0"],"参与知名项目的技术事务":["57.0"],"读完了":["58.1"],"vue":["58.1"],"js设计与实现":["58.1"],"react技术揭秘":["58.1"],"深入浅出electron原理":["58.1"],"工程与实践":["58.1"],"等书籍":["58.1"],"antd":["58.1"],"如设计机构saas中的组件库规划":["58.2"],"过于专注于技术测":["58.2"],"但缺少对产品本身":["58.2"],"交互的钻研":["58.2"],"测试对好":["58.3"],"从同事":["58.3"],"露营":["58.4"],"短途旅行":["58.4"],"给家人做饭":["58.4"],"新家装修":["58.4"],"风格":["58.4"],"整体方案确认":["58.4"],"初步定设计图":["58.4"],"ws":["59.5"],"用户反馈登录态过期":["60.1"],"实际上www":["60.1"],"abc":["60.1"],"com访问和abc":["60.1"],"com存的cookie":["60.1"],"domain分别是":["60.1"],"和abc":["60.1"],"element冲突主应用":["60.2"],"elemtnplus":["60.2"],"基座影响子应用":["60.2"],"解决方式是对子应用postcss":["60.2"],"依赖包处理增加prevfix处理":["60.2"],"也可以主应用本身cs也用打包工具处理":["60.2"],"加scoped或者前缀":["60.2"],"发版时已经加载的页面":["60.2"],"白屏问题":["60.3"],"小红书的瀑布流虚拟列表":["60.3"],"直接把滚动条隐藏了":["60.3"],"只能滑轮滚":["60.3"],"rem有局限性吗":["60.4"],"props等":["60.5"],"分发问题":["60.6"],"多主题":["61.0"],"配置ui":["61.0"],"deb":["62.0"],"杀掉8888端口应用":["62.0"],"lsof":["62.0"]},{"1":["54.4"],"2":["40.4"],"4":["53.1","57.0"],"5":["53.1","54.5"],"6":["41.2"],"7":["35.3"],"8":["35.3"],"12":["19.0"],"13":["19.0"],"15":["54.17"],"30":["19.0"],"41":["19.0"],"46":["54.4"],"241":["19.0"],"349":["19.0"],"2024":["19.0"],"3306":["28.0"],"8888":["62.0"],"it":["0.0"],"works":["0.0"],"in":["0.0"],"both":["0.0"],"md":["0.0"],"runtime":["0.9"],"apis":["0.9"],"rest":["1.2"],"api就启动好在本地了":["1.2"],"http":["1.2"],"xformers":["2.0"],"打开文档":["2.0"],"防止梯子问题":["2.0"],"结论传统产业":["4.0"],"也ok":["4.0"],"y":["5.0","32.1"],"保存":["5.0"],"选择性update":["7.0"],"做模型是没有意义的":["9.1"],"就像iphone出来后":["9.1"],"大量的山寨手机":["9.1"],"很快就会被市场淘汰":["9.1"],"静态变量可以用于跟踪类的实例创建了多少次":["10.0"],"或者用于记录某个事件发生的次数":["10.0"],"总的来说":["10.0","35.1"],"静态变量适合用于表示类级别的属性":["10.0"],"commons":["11.0"],"jelly":["11.0"],"tags":["11.0"],"fmt":["11.0"],"timezone":["11.0"],"link":["12.0"],"smartypants":["13.7"],"double":["13.7"],"quotes":["13.7"],"and":["13.7"],"with":["13.9","13.16","19.0"],"spaces":["13.9"],"between":["13.9"],"use":["13.10","19.0","48.2"],"sequential":["13.10"],"numbers":["13.10"],"keep":["13.10","58.4"],"all":["13.10","36.4"],"the":["13.10"],"as":["13.10"],"function":["13.11"],"bar":["13.11"],"return":["13.11"],"console":["13.11","14.1"],"linkify":["13.13"],"to":["13.13"],"octodex":["13.14"],"github":["13.14","36.2","54.0"],"com":["13.14","36.2"],"dojocat":["13.14"],"syntax":["13.15"],"output":["13.16","43.0"],"markupand":["13.20"],"multiple":["13.20"],"paragraphs":["13.20"],"hyper":["13.22"],"text":["13.22"],"hello":["14.1"],"log":["14.1","43.0"],"等领域模型":["15.0"],"上下文提示":["15.0"],"热情":["16.0"],"冲劲":["16.0"],"抓住重点":["16.0"],"看透本质":["16.0"],"能画饼":["16.0"],"yml中添加占位":["18.0"],"yml":["18.0"],"spring":["18.0","19.0"],"name":["18.0"],"wxmp":["18.0"],"默认":["18.0"],"artifact":["19.0"],"hibernate":["19.0"],"validator":["19.0"],"final":["19.0"],"has":["19.0"],"been":["19.0"],"relocated":["19.0"],"default":["19.0"],"deleting":["19.0"],"target":["19.0"],"utf":["19.0"],"encoding":["19.0"],"copy":["19.0"],"filtered":["19.0"],"copying":["19.0"],"compiler":["19.0"],"compile":["19.0"],"detected":["19.0"],"recompiling":["19.0"],"module":["19.0"],"compiling":["19.0"],"source":["19.0"],"files":["19.0"],"classes":["19.0"],"src":["19.0"],"main":["19.0"],"executor":["19.0"],"namedthreadfactory":["19.0"],"uses":["19.0"],"or":["19.0"],"overrides":["19.0"],"deprecated":["19.0"],"that":["19.0"],"marked":["19.0"],"removal":["19.0"],"recompile":["19.0"],"xlint":["19.0"],"details":["19.0"],"controller":["19.0"],"institutionreportskucontroller":["19.0"],"input":["19.0"],"unchecked":["19.0"],"unsafe":["19.0"],"operations":["19.0"],"testresources":["19.0"],"not":["19.0"],"testcompile":["19.0"],"sources":["19.0"],"surefire":["19.0"],"tests":["19.0"],"are":["19.0"],"skipped":["19.0"],"repackage":["19.0"],"replacing":["19.0"],"repackaged":["19.0"],"archive":["19.0"],"installing":["19.0"],"pom":["19.0"],"success":["19.0"],"total":["19.0"],"time":["19.0"],"finished":["19.0"],"02":["19.0"],"07t08":["19.0"],"08":["19.0"],"00":["19.0"],"cp":["19.0"],"rf":["19.0"],"anything":["21.0"],"分享一些代码":["21.0"],"没有请求html":["22.0"],"最大线程数和工作队列的设计时需要注意":["23.1"],"保证订单处理的高并发和可靠性":["23.2"],"避免资源竞争和订单丢失":["23.2"],"难点解决":["23.3","23.4"],"通过监控订单请求量和系统资源利用率":["23.3"],"避免因线程过多而导致资源竞争或内存溢出的问题":["23.4"],"通过以上的结构化设计考量":["23.5"],"可以设计出一个高效":["23.5"],"稳定的订单处理线程池":["23.5"],"发音":["24.1"],"translate":["24.2"],"getresult":["24.2"],"query":["24.2"],"越少分支越好":["25.0"],"元素的":["26.0"],"所以offsettop是相对于最近的定位祖先元素":["26.0"],"页面性能问题严重":["29.1"],"200多个物料的场景就卡的动不了":["29.1"],"总结":["29.2","59.5","60.1","60.2"],"多了个":["29.2"],"不定高度虚拟列表处理":["29.2"],"拿到需要校验的validator":["29.3"],"循环列表传入数据":["29.3"],"点击下载":["31.0"],"git仓库":["31.0"],"sl证书解析配置":["32.0"],"stop":["32.1"],"f":["32.1"],"rm":["32.1"],"rmi":["32.1"],"up":["32.1"],"updatedist":["32.1"],"mv":["32.1"],"backup":["32.1"],"date":["32.1"],"m":["32.1"],"update":["33.0"],"entity的方法":["33.0"],"是一个webrtc的封装库":["34.0"],"javascript":["34.2"],"替换轨道":["34.2"],"7443的端口":["34.5"],"供应商无关性":["35.1"],"kubernetes可以运行在各种环境中":["35.1"],"包括本地数据中心":["35.1"],"公有云和私有云":["35.1"],"提供了环境抽象和可移植性":["35.1"],"kubernetes通过自动化":["35.1"],"等":["35.2","44.6"],"自动水平扩展或缩容":["35.3"],"实例数量":["35.3"],"自动恢复":["35.3"],"如果某个":["35.3"],"出现故障":["35.3"],"会自动重新创建一个新的":["35.3"],"以保持应用程序的运行状态":["35.3"],"滚动更新":["35.3"],"当需要更新应用程序时":["35.3"],"支持滚动更新策略":["35.3"],"可以一次更新一部分":["35.3"],"cpu":["35.5"],"内存和进程空间":["35.5"],"一个pod可以包含一个或多个container":["35.5"],"但在加了":["36.1"],"where":["36.1","45.6"],"条件后":["36.1"],"处理方式相同":["36.1"],"总之":["36.1"],"如果你的应用需要事务支持":["36.1"],"外键约束以及更好的并发性能":["36.1"],"如果你对读取速度和全文索引有更高的要求":["36.1"],"或者处理静态数据":["36.1"],"https":["36.2","54.0"],"liyupi":["36.2"],"partition":["36.3","36.4","36.5"],"by":["36.3","36.5"],"union":["36.3","36.4","36.5"],"包括两种常见的组合查询操作":["36.4"],"操作":["36.4"],"它用于将两个或多个查询的结果集合并":["36.4"],"并去除重复的行":["36.4"],"即如果两个查询的结果有相同的行":["36.4"],"则只保留一行":["36.4"],"它也用于将两个或多个查询的结果集合并":["36.4"],"但不去除重复的行":["36.4"],"则全部保留":["36.4"],"还有一个新学生表":["36.4"],"new":["36.4"],"包含的字段和学生表完全一致":["36.4"],"语句":["36.4"],"获取所有学生表和新学生表的学生姓名":["36.4"],"要求保留重复的学生记录":["36.4"],"开窗函数":["36.4"],"over":["36.4"],"打个比方":["36.4"],"可以将开窗函数想象成一种":["36.4"],"透视镜":["36.4"],"它能够将我们聚焦在某个特定的分组":["36.4"],"同时还能看到整体的全景":["36.4"],"本节我们先讲第一个开窗函数":["36.4"],"该函数用法为":["36.4"],"返回每个学生的详细信息":["36.4"],"字段顺序和原始表的字段顺序一致":["36.4"],"并计算每个班级的学生平均分":["36.4"],"中分组":["36.5"],"领域具有一些优势":["38.0"],"如高效性能和节省空间":["38.0"],"然而":["38.0"],"它也存在一些缺点":["38.0"],"如可读性较差和可移植性差":["38.0"],"在使用位运算时":["38.0"],"需权衡其优势和缺点":["38.0"],"suspense":["38.1"],"都是用于在系统之间传输数据的对象":["38.3"],"便于内网部署":["40.1"],"web项目集成":["40.1"],"能同时兼容wps":["40.1"],"office":["40.1"],"web资源支持增量更新":["40.1"],"支持clickone部署":["40.1"],"一次安装":["40.1"],"后续远程自动更新":["40.1"],"难点":["40.1"],"webview":["40.1"],"table":["40.2","43.0"],"ontablebutton":["40.2"],"a":["40.2"],"自建证书不支持自动更新":["40.4"],"word":["40.5"],"wps":["40.5"],"传参给业务服务端渲染word":["41.1"],"没有任何更改":["41.2"],"用户关闭文档且未做任何更改":["41.2"],"编辑中保存":["41.2"],"用户在编辑过程中保存了文档的当前状态":["41.2"],"sourcemap":["43.0"],"false":["43.0","49.1"],"entry":["43.0"],"foo":["43.0"],"sdk文件入口":["43.0"],"请求回来":["44.3"],"按照顺序内联在子应用里面运行":["44.3"],"vuex":["44.6"],"单词本":["45.1"],"增加":["45.1"],"done":["45.1"],"单词本分享":["45.1"],"单词本分类":["45.1"],"单词本改名":["45.1"],"单词":["45.1"],"分享编辑单词库":["45.2"],"isdelete":["45.4"],"list":["45.5"],"dicslist":["45.5"],"customwordsmapper":["45.5"],"getdictionariesbyworkbookid":["45.5"],"workbookid":["45.5"],"customwordspage":["45.5"],"国际服上对flutter的技术认可度高些":["46.1"],"reactnative":["46.1"],"google":["46.2","58.1"],"project":["47.0"],"structure":["47.0"],"设置sdk为33":["47.0"],"show":["49.1"],"webpreferences":["49.1"],"nodeintegration":["49.1"],"写起来好丝滑":["50.6"],"setstatus":["50.7"],"支持别名":["50.8"],"不用引用完整路径":["50.8"],"mapper配置文件":["50.8"],"mapper":["50.8"],"locations":["50.8"],"classpath":["50.8"],"扫描包名":["50.8"],"type":["50.8"],"aliases":["50.8"],"每一层路由都需要加keepalive":["53.0"],"执行实际的dom操作":["53.1"],"在微任务队列执行时":["53.1"],"vue会遍历更新队列":["53.1"],"并根据具体的dom操作":["53.1"],"添加":["53.1"],"删除":["53.1"],"修改等":["53.1"],"对真实的dom进行操作":["53.1"],"渲染完成":["53.1"],"一旦完成dom的更新":["53.1"],"vue会触发":["53.1"],"mounted":["53.1"],"或":["53.1"],"updated":["53.1"],"会递归解开proxy对象":["53.4"],"obkoro1":["54.0"],"koro1fileheader":["54.0"],"wiki":["54.0"],"e9":["54.0"],"正常加载":["54.4"],"感兴趣的朋友可以了解一下":["54.4"],"压缩的技术":["54.4"],"优化模型结构可以减小文件大小":["54.5"],"并提高渲染性能":["54.5"],"使用压缩工具":["54.5"],"你可以使用gltf":["54.5"],"glb的压缩工具来进一步减小文件大小":["54.5"],"这些工具可以对模型进行压缩和优化":["54.5"],"s":["54.7"],"g4whbdmgnj5ol2t1d":["54.7"],"有业余开源项目供技术参考":["54.19"],"深入了解过至少一款渲染引擎的内部实现架构和技术细节":["54.19"],"了解rust":["54.19"],"webassembly":["54.20"],"webgpu等技术":["54.20"],"渲染技术":["54.21"],"几何":["54.21"],"只是循环的3d动画":["54.23"],"只根据白天晚上切换video":["54.23"],"synchronized修饰的方法":["56.4"],"setaccesskey":["56.6"],"setsecretkey":["56.6"],"boolean":["56.6"],"saveresult":["56.6"],"this":["56.6"],"save":["56.6"],"比如":["57.0"],"rfc":["57.0"],"讨论":["57.0"],"bug":["57.0"],"修":["57.0"],"成为知名项目活跃contributor":["57.0"],"成为知名项目核心成员":["57.0"],"为什么程序员要出书":["57.0"],"在行业会议演讲":["57.0"],"写系列文章":["57.0"],"g6库":["58.1"],"用":["58.1"],"svg图":["58.1"],"画类3d的图":["58.1"],"方法论":["58.1"],"重视github":["58.1"],"issue":["58.1"],"官网文档":["58.1"],"需求侧未确定导致的变动返工多":["58.2"],"技能和知识增长":["58.2"],"其实还有一些翻了一部分的书":["58.2"],"看了一部分的视频课程":["58.2"],"上级或客户那里收到了很多肯定和改进的建议":["58.3"],"对团队或公司提出了一些改进的建议":["58.3"],"todo":["58.4","60.4"],"新的一年":["58.4"],"大家都走好运":["58.4"],"looking":["58.4"],"until":["58.4"],"you":["58.4"],"find":["58.4"],"落地":["59.5"],"不一致导致的":["60.1"],"如果是不同的子域名":["60.1"],"使用oauth2":["60.1"],"做登录态共享":["60.1"],"加载了过期的已加载js":["60.2"],"请求了chunk中过期的异步加载css":["60.2"],"页面级别":["60.2"],"导致的样式错乱问题":["60.2"],"loader捕捉css加载的err":["60.2"],"ps":["60.2"],"运维手段是立即删除所有旧的资源":["60.2"],"cdn共享组件库优化":["60.2"],"多tab场景下vnode缓存todo":["60.2"],"思考":["60.2"],"并且后端接口数据中直接返回图片的宽高":["60.3"],"pc端的微博":["60.3"],"刷的过快它一定会先白屏之后再出现内容":["60.3"],"其次就是像腾讯会议里回放的文本记录":["60.3"],"每段文本记录都是item":["60.3"],"原生组件有坑":["60.5"],"谷歌市场上架":["60.6"],"onlyoffice":["60.6"],"富文本编辑器":["61.0"],"hexo":["61.0"],"kill":["62.0"],"上面的pid":["62.0"],"查看系统版本":["62.0"]},{"4":["43.0"],"5":["13.11"],"6":["54.5"],"7":["19.0","41.2","54.5"],"9":["19.0"],"57":["13.10"],"85":["54.0"],"147":["19.0"],"1364":["36.1"],"4716":["19.0"],"11434":["1.2"],"12345":["36.1"],"vue":["0.0"],"files":["0.0"],"localhost":["1.2"],"桌面端配套":["1.2"],"能开放sdui的api文档接口":["2.0"],"可以进一步二开":["2.0"],"l":["5.0"],"查看添加的定时任务":["5.0"],"数据":["9.1"],"提到自己的公司":["9.1"],"stastic":["9.1"],"这些属性对于所有实例都是相同的":["10.0"],"或者在整个程序执行期间保持不变":["10.0"],"执行":["11.0"],"留言":["12.0"],"single":["13.7"],"strikethrough":["13.8"],"arrows":["13.9"],"numbering":["13.10"],"offset":["13.10"],"foo":["13.10"],"bar":["13.10"],"log":["13.11"],"see":["13.13","19.0"],"jpg":["13.14"],"twemoji":["13.16"],"2a":["13.21"],"2b":["13.21","19.0"],"markup":["13.22"],"language":["13.22"],"world":["14.1"],"灵活":["15.0"],"甘愿成就他人":["16.0"],"时间管理":["16.0"],"想清楚再做":["16.0"],"最短时间管理":["16.0"],"关注长期利益":["16.0"],"环境":["18.0"],"active":["18.0"],"支持":["18.0"],"swagger3":["18.0"],"docker":["19.0"],"t":["19.0","58.4"],"harbor":["19.0"],"latest":["19.0"],"instance":["19.0"],"driver":["19.0"],"internal":["19.0"],"load":["19.0"],"dockerignore":["19.0"],"transferring":["19.0"],"context":["19.0"],"done":["19.0"],"0s":["19.0"],"definition":["19.0"],"dockerfile":["19.0"],"539b":["19.0"],"io":["19.0"],"duxinglangzi":["19.0"],"alpine":["19.0"],"java11":["19.0"],"60mb":["19.0"],"4s":["19.0"],"run":["19.0"],"ln":["19.0"],"sf":["19.0"],"usr":["19.0"],"share":["19.0"],"zoneinfo":["19.0"],"asia":["19.0"],"shanghai":["19.0"],"etc":["19.0"],"localtime":["19.0"],"cached":["19.0"],"mkdir":["19.0"],"p":["19.0"],"workdir":["19.0"],"add":["19.0"],"2s":["19.0"],"opentelemetry":["19.0"],"javaagent":["19.0"],"arthas":["19.0"],"exporting":["19.0"],"image":["19.0"],"layers":["19.0"],"3s":["19.0"],"writing":["19.0"],"sha256":["19.0"],"b3f3032d24c1fd8a9b754a466ff3752f95f88fef600c7b15a72558f40375df4b":["19.0"],"naming":["19.0"],"login":["19.0"],"admin":["19.0"],"kbk6gspk8323ke639ilgqe":["19.0"],"password":["19.0"],"via":["19.0"],"cli":["19.0"],"insecure":["19.0"],"stdin":["19.0"],"will":["19.0"],"stored":["19.0"],"unencrypted":["19.0"],"lib":["19.0"],"json":["19.0"],"configure":["19.0"],"helper":["19.0"],"remove":["19.0"],"docs":["19.0"],"engine":["19.0"],"reference":["19.0"],"commandline":["19.0"],"store":["19.0"],"succeeded":["19.0"],"push":["19.0"],"refers":["19.0"],"d13869d0912e":["19.0"],"preparing":["19.0"],"12f16e5ab9ae":["19.0"],"2dedde4f174d":["19.0"],"5f70bf18a086":["19.0"],"37044c4bf4ce":["19.0"],"2e9c3dcb4310":["19.0"],"7dfcf721d46c":["19.0"],"018a9e842966":["19.0"],"bfbf3abdb35e":["19.0"],"c4d1b17971e5":["19.0"],"b311f6059b1e":["19.0"],"6b0ac22b586f":["19.0"],"4ce9227a27cf":["19.0"],"d17fd464e7c5":["19.0"],"bde76260b707":["19.0"],"54016b302478":["19.0"],"eb525327e85b":["19.0"],"3d18e271d2a5":["19.0"],"bb1b4953a69d":["19.0"],"8c2deaf64810":["19.0"],"34d5ebaa5410":["19.0"],"waiting":["19.0"],"layer":["19.0"],"already":["19.0"],"exists":["19.0"],"pushed":["19.0"],"digest":["19.0"],"32c96c17caca556b45ec7706d4740133c7498acb1bc80f04fbac831e57749d8d":["19.0"],"size":["19.0"],"rmi":["19.0"],"untagged":["19.0"],"deleted":["19.0"],"kubectl":["19.0"],"n":["19.0"],"rollout":["19.0"],"restart":["19.0"],"deployment":["19.0"],"apps":["19.0"],"restarted":["19.0"],"学习之外的东西":["21.0"],"动态调整核心线程数以适应业务需求的变化":["23.3"],"需要通过压力测试和性能调优来确定合适的最大线程数":["23.4"],"以满足业务需求的高并发和可靠性要求":["23.5"],"fuck":["24.2"],"不一定是直接的父元素":["26.0"],"体验产品":["29.2"],"业务同学也认为单个sku表单更合理":["29.2"],"结果几乎是把elform的核心校验逻辑走了一遍":["29.3"],"flutter":["31.0"],"demo":["31.0"],"h":["32.1"],"unzip":["32.1"],"o":["32.1"],"home":["32.1"],"lighthouse":["32.1"],"dist":["32.1"],"cp":["32.1"],"rf":["32.1"],"zip":["32.1"],"运行":["32.1"],"参考连接":["32.1"],"dto的值":["33.0"],"list":["33.0"],"用法":["33.0"],"若是webrtc重新createoffer":["34.2"],"替换轨道需要用发起重启createoffer":["34.2"],"编排和管理容器化应用程序":["35.1"],"大大简化了部署和运维工作":["35.1"],"提高了应用程序的可靠性":["35.1"],"可伸缩性和可移植性":["35.1"],"从而加速了企业向云原生应用程序和微服务架构的转型":["35.1"],"从而实现无停机部署":["35.3"],"总的来说":["35.3"],"在应用了上述配置后":["35.3"],"会自动处理应用程序的部署":["35.3"],"扩缩容":["35.3"],"恢复":["35.3"],"更新等生命周期管理任务":["35.3"],"只需要关注应用程序本身的开发和构建":["35.3"],"而无需处理太多的运维逻辑":["35.3"],"不过":["35.3"],"如果有特殊的需求或要对":["35.3"],"进行更多定制":["35.3"],"还是需要了解更多关于":["35.3"],"的知识":["35.3"],"这些container共享pod的资源":["35.5"],"那么":["36.1"],"可能更适合你":["36.1"],"执行sql报错":["36.1"],"http":["36.1"],"www":["36.1"],"kurui":["36.1"],"me":["36.1"],"error":["36.1"],"html":["36.1"],"mother":["36.2"],"all":["36.3","36.5"],"联表":["36.3","36.5"],"组内数据累加":["36.4"],"依次求和":["36.4"],"并且按照分数升序的方式累加计算每个班级的学生总分":["36.4"],"相当于groupby":["36.4"],"根据xxx分组":["36.4"],"此处为根据班级分组":["36.4"],"并且按照分数降序的方式计算每个班级内的学生的分数排名":["36.4"],"ranking":["36.4"],"rank":["36.4"],"根据班级分组":["36.4"],"row":["36.4"],"number":["36.4"],"几乎和rank一样":["36.4"],"完成":["36.4"],"并根据具体情况和需求选择是否使用":["38.0"],"在编写位运算代码时":["38.0"],"应注重代码的可读性":["38.0"],"可维护性和可移植性":["38.0"],"并添加适当的注释和文档说明":["38.0"],"混合开发带来的安全问题":["40.1"],"打包工具使用":["40.1"],"缺点":["40.1"],"mac系统无法兼容":["40.1"],"基于":["40.1"],"net框架":["40.1"],"以下以word插件展开讲":["40.1"],"com加载项结合webview2":["40.1"],"的技术选型":["40.1"],"vsto插件":["40.5"],"强制保存文档时发生错误":["41.2"],"在执行强制保存操作时出现错误":["41.2"],"librarytarget":["43.0"],"esm导出":["43.0"],"适配webpack3":["43.0"],"建议用umd格式导出":["43.0"],"filename":["43.0"],"better":["43.0"],"jssip":["43.0"],"输出文件名":["43.0"],"来处理子应用之间的数据共享":["44.6"],"单词本内":["45.1"],"单词增加":["45.1"],"模糊查词":["45.1"],"单词发音":["45.1"],"customwordsservice":["45.5"],"getdictionariesbyxmlworkbookid":["45.5"],"resultutils":["45.5"],"success":["45.5"],"wordbookid":["45.6"],"workbookid":["45.6"],"对前端开发友好些":["46.1"],"gradle":["46.2"],"plugin":["46.2"],"mavenlocal":["46.2"],"mavencentral":["46.2"],"jcenter":["46.2"],"中间出啥问题":["46.2"],"doctor":["46.2"],"一下":["46.2"],"按照指令处理就可以啦":["46.2"],"此时":["47.0"],"adb设备也不报错了":["47.0"],"true":["49.1","50.8"],"某个页面需要单开的场景":["49.1"],"setid":["50.7"],"package":["50.8"],"com":["50.8"],"sky":["50.8"],"entity":["50.8"],"configuration":["50.8"],"开启驼峰命名":["50.8"],"map":["50.8"],"underscore":["50.8"],"to":["50.8"],"camel":["50.8"],"case":["50.8"],"生命周期钩子函数":["53.1"],"通知开发者渲染已完成":["53.1"],"需要注意的是":["53.1"],"vue使用了异步更新策略来优化性能":["53.1"],"它会将多个同步的数据变更操作合并为一个更新任务":["53.1"],"以减少不必要的dom操作":["53.1"],"这样可以提高性能并避免频繁的ui更新":["53.1"],"总结起来":["53.1"],"vue的渲染阶段会在事件循环的任务队列执行完毕后进行":["53.1"],"在渲染阶段":["53.1"],"vue会比对虚拟dom":["53.1"],"并最终对真实的dom进行操作":["53.1"],"完成渲染过程":["53.1"],"获取原始对象":["53.4"],"8d":["54.0"],"e7":["54.0"],"bd":["54.0"],"ae":["54.0"],"web3d":["54.0"],"webgl":["54.4"],"loader":["54.4"],"pipeline":["54.4"],"以提高加载性能和减少网络传输时间":["54.5"],"图片压缩webp格式":["54.5"],"使用drc加载":["54.5"],"bamg":["54.7"],"webassembly":["54.19"],"webgpu等技术":["54.19"],"硕士研究生及以上学历":["54.19"],"相关方向或者基础学科专业":["54.19"],"线性代数":["54.21"],"那么不太需要3d渲染这么重的东西":["54.23"],"system":["56.6"],"注册失败":["56.6"],"数据库错误":["56.6"],"return":["56.6"],"getid":["56.6"],"你在某个出版社出书":["57.0"],"相当于出版社以及出版社的其他作者给":["57.0"],"你在书对应的细分领域的心智垄断":["57.0"],"做背书":["57.0"],"你在行业会议演讲":["57.0"],"相当于会议方以及与会的其他演讲嘉宾给":["57.0"],"你在演讲主题对应的细分领域的心智垄断":["57.0"],"两者都是极高效建立心智垄断的手段":["57.0"],"不看百度":["58.1"],"csdn":["58.1"],"深入理解本质的技术点后":["58.1"],"不只是靠模糊的调试和随机的尝试":["58.1"],"能成倍提高效率":["58.1"],"好的方面":["58.1"],"脸皮变厚了":["58.1"],"但是没有写清楚为什么不看了":["58.2"],"也应该留存一些笔记":["58.2"],"过后翻阅":["58.2"],"并制定了实施这些建议的计划":["58.3"],"it":["58.4"],"don":["58.4"],"settle":["58.4"],"赶路的同时":["58.4"],"也要边享受生活":["58.4"],"服务端请求中访问vue实例":["60.1"],"nuxt2不可行":["60.1"],"服务端钩子中组件没有实例化":["60.1"],"还拿不到组件上面的方法":["60.1"],"语义化标签":["60.1"],"如果跨域子域名加载怎么做":["60.2"],"rbac1表设计":["60.2"],"几张表":["60.2"],"作用是什么":["60.2"],"关联关系是什么":["60.2"],"k8s启动一个pod":["60.2"],"cicd配置流程":["60.2"],"但是因为它的高度差不是说特别大":["60.3"],"而且是纯文本":["60.3"],"这个问题就基本不存在":["60.3"],"排版可能存在与wps不一致问题":["60.6"],"wordpress":["61.0"],"ghost":["61.0"],"lsb":["62.0"],"release":["62.0"],"a024":["62.0"]}]'},n={"0.0":{t:"# Runtime API Examples\r",p:"This page demonstrates usage of some of the runtime APIs provi ...",l:"api-examples.html",a:"runtime-api-examples"},"0.1":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.2":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.3":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.4":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;




`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.5":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.6":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.7":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.8":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;
`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.9":{t:"More\r",p:"Check out the documentation for the full list of runtime APIs. ...",l:"api-examples.html#more",a:"more"},"1.0":{t:"两行代码 运行LLM\r",p:`\r
\r`,l:"blogs/ai/ollama.html",a:"两行代码-运行llm"},"1.1":{t:"项目\r",p:`ollama
`,l:"blogs/ai/ollama.html#项目",a:"项目"},"1.2":{t:"运行\r",p:`win11 wsl Ubuntu22
curl -fsSL https://ollama.com/install.sh |  ...`,l:"blogs/ai/ollama.html#运行",a:"运行"},"2.0":{t:"# stable-diffusion-ui实操\r",p:`cmd_args 参数集合
修改 webui-user.bat里
set COMMANDLINE_ARGS=--no-gra ...`,l:"blogs/ai/sdui.html",a:"stable-diffusion-ui实操"},"3.0":{t:"# 原理\r",p:"",l:"blogs/anything/block-chain.html",a:"原理"},"3.1":{t:"加密、数字签名\r",p:"",l:"blogs/anything/block-chain.html#加密、数字签名",a:"加密、数字签名"},"3.2":{t:"哈希、默克尔树\r",p:"",l:"blogs/anything/block-chain.html#哈希、默克尔树",a:"哈希、默克尔树"},"3.3":{t:"共识算法\r",p:"",l:"blogs/anything/block-chain.html#共识算法",a:"共识算法"},"3.4":{t:"基于共识的智能合约\r",p:`solidty 确保语言的确定性
the dao ico 360w以太币·
`,l:"blogs/anything/block-chain.html#基于共识的智能合约",a:"基于共识的智能合约"},"4.0":{t:"<!-- 跨境电商\r",p:`明通
免税店
总代理 不给货

大宗商品？

店铺资源 供应链 资金
供应商货物 品质稳定
--&gt;
&lt;!-- 结 ...`,l:"blogs/anything/commercial.html",a:"跨境电商"},"5.0":{t:"# linux 设置sh定时任务",p:`打开定时任务脚本列表

sudo crontab -e

0 0 * * * /path/to/myscript.sh


 ...`,l:"blogs/anything/crontab.html",a:"linux-设置sh定时任务"},"6.0":{t:"coding\r",p:`user interface : UI
`,l:"blogs/anything/english.html",a:"coding"},"6.1":{t:"life\r",p:`
can i connect you on wechat

`,l:"blogs/anything/english.html#life",a:"life"},"7.0":{t:"# 测试环境表结构同步到生产环境\r",p:`Dump with Format 导出ddl 整体表结构的sql 使用 选择性update
`,l:"blogs/anything/flyaway.html",a:"测试环境表结构同步到生产环境"},"8.0":{t:"使用frp实现内网穿透管理物联网设备 - 知乎-知乎文章\r",p:`需要配置服务器 服务端
使用花生壳免费版
`,l:"blogs/anything/frp.html",a:"使用frp实现内网穿透管理物联网设备-知乎-知乎文章"},"9.0":{t:"> 课代表立正\r",p:"",l:"blogs/anything/gpt.html",a:"课代表立正"},"9.1":{t:"gpt4 目前有代差\r",p:`
技术发展是s型曲线，举例计算机产生有5次
表象差距大 实际背后差距可能更大
数据处理能力、工程能力、用户数正反馈 已经让o ...`,l:"blogs/anything/gpt.html#gpt4-目前有代差",a:"gpt4-目前有代差"},"10.0":{t:"- static关键字\r",p:`
静态变量在以下情况下比较合适：

共享数据：当某个数据需要在类的所有实例之间共享时，静态变量非常有用。例如，一个类代表一个 ...`,l:"blogs/anything/java.html",a:"static关键字"},"11.0":{t:"# Jenkins gitee cicd 配置\r",p:`

安装jenkins镜像 注意使用开源版本
时区变量 -e PHP_TZ=&quot;Asia/Shanghai&quot ...`,l:"blogs/anything/jenkins.html",a:"jenkins-gitee-cicd-配置"},"12.0":{t:"# 联系我\r",p:`
邮箱: yaolinhong1024@gmail.com
github：github link
留言

`,l:"blogs/anything/link-me.html",a:"联系我"},"13.0":{t:"# h1 Heading 8-)\r",p:"",l:"blogs/anything/markdown-demo.html",a:"h1-heading-8"},"13.1":{t:"h2 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h2-heading",a:"h2-heading"},"13.2":{t:"h3 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h3-heading",a:"h3-heading"},"13.3":{t:"h4 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h4-heading",a:"h4-heading"},"13.4":{t:"h5 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h5-heading",a:"h5-heading"},"13.5":{t:"h6 Heading\r",p:`\r
\r`,l:"blogs/anything/markdown-demo.html#h6-heading",a:"h6-heading"},"13.6":{t:"Horizontal Rules\r",p:`


`,l:"blogs/anything/markdown-demo.html#horizontal-rules",a:"horizontal-rules"},"13.7":{t:"Typographic replacements\r",p:`Enable typographer option to see result.
(c) (C) (r) (R) (tm)  ...`,l:"blogs/anything/markdown-demo.html#typographic-replacements",a:"typographic-replacements"},"13.8":{t:"Emphasis\r",p:`This is bold text
This is bold text
This is italic text
This i ...`,l:"blogs/anything/markdown-demo.html#emphasis",a:"emphasis"},"13.9":{t:"Blockquotes\r",p:`
Blockquotes can also be nested...

...by using additional gre ...`,l:"blogs/anything/markdown-demo.html#blockquotes",a:"blockquotes"},"13.10":{t:"Lists\r",p:`Unordered

Create a list by starting a line with +, -, or *
Su ...`,l:"blogs/anything/markdown-demo.html#lists",a:"lists"},"13.11":{t:"Code\r",p:`Inline code
Indented code
// Some comments
line 1 of code
line ...`,l:"blogs/anything/markdown-demo.html#code",a:"code"},"13.12":{t:"Tables\r",p:`


Option
Description




data
path to data files to supply th ...`,l:"blogs/anything/markdown-demo.html#tables",a:"tables"},"13.13":{t:"Links\r",p:`link text
link with title
Autoconverted link https://github.co ...`,l:"blogs/anything/markdown-demo.html#links",a:"links"},"13.14":{t:"Images\r",p:`!Minion
!Stormtroopocat
Like links, Images also have a footnot ...`,l:"blogs/anything/markdown-demo.html#images",a:"images"},"13.15":{t:"Plugins\r",p:"The killer feature of markdown-it is very effective support of ...",l:"blogs/anything/markdown-demo.html#plugins",a:"plugins"},"13.16":{t:"Emojies\r",p:`
Classic markup: :wink: :cry: :laughing: :yum:
Shortcuts (emot ...`,l:"blogs/anything/markdown-demo.html#emojies",a:"emojies"},"13.17":{t:"Subscript / Superscript\r",p:`
19^th^
H~2~O

`,l:"blogs/anything/markdown-demo.html#subscript-superscript",a:"subscript-superscript"},"13.18":{t:"\\<ins>\r",p:`++Inserted text++
`,l:"blogs/anything/markdown-demo.html#ins",a:"ins"},"13.19":{t:"\\<mark>\r",p:`==Marked text==
`,l:"blogs/anything/markdown-demo.html#mark",a:"mark"},"13.20":{t:"Footnotes\r",p:`Footnote 1 link[^first].
Footnote 2 link[^second].
Inline foot ...`,l:"blogs/anything/markdown-demo.html#footnotes",a:"footnotes"},"13.21":{t:"Definition lists\r",p:`Term 1
:   Definition 1
with lazy continuation.
Term 2 withinl ...`,l:"blogs/anything/markdown-demo.html#definition-lists",a:"definition-lists"},"13.22":{t:"Abbreviations\r",p:`This is HTML abbreviation example.
It converts &quot;HTML&quot ...`,l:"blogs/anything/markdown-demo.html#abbreviations",a:"abbreviations"},"13.23":{t:"Custom containers\r",p:`::: warning
here be dragons
:::
`,l:"blogs/anything/markdown-demo.html#custom-containers",a:"custom-containers"},"14.0":{t:"# js中调用c++方法\r",p:"\r",l:"blogs/anything/node-addon.html",a:"js中调用c-方法"},"14.1":{t:"实现方式\r",p:`
使用node addons
node官方的 examples 使用步骤

npm install g node-gyp，对 ...`,l:"blogs/anything/node-addon.html#实现方式",a:"实现方式"},"14.2":{t:"\r",p:`npm install g node-gyp
`,l:"blogs/anything/node-addon.html#",a:""},"15.0":{t:"# api\r",p:`一些优质的官方prompt
https://platform.openai.com/examples


fine-tune ...`,l:"blogs/anything/openai-api.html",a:"api"},"16.0":{t:"- 左耳听风\r",p:`
程序员如何用技术变现


关注有价值的东西 价值取决于供需关系 分清什么是主流技术，什么是过渡式的技术


关注技术付费点 ...`,l:"blogs/anything/reading.html",a:"左耳听风"},"17.0":{t:"分割一切的py\r",p:`图形分割
`,l:"blogs/anything/segment-anything.html",a:"分割一切的py"},"18.0":{t:"Springboot 配置篇\r",p:`!Alt text


多环境配置（点击可以切换环境）
pom.xml
     &lt;profiles&gt;
     ...`,l:"blogs/anything/spring-boot.html",a:"springboot-配置篇"},"19.0":{t:"项目启动\r",p:`
启动依赖安装问题

从pom.xml中看java、maven版本
本机java版本也要与项目要求java版本一致
内网包无 ...`,l:"blogs/anything/spring-cloud.html",a:"项目启动"},"20.0":{t:"# 生成式ai\r",p:"",l:"blogs/anything/生成式ai.html",a:"生成式ai"},"20.1":{t:"多维数据向量存储词性\r",p:"",l:"blogs/anything/生成式ai.html#多维数据向量存储词性",a:"多维数据向量存储词性"},"20.2":{t:"自注意力 \r",p:`避免生成错误
`,l:"blogs/anything/生成式ai.html#自注意力",a:"自注意力"},"21.0":{t:"# 知识库\r",p:`内容导航

Coding / Learning Record 代码 学习记录
Tools 好用的工具
Anything 分享 ...`,l:"blogs/blogs.html",a:"知识库"},"22.0":{t:"# qiankun 子应用更新异常\r",p:`
现象

偶先页面渲染异常 css没加载完全、页面排版混乱


线索第二次进入 没有请求html

`,l:"blogs/bugs/qiankun-update-fail.html",a:"qiankun-子应用更新异常"},"22.1":{t:"其他\r",p:`
js级别的缓存解决方案

不缓存html



`,l:"blogs/bugs/qiankun-update-fail.html#其他",a:"其他"},"23.0":{t:"# backend interview questions\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html",a:"backend-interview-questions"},"23.1":{t:"自定义线程池\r",p:`
核心线程数
最大线程数
工作队列

在一个电商平台的后端系统中，假设我们需要设计一个用于处理订单的自定义线程池。核心线程数 ...`,l:"blogs/coding-learning-record/backend-interview.html#自定义线程池",a:"自定义线程池"},"23.2":{t:"业务场景：\r",p:`
核心业务场景：处理订单请求，包括验证订单信息、扣除库存、生成订单号等。
技术栈：Java后端开发，Spring框架。
核心 ...`,l:"blogs/coding-learning-record/backend-interview.html#业务场景",a:"业务场景"},"23.3":{t:"核心线程数（Core Pool Size）：\r",p:`
业务场景关联：核心线程数应该根据订单的日均请求量和处理时间来确定。对于一个电商平台，订单请求可能会呈现出明显的日周期性波动 ...`,l:"blogs/coding-learning-record/backend-interview.html#核心线程数-core-pool-size",a:"核心线程数-core-pool-size"},"23.4":{t:"最大线程数（Maximum Pool Size）：\r",p:`
业务场景关联：最大线程数应该根据系统的资源限制和预期的最大并发量来确定。在电商平台中，最大线程数的设置应该考虑服务器的CP ...`,l:"blogs/coding-learning-record/backend-interview.html#最大线程数-maximum-pool-size",a:"最大线程数-maximum-pool-size"},"23.5":{t:"工作队列（Work Queue）：\r",p:`
业务场景关联：工作队列用于存储尚未被执行的订单处理任务，应该能够满足高并发请求下的任务排队需求。在电商平台中，可以选择一个 ...`,l:"blogs/coding-learning-record/backend-interview.html#工作队列-work-queue",a:"工作队列-work-queue"},"23.6":{t:"OSI 七层模型是什么样的\r",p:`路由器工作在哪一层？
`,l:"blogs/coding-learning-record/backend-interview.html#osi-七层模型是什么样的",a:"osi-七层模型是什么样的"},"23.7":{t:"TCP 如何保证可靠连接？TCP 如何建立可靠的连接？三次握手的详细过程\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html#tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程",a:"tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程"},"23.8":{t:"Effective Java 要点",p:"",l:"blogs/coding-learning-record/backend-interview.html#effective-java-要点",a:"effective-java-要点"},"24.0":{t:"# 词典实现\r",p:"\r",l:"blogs/coding-learning-record/baiduTranslate.html",a:"词典实现"},"24.1":{t:"需求背景\r",p:`
支持自添加单词的单词本，记录小孩的单词量；
支持分享单词本；家人范围内共享；
常规单词本功能、查词、发音

`,l:"blogs/coding-learning-record/baiduTranslate.html#需求背景",a:"需求背景"},"24.2":{t:"核心功能 - 实现概述\r",p:`
查词

百度翻译api申请 调用
ecdict  社区词典数据库


单词发音 TTS

使用社区免费的tts
使用社区开 ...`,l:"blogs/coding-learning-record/baiduTranslate.html#核心功能-实现概述",a:"核心功能-实现概述"},"25.0":{t:"# 组件设计\r",p:`
避免冗余数据
单一职责（渲染列表 渲染组件）
数据流转清晰
代码逻辑 越少分支越好


`,l:"blogs/coding-learning-record/component-design.html",a:"组件设计"},"26.0":{t:"css踩坑\r",p:`
offsetTop是相对relative的父级 不一定是父元素


定位元素（position属性为relative、ab ...`,l:"blogs/coding-learning-record/css.html",a:"css踩坑"},"27.0":{t:"- depends_on 追加的服务可以在应用内直接映射访问\r",p:`


`,l:"blogs/coding-learning-record/docker-compose.html",a:"depends-on-追加的服务可以在应用内直接映射访问"},"28.0":{t:"# 常用docker操作\r",p:`
docker run build
docker run -i -t -p 3306:3306
&lt;!-- -  --& ...`,l:"blogs/coding-learning-record/docker.html",a:"常用docker操作"},"29.0":{t:"# 长列表大表单性能优化\r",p:"\r",l:"blogs/coding-learning-record/element-ui.html",a:"长列表大表单性能优化"},"29.1":{t:"业务场景\r",p:"vue2 项目 400个表单需要校验。每个表单有20个左右的校验项，多选，单选，input，图片上传组件。总的组件数有上万个 ...",l:"blogs/coding-learning-record/element-ui.html#业务场景",a:"业务场景"},"29.2":{t:"落地选型\r",p:`
虚拟列表路线

不定高度内容，快速滚动会产生高度跳变；虚拟列表滚动，调研中遇到了动态选10个显示 高度跳变的问题。也有解决 ...`,l:"blogs/coding-learning-record/element-ui.html#落地选型",a:"落地选型"},"29.3":{t:"技术难点\r",p:`
简略列表+单个sku表单

整体表单校验；使用nexTick方式，替换数据，循环赋值。
重写校验方法，引入validate ...`,l:"blogs/coding-learning-record/element-ui.html#技术难点",a:"技术难点"},"30.0":{t:"# 前端代码规范\r",p:`
文件名建议全部连字符、否则git大小写有的折腾呢

`,l:"blogs/coding-learning-record/eslint.html",a:"前端代码规范"},"31.0":{t:"# calculator\r",p:`使用flutter构建的计算器demo

若flutter doctor 不通过；使用java8；
anroid-studi ...`,l:"blogs/coding-learning-record/flutter-demo.html",a:"calculator"},"32.0":{t:"# Docker nginx Dockerfile https配置 \r",p:`前置步骤

安装DockerFile
安装DockerCompose
获取ssl证书、sl证书解析配置

`,l:"blogs/coding-learning-record/https.html",a:"docker-nginx-dockerfile-https配置"},"32.1":{t:"步骤\r",p:`
yourServiceName、youdomin替换成你自己的
证书下载 腾讯云

&lt;!-- DockerFile  ...`,l:"blogs/coding-learning-record/https.html#步骤",a:"步骤"},"33.0":{t:"lambda表达式 java\r",p:`        iDsSpaceAreaService.lambdaUpdate()
                .eq ...`,l:"blogs/coding-learning-record/java.html",a:"lambda表达式-java"},"34.0":{t:"# jssip-renegotiaton、FreeSwitch探索\r",p:`&lt;!-- 仓库名称 vue_fs_meeting --&gt;
webrtc
jssip 是一个webrtc的封装库
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html",a:"jssip-renegotiaton、freeswitch探索"},"34.1":{t:"折腾的起因\r",p:`需要帮朋友解决renegotiaton的问题 玩了一下jssip的api
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾的起因",a:"折腾的起因"},"34.2":{t:"jssip\r",p:`关键api

监听renegotiate、reinvite事件
若是直接用浏览器RTC的api replaceTrack替换 ...`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#jssip",a:"jssip"},"34.3":{t:"折腾FreeSwitch\r",p:"\r",l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾freeswitch",a:"折腾freeswitch"},"34.4":{t:"1. 安装\r",p:`windows下 下载msi 一路点安装即可 用管理员方式运行
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_1-安装",a:"_1-安装"},"34.5":{t:"2.wss配置\r",p:`参考博客
并配置nginx之后 启动freeswitch （管理员方式启动）7443的端口；

`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_2-wss配置",a:"_2-wss配置"},"35.0":{t:"# k8s \r",p:`一个开源的容器编排平台
`,l:"blogs/coding-learning-record/k8s.html",a:"k8s"},"35.1":{t:"Kubernetes解决了什么问题:\r",p:`

应用程序部署和管理:

自动化应用程序的部署、扩缩容和滚动更新,减少了手动操作的风险和开销。
支持批量管理和编排多个应用 ...`,l:"blogs/coding-learning-record/k8s.html#kubernetes解决了什么问题",a:"kubernetes解决了什么问题"},"35.2":{t:"container - 容器运行时\r",p:`docker只是其中一种 还有  containerd、CRI-O 等
`,l:"blogs/coding-learning-record/k8s.html#container-容器运行时",a:"container-容器运行时"},"35.3":{t:"部署流程\r",p:`master安装k8s集群模式的包，node节点安装子节点需要的包
配置master、node节点
集群中直接根据配置文件起 ...`,l:"blogs/coding-learning-record/k8s.html#部署流程",a:"部署流程"},"35.4":{t:"主从机器\r",p:`master 集群 node 子节点
`,l:"blogs/coding-learning-record/k8s.html#主从机器",a:"主从机器"},"35.5":{t:"pod container\r",p:`Pod是Kubernetes中最小的可部署单元,它包含一个或多个container。
Pod中的所有container共享相 ...`,l:"blogs/coding-learning-record/k8s.html#pod-container",a:"pod-container"},"36.0":{t:"# mysql\r",p:"\r",l:"blogs/coding-learning-record/mysql.html",a:"mysql"},"36.1":{t:"默认引擎\r",p:`
InnoDB
MyISAM

InnoDB 和 MyISAM 是 MySQL 数据库中的两个存储引擎，它们在功能和性能上有 ...`,l:"blogs/coding-learning-record/mysql.html#默认引擎",a:"默认引擎"},"36.2":{t:"关闭mysql的strict mode\r",p:`注释掉 my.ini中的
# Set the SQL mode to strict
# sql-mode=&quot;STR ...`,l:"blogs/coding-learning-record/mysql.html#关闭mysql的strict-mode",a:"关闭mysql的strict-mode"},"36.3":{t:"总结 \r",p:`

join
inner join 交集
left join right join 左右其中一张的全表 加上选集
cross ...`,l:"blogs/coding-learning-record/mysql.html#总结",a:"总结"},"36.4":{t:"做题内容\r",p:`select name,score
from student
where name not like '%李%'
-- 请在 ...`,l:"blogs/coding-learning-record/mysql.html#做题内容",a:"做题内容"},"36.5":{t:"总结难点 \r",p:`join
inner join 交集
left join right join 左右其中一张的全表 加上选集
cross j ...`,l:"blogs/coding-learning-record/mysql.html#总结难点",a:"总结难点"},"37.0":{t:"# Nacos\r",p:`服务治理
heimashangcheng
docker启动
`,l:"blogs/coding-learning-record/nacos.html",a:"nacos"},"38.0":{t:"位运算\r",p:`https://poe.com/s/8e38IAssLMHBMCW3oRgp 优点
效率高：位运算是对二进制位的直接操作，比 ...`,l:"blogs/coding-learning-record/new-knowledge.html",a:"位运算"},"38.1":{t:"消除异步传染性\r",p:`需要在catch里面做逻辑处理

场景


如任意api 全局自动前端刷新token
react suspense

`,l:"blogs/coding-learning-record/new-knowledge.html#消除异步传染性",a:"消除异步传染性"},"38.2":{t:"非对称加密\r",p:`
rsa 公钥私钥配对
https中的加密 为啥需要证书？

`,l:"blogs/coding-learning-record/new-knowledge.html#非对称加密",a:"非对称加密"},"38.3":{t:"VO 、 DTO\r",p:`DTO（Data Transfer Object）和VO（Value Object）都是用于在系统之间传输数据的对象。
`,l:"blogs/coding-learning-record/new-knowledge.html#vo-、-dto",a:"vo-、-dto"},"39.0":{t:"# next.js \r",p:"\r",l:"blogs/coding-learning-record/next-js.html",a:"next-js"},"39.1":{t:"项目脚手架\r",p:`next-sse
体验一下国际服玩家的利器next.js

api
声明式router

`,l:"blogs/coding-learning-record/next-js.html#项目脚手架",a:"项目脚手架"},"39.2":{t:"sse功能开发\r",p:`
群聊实现demo
打字机推送效果

`,l:"blogs/coding-learning-record/next-js.html#sse功能开发",a:"sse功能开发"},"40.0":{t:"#  WPS、Office插件开发\r",p:"",l:"blogs/coding-learning-record/office-dev.html",a:"wps、office插件开发"},"40.1":{t:"技术选型\r",p:`

JS Api

高度可移植性：可以跨平台使用，支持Windows、Mac、iOS、Android等多个操作系统和设备。
 ...`,l:"blogs/coding-learning-record/office-dev.html#技术选型",a:"技术选型"},"40.2":{t:"面板配置\r",p:`ribbon配置

&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF- ...`,l:"blogs/coding-learning-record/office-dev.html#面板配置",a:"面板配置"},"40.3":{t:"业务开发\r",p:`&lt;!-- TODO --&gt;

`,l:"blogs/coding-learning-record/office-dev.html#业务开发",a:"业务开发"},"40.4":{t:"clickOne部署\r",p:`
clickOne部署自动更新



优点：
安装之后，更新服务器资源后
用户端每次重启word均会拉取最新版本word

 ...`,l:"blogs/coding-learning-record/office-dev.html#clickone部署",a:"clickone部署"},"40.5":{t:"构建兼容WPS、word的插件安装包\r",p:`
Advance installer
InnoSetup


好处:


安装可配置注册表、依赖项
一套代码、打包后一次性安 ...`,l:"blogs/coding-learning-record/office-dev.html#构建兼容wps、word的插件安装包",a:"构建兼容wps、word的插件安装包"},"40.6":{t:" ",p:"",l:"blogs/coding-learning-record/office-dev.html#",a:""},"40.7":{t:"插件效果\r",p:`


word插件
wps插件




&lt;img src=&quot;https://github.com/yaoli ...`,l:"blogs/coding-learning-record/office-dev.html#插件效果",a:"插件效果"},"40.8":{t:"过程中坑: \r",p:`
office文档机翻、社区参考资料少

`,l:"blogs/coding-learning-record/office-dev.html#过程中坑",a:"过程中坑"},"41.0":{t:"# onlyoffice\r",p:"\r",l:"blogs/coding-learning-record/onlyoffice.html",a:"onlyoffice"},"41.1":{t:"服务端渲染docx\r",p:`
文件服务 给onlyoffice editing服务提供文件 给对应加密信息
业务服务端 调用documentBuilde ...`,l:"blogs/coding-learning-record/onlyoffice.html#服务端渲染docx",a:"服务端渲染docx"},"41.2":{t:"接入cdn文件渲染\r",p:`
修改初始化中给onlyoffice服务的地址换成cdn url即可
修改callbackurl中持久化的操作 改为文件整体 ...`,l:"blogs/coding-learning-record/onlyoffice.html#接入cdn文件渲染",a:"接入cdn文件渲染"},"41.3":{t:"替换web-app 增加额外的js\r",p:`把构建好的web-app包 -v到docker内即可
`,l:"blogs/coding-learning-record/onlyoffice.html#替换web-app-增加额外的js",a:"替换web-app-增加额外的js"},"43.0":{t:"# 打包你的js sdk\r",p:`场景： 需要二次封装一个js库 输出一个自己的库
&lt;!-- 安装依赖 --&gt;
pnpm add webpack  ...`,l:"blogs/coding-learning-record/package-sdk.html",a:"打包你的js-sdk"},"44.0":{t:"# qiankun 源码解析\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html",a:"qiankun-源码解析"},"44.1":{t:"css隔离\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#css隔离",a:"css隔离"},"44.2":{t:"js隔离\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#js隔离",a:"js隔离"},"44.3":{t:"子应用加载方式\r",p:"无界获取子应用的脚本采用的是qiankun的import-html-entry方案，这个方案是通过正则表达式将 子应用的 h ...",l:"blogs/coding-learning-record/qiankun.html#子应用加载方式",a:"子应用加载方式"},"44.4":{t:"乾坤子应用keepalive\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#乾坤子应用keepalive",a:"乾坤子应用keepalive"},"44.5":{t:"缓存场景下 css加载404异常捕捉不到的问题\r",p:`思路： debug 进一步定位抛错位置 尝试捕获到之后重试
`,l:"blogs/coding-learning-record/qiankun.html#缓存场景下-css加载404异常捕捉不到的问题",a:"缓存场景下-css加载404异常捕捉不到的问题"},"44.6":{t:"状态管理\r",p:`qiankun 提供了集中式的状态管理方案，它通过 props 和全局状态对象来实现子应用之间的通信和状态共享。
singl ...`,l:"blogs/coding-learning-record/qiankun.html#状态管理",a:"状态管理"},"45.0":{t:"# 润词典\r",p:`
[!TIP]
旨在陪伴kids
私有单词库
科学review
互动式学英语
场景例句巩固

`,l:"blogs/coding-learning-record/rdic.html",a:"润词典"},"45.1":{t:"进度汇总\r",p:`&lt;!-- 1. 2023年12月2日21点49分   --&gt;
单词本下面增加分类


后端

新增分类接口
分类 ...`,l:"blogs/coding-learning-record/rdic.html#进度汇总",a:"进度汇总"},"45.2":{t:"项目介绍\r",p:`
v0.0.1
查询词典、发音
加入分享、私有单词库（默认所有人可以编辑）
分享编辑单词库

`,l:"blogs/coding-learning-record/rdic.html#项目介绍",a:"项目介绍"},"45.3":{t:"接口\r",p:"",l:"blogs/coding-learning-record/rdic.html#接口",a:"接口"},"45.4":{t:"添加单词本\r",p:`注意isDelete字段 数据库需要设置默认值0 然后需要添加
@TableLogic
private Integer is ...`,l:"blogs/coding-learning-record/rdic.html#添加单词本",a:"添加单词本"},"45.5":{t:"私有单词本内-单词分页查询\r",p:`使用mybatis page获取 第一个参数默认传分页参数
第一个参数传分页参数
    /**
     * 根据 id  ...`,l:"blogs/coding-learning-record/rdic.html#私有单词本内-单词分页查询",a:"私有单词本内-单词分页查询"},"45.6":{t:" 接口实现\r",p:"    &lt;select id=&quot;getDictionariesByWorkbookId&quot; resu ...",l:"blogs/coding-learning-record/rdic.html#接口实现",a:"接口实现"},"46.0":{t:"# reactNative\r",p:"\r",l:"blogs/coding-learning-record/reactNative-start.html",a:"reactnative"},"46.1":{t:"rn 和 flutter对比  \r",p:`
rn 大厂使用比较多 flutter 中小厂使用比较多
flutter 增长趋势较好
rn 社区活跃度较高 js技术栈
总 ...`,l:"blogs/coding-learning-record/reactNative-start.html#rn-和-flutter对比",a:"rn-和-flutter对比"},"46.2":{t:"reactNative安装  \r",p:`powershell管理员执行
Set-ExecutionPolicy Bypass -Scope Process -For ...`,l:"blogs/coding-learning-record/reactNative-start.html#reactnative安装",a:"reactnative安装"},"47.0":{t:"按照官网文档部署即可\r",p:`npx react-native doctor


sdk 设置系统环境变量 sdk 、platform tools、com ...`,l:"blogs/coding-learning-record/reactNative.html",a:"按照官网文档部署即可"},"48.0":{t:"# java版本管理 \r",p:"\r",l:"blogs/coding-learning-record/sdk-manage.html",a:"java版本管理"},"48.1":{t:"idea\r",p:`比较方便 有界面操作
`,l:"blogs/coding-learning-record/sdk-manage.html#idea",a:"idea"},"48.2":{t:"本地环境java版本\r",p:`jabba install openjdk@1.17.0
jabba install openjdk@1.11.0
jabb ...`,l:"blogs/coding-learning-record/sdk-manage.html#本地环境java版本",a:"本地环境java版本"},"49.0":{t:"# shared-worker\r",p:"\r",l:"blogs/coding-learning-record/shared-worker.html",a:"shared-worker"},"49.1":{t:"shared-worker-demo\r",p:`git仓库 / 在线 demo
功能：多个不同tab页面之间数据交互
落地场景：


electron render进程之间 ...`,l:"blogs/coding-learning-record/shared-worker.html#shared-worker-demo",a:"shared-worker-demo"},"49.2":{t:"参考资料\r",p:`mdn demo
`,l:"blogs/coding-learning-record/shared-worker.html#参考资料",a:"参考资料"},"50.0":{t:"# 苍穹外卖\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html",a:"苍穹外卖"},"50.1":{t:"SSM实践\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#ssm实践",a:"ssm实践"},"50.2":{t:"pojo 数据库实体 dto entity vo\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#pojo-数据库实体-dto-entity-vo",a:"pojo-数据库实体-dto-entity-vo"},"50.3":{t:"common 全局异常处理 通用包装类等\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#common-全局异常处理-通用包装类等",a:"common-全局异常处理-通用包装类等"},"50.4":{t:"server 项目主体\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#server-项目主体",a:"server-项目主体"},"50.5":{t:"AutoFill注解\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#autofill注解",a:"autofill注解"},"50.6":{t:"mybatis插件\r",p:`mybatisX 安装之后 设置schema 有代码提示

其他功能

官网文档




后端的代码 写起来好丝滑

`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis插件",a:"mybatis插件"},"50.7":{t:"entity中的 @Builder注解\r",p:`/**

@Builder 注解 构建器
用于创建对象
如实现类中
Employee employee = Employee ...`,l:"blogs/coding-learning-record/sky-take-out.html#entity中的-builder注解",a:"entity中的-builder注解"},"50.8":{t:"mybatis 配置\r",p:`update动态sql
    &lt;update id=&quot;update&quot; parameterType ...`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis-配置",a:"mybatis-配置"},"51.0":{t:"type-challenges",p:"",l:"blogs/coding-learning-record/typescript.html",a:"type-challenges"},"52.0":{t:"组件二次封装\r",p:`hooks
坑

onMounted问题解决
全局样式覆盖

`,l:"blogs/coding-learning-record/vue-ui-component.html",a:"组件二次封装"},"53.0":{t:"keep alive\r",p:`
实现原理
微前端场景下如何服用子Vue实例的component
嵌套路由场景下 keep alive的问题

解决方案

 ...`,l:"blogs/coding-learning-record/vue3.html",a:"keep-alive"},"53.1":{t:"nextTick\r",p:`

一定能获取到更新之后的DOM吗

结论： 调用nextTick之前的同步任务，微任务队列排在nextTick之前的都能获 ...`,l:"blogs/coding-learning-record/vue3.html#nexttick",a:"nexttick"},"53.2":{t:" ",p:"",l:"blogs/coding-learning-record/vue3.html#",a:""},"53.3":{t:"forceUpdate -->\r",p:`&lt;!-- 在 --&gt;
`,l:"blogs/coding-learning-record/vue3.html#forceupdate",a:"forceupdate"},"53.4":{t:"unref 和 toRaw 有什么区别\r",p:`以下是自己测试之后的总结
unref是获取引用值 但并不会递归获取
toRaw是获取响应式对象的原始对象 会递归解开prox ...`,l:"blogs/coding-learning-record/vue3.html#unref-和-toraw-有什么区别",a:"unref-和-toraw-有什么区别"},"54.0":{t:"<!--\r",p:`
@Author: yaolinhong yaolinhong1024@gmail.com
@Date: 2023-09-2 ...`,l:"blogs/coding-learning-record/web3d.html",a:""},"54.1":{t:"three.js\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#three-js",a:"three-js"},"54.2":{t:"迭代日志\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#迭代日志",a:"迭代日志"},"54.3":{t:"2023-11-20\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-11-20",a:"_2023-11-20"},"54.4":{t:"Add\r",p:`feat: 模型压缩调研 gltf-transform
gltf-transform optimize ./revit.gl ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"54.5":{t:"压缩方式基本原理\r",p:`

减少模型的多边形数量：多边形数量越多，模型的复杂度和文件大小就会增加。你可以使用3D建模软件，如Blender或Maya ...`,l:"blogs/coding-learning-record/web3d.html#压缩方式基本原理",a:"压缩方式基本原理"},"54.6":{t:"2023-07-23\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-07-23",a:"_2023-07-23"},"54.7":{t:"Add\r",p:`feat: revit模型渲染 mvp
预览 |
仓库地址
&lt;!-- 安装revit https://mp.weixi ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"54.8":{t:"2023-06-15\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#_2023-06-15",a:"_2023-06-15"},"54.9":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"54.10":{t:"Removed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#removed",a:"removed"},"54.11":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"54.12":{t:"Add -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"54.13":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"54.14":{t:"Fixed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#fixed",a:"fixed"},"54.15":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"54.16":{t:"Changed -->\r",p:"",l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"54.17":{t:"Changed\r",p:`我的three.js训练场

feat: 🎸 Metaverse游戏 按住空格 加速跑动 2023-06-15

`,l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"54.18":{t:"learn webgpu\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#learn-webgpu",a:"learn-webgpu"},"54.19":{t:"why learn\r",p:`贴一个吗目标公司岗位的jd；

某目标公司
webGL开发岗位职责:
开发和维护用于Web端设计工具的高性能图形系统，包括： ...`,l:"blogs/coding-learning-record/web3d.html#why-learn",a:"why-learn"},"54.20":{t:"learn what\r",p:`抽象几个关键的技术要素
WebGL API Web图形领域 CPU和GPU的性能优化方法；

熟练掌握基本的线性代数、几何、 ...`,l:"blogs/coding-learning-record/web3d.html#learn-what",a:"learn-what"},"54.21":{t:"how to learn\r",p:`主要目标

有业余开源项目供技术参考（找相关开源项目）
找webGL下的问题场景，直接解决相关的问题，提供commit

过 ...`,l:"blogs/coding-learning-record/web3d.html#how-to-learn",a:"how-to-learn"},"54.22":{t:"一些思考\r",p:"",l:"blogs/coding-learning-record/web3d.html#一些思考",a:"一些思考"},"54.23":{t:"什么场景需要web 3d\r",p:`最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现，一看是直接放的video；

对于需要seo的页面来说，或许b ...`,l:"blogs/coding-learning-record/web3d.html#什么场景需要web-3d",a:"什么场景需要web-3d"},"55.0":{t:"# 微信相关业务逻辑\r",p:"\r",l:"blogs/coding-learning-record/wechat.html",a:"微信相关业务逻辑"},"55.1":{t:"微信公众号登陆\r",p:`!alt text

订阅号无法开通此接口
服务号必须通过微信认证

`,l:"blogs/coding-learning-record/wechat.html#微信公众号登陆",a:"微信公众号登陆"},"55.2":{t:"微信支付\r",p:`坑

native支付并不能用网站引用的appid申请

必须将微信支付id 绑定服务号或者订阅号的微信公众号id 才可以开 ...`,l:"blogs/coding-learning-record/wechat.html#微信支付",a:"微信支付"},"56.0":{t:"api开放平台\r",p:"",l:"blogs/coding-learning-record/yupi-learning-record.html",a:"api开放平台"},"56.1":{t:"gateway 模块 需要单独打开项目\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#gateway-模块-需要单独打开项目",a:"gateway-模块-需要单独打开项目"},"56.2":{t:"todo 整合到主项目启动\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#todo-整合到主项目启动",a:"todo-整合到主项目启动"},"56.3":{t:"mysql 执行sql插入报错 not null的字段没有写入 补充该字段\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#mysql-执行sql插入报错-not-null的字段没有写入-补充该字段",a:"mysql-执行sql插入报错-not-null的字段没有写入-补充该字段"},"56.4":{t:"注册接口的逻辑\r",p:`synchronized 关键字

加锁和释放锁 无论方法正常执行完毕还是抛出异常，都会释放锁
一把锁只能同时被一个线程获取 ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#注册接口的逻辑",a:"注册接口的逻辑"},"56.5":{t:"YuApiClient 调用接口上线报错\r",p:`原因 gateway挂了 远程调用失败
`,l:"blogs/coding-learning-record/yupi-learning-record.html#yuapiclient-调用接口上线报错",a:"yuapiclient-调用接口上线报错"},"56.6":{t:"invoke 报错\r",p:`
{
  &quot;code&quot;: 50000,
  &quot;data&quot;: null,
  &quo ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#invoke-报错",a:"invoke-报错"},"57.0":{t:"# coding plan\r",p:`* 沉淀代码资产，不限于工具库、ui库
* 重视输出；
    * 少些demo项目 多些深入探索 
    * 要有产出成 ...`,l:"blogs/fe-sumary/2024-coding-plan.html",a:"coding-plan"},"58.0":{t:"2023 总结\r",p:"\r",l:"blogs/fe-sumary/2024-plan.html",a:"_2023-总结"},"58.1":{t:"这一年，我取得了一些不错的成绩。\r",p:`

技术钻研：

服务端渲染应用落地、docker compose部署、二开
用react的 useDapp 发布了自己的w ...`,l:"blogs/fe-sumary/2024-plan.html#这一年-我取得了一些不错的成绩。",a:"这一年-我取得了一些不错的成绩。"},"58.2":{t:" 当然，也有一些需要提升的地方。\r",p:`

任务管理：

目标管理意识较差、严格工时评估的能力差，需求评审不够严谨
松散的目标意识，如saas中，错误估计整体提测时 ...`,l:"blogs/fe-sumary/2024-plan.html#当然-也有一些需要提升的地方。",a:"当然-也有一些需要提升的地方。"},"58.3":{t:"朋友们的反馈和建议\r",p:`这里只挑点缺点讲
a: 有时候会眼高手低，得下场多做
b: 需求做的糙 思路是正确、效率也ok 但得深入点细节和产品、测试对 ...`,l:"blogs/fe-sumary/2024-plan.html#朋友们的反馈和建议",a:"朋友们的反馈和建议"},"58.4":{t:"新的一年的计划：\r",p:`
持续长跑 按季度复盘

娱乐消遣控制在每周2天左右
学习打卡 每周至少3天  时间不限 需要有学习产出的记录（笔记、代码库 ...`,l:"blogs/fe-sumary/2024-plan.html#新的一年的计划",a:"新的一年的计划"},"59.0":{t:"# 上上份工作难点\r",p:"\r",l:"blogs/fe-sumary/qd-fe.html",a:"上上份工作难点"},"59.1":{t:"等保三级处理（国家级）\r",p:"",l:"blogs/fe-sumary/qd-fe.html#等保三级处理-国家级",a:"等保三级处理-国家级"},"59.2":{t:"onlyoffice项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#onlyoffice项目",a:"onlyoffice项目"},"59.3":{t:"c# webview word插件项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#c-webview-word插件项目",a:"c-webview-word插件项目"},"59.4":{t:"小程序项目 \r",p:"",l:"blogs/fe-sumary/qd-fe.html#小程序项目",a:"小程序项目"},"59.5":{t:"websocket im优化 （前端消息确认）\r",p:`



Description




背景



难点



选型
sse、轮询、ws？


落地



总结




`,l:"blogs/fe-sumary/qd-fe.html#websocket-im优化-前端消息确认",a:"websocket-im优化-前端消息确认"},"59.6":{t:"jssip 实时音频交互处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#jssip-实时音频交互处理",a:"jssip-实时音频交互处理"},"59.7":{t:"trtc 视频流处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#trtc-视频流处理",a:"trtc-视频流处理"},"59.8":{t:"electron项目",p:"",l:"blogs/fe-sumary/qd-fe.html#electron项目",a:"electron项目"},"60.0":{t:"# 最近一份工作的难点\r",p:"\r",l:"blogs/fe-sumary/xz-fe.html",a:"最近一份工作的难点"},"60.1":{t:"seo、服务端渲染\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#seo、服务端渲染",a:"seo、服务端渲染"},"60.2":{t:"微前端\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#微前端",a:"微前端"},"60.3":{t:"虚拟列表 性能优化\r",p:`
列表方案
不定高度？（从下往上滑动 页面抖动、删除节点页面跳动）

复杂业务代码改造，（item 处理为计算属性）
一些个 ...`,l:"blogs/fe-sumary/xz-fe.html#虚拟列表-性能优化",a:"虚拟列表-性能优化"},"60.4":{t:"动画、多页面响应式适配、i18n\r",p:`

动态rem；


所有图片加载完成之后进入页面
i18n


总结： rem有局限性吗？ TODO
`,l:"blogs/fe-sumary/xz-fe.html#动画、多页面响应式适配、i18n",a:"动画、多页面响应式适配、i18n"},"60.5":{t:"小程序路由权限校验\r",p:`

首页路由切换闪烁


公共组件库处理 二次封装组件；支持透传slot attrs props等（原生组件有坑）


`,l:"blogs/fe-sumary/xz-fe.html#小程序路由权限校验",a:"小程序路由权限校验"},"60.6":{t:"weboffice定制功能\r",p:`
只允许排版功能


iframe 限制

electron

太生硬 用户接受程度


chrome插件

分发问题 -  ...`,l:"blogs/fe-sumary/xz-fe.html#weboffice定制功能",a:"weboffice定制功能"},"61.0":{t:"# 博客系统推荐\r",p:`面向前端同学：
可以使用默认布局 可基于vue扩展
vitepress vue-theme-hope
SEO友好、框架无关
 ...`,l:"blogs/tools/blog-dev.html",a:"博客系统推荐"},"62.0":{t:"# 使用linux命令\r",p:`&lt;!-- node程序的进程 --&gt;
ps -ef | grep node
&lt;!-- 解压到当前文件夹 - ...`,l:"blogs/tools/linux.html",a:"使用linux命令"},"63.0":{t:"# postman 快速导入swagger接口",p:"",l:"blogs/tools/postman.html",a:"postman-快速导入swagger接口"},"65.0":{t:"#  https://gitee.com/ylh1995/Blog/pages",p:"",l:"readme.html",a:"https-gitee-com-ylh1995-blog-pages"}},t={previewLength:62,buttonLabel:"Search",placeholder:"Search docs",allow:[],ignore:[]},o={INDEX_DATA:e,PREVIEW_LOOKUP:n,Options:t};export{o as default};
