const e={map:'[{"runtime":["0.0"],"results":["0.1","0.5"],"theme":["0.2","0.6"],"page":["0.3","0.4","0.7","0.8"],"more":["0.9"],"两行代码":["1.0"],"项目":["1.1"],"运行":["1.2"],"stable":["2.0"],"生成式ai":["3.0"],"多维数据向量存储词性":["3.1"],"自注意力":["3.2"],"rag":["3.3"],"合同审查":["3.4"],"算法":["4.0"],"快速排序":["4.1"],"partion":["4.2"],"哨兵算法优化":["4.3"],"原理":["5.0"],"加密":["5.1"],"哈希":["5.2"],"共识算法":["5.3"],"基于共识的智能合约":["5.4"],"跨境电商":["6.0"],"linux":["7.0"],"跨域":["8.0"],"定义":["8.1"],"接口拦截请求":["8.2"],"iframe无法操作":["8.3"],"webassembly无法开启多线程":["8.4"],"element":["9.0"],"构建脚本参观":["9.1"],"coding":["10.0","73.0"],"life":["10.1"],"测试环境表结构同步到生产环境":["11.0"],"使用frp实现内网穿透管理物联网设备":["12.0"],"课代表立正":["13.0"],"gpt4":["13.1"],"static关键字":["14.0"],"jenkins":["15.0"],"jenkins下":["15.1"],"联系我":["16.0"],"h1":["17.0"],"h2":["17.1"],"h3":["17.2"],"h4":["17.3"],"h5":["17.4"],"h6":["17.5"],"horizontal":["17.6"],"typographic":["17.7"],"emphasis":["17.8"],"blockquotes":["17.9"],"lists":["17.10"],"code":["17.11"],"tables":["17.12"],"links":["17.13"],"images":["17.14"],"plugins":["17.15"],"emojies":["17.16"],"subscript":["17.17"],"ins":["17.18"],"mark":["17.19"],"footnotes":["17.20"],"definition":["17.21"],"abbreviations":["17.22"],"custom":["17.23"],"主要后端方法":["18.0"],"js中调用c":["19.0"],"实现方式":["19.1"],"api":["20.0"],"react设计原理":["21.0"],"分割一切的py":["22.0"],"springboot":["23.0"],"项目启动":["24.0"],"测试类型":["25.0"],"工作日志":["26.0"],"todo":["26.1","72.2"],"已完成":["26.2"],"第三方服务":["27.0"],"wps":["27.1","55.0"],"腾讯云im":["27.2"],"使用体验":["27.3"],"正确的第三方服务使用姿势":["27.4"],"知识库":["28.0"],"eventlistener":["29.0"],"destory没有销毁eventlistener":["29.1"],"try":["30.0","30.2"],"传统资源管理的问题":["30.1"],"优势分析":["30.3"],"示例对比":["30.4"],"总结":["30.5"],"qiankun":["31.0","59.0"],"其他":["31.1"],"backend":["32.0"],"自定义线程池":["32.1"],"业务场景":["32.2","39.1"],"核心线程数":["32.3"],"最大线程数":["32.4"],"工作队列":["32.5"],"osi":["32.6"],"tcp":["32.7"],"effective":["32.8"],"词典实现":["33.0"],"需求背景":["33.1"],"核心功能":["33.2"],"规范git提交信息":["34.0"],"git":["34.1","40.0"],"scope":["34.2"],"组件设计":["35.0"],"css踩坑":["36.0"],"depends":["37.0"],"常用docker操作":["38.0"],"长列表大表单性能优化":["39.0"],"落地选型":["39.2"],"技术难点":["39.3"],"cross":["40.1"],"webpack5":["40.2"],"vue":["40.3","40.4"],"react的最佳实践":["40.5"],"前端代码规范":["41.0"],"calculator":["42.0"],"go语言":["43.0"],"协程":["43.1"],"docker":["44.0"],"步骤":["44.1"],"lambda表达式":["45.0"],"stream":["45.1"],"前端项目":["46.0"],"dockerfile":["46.1"],"遇到的问题":["46.2"],"jssip":["47.0","47.2","75.6"],"折腾的起因":["47.1"],"折腾freeswitch":["47.3"],"k8s":["48.0"],"kubernetes解决了什么问题":["48.1"],"container":["48.2"],"部署流程":["48.3"],"主从机器":["48.4"],"pod":["48.5"],"k8s下的前端容器方案":["48.6"],"makefile使用":["49.0"],"make":["49.1"],"gitlab":["50.0"],"assign":["50.1"],"reviewer":["50.2"],"review界面":["50.3"],"merge之后的操作":["50.4"],"当然":["51.0","74.2"],"摘要":["51.1"],"存储引擎比较":["51.2"],"innodb":["51.3"],"myisam":["51.4"],"sql查询技巧":["51.5"],"聚合函数":["51.6"],"开窗函数":["51.7"],"join操作":["51.8"],"sql习题及解答":["51.9"],"选择不重复的班级id和考试编号组合":["51.10"],"学生信息排序":["51.11"],"学生年龄等级划分":["51.12"],"学生年龄排序并截取信息":["51.13"],"汇总学生成绩":["51.14"],"班级平均成绩":["51.15"],"每个班级每次考试的总学生人数":["51.16"],"班级总成绩超过150分":["51.17"],"学生姓名和当前日期":["51.18"],"筛选特定姓名的学生并展示大写姓名":["51.19"],"错误处理与性能优化":["51.21"],"错误处理":["51.22"],"关闭mysql的strict":["51.23"],"sql学习资源":["51.24"],"结论":["51.25"],"nacos":["52.0"],"服务注册":["52.1"],"位运算":["53.0"],"消除异步传染性":["53.1"],"非对称加密":["53.2"],"vo":["53.3"],"next":["54.0"],"项目脚手架":["54.1"],"sse功能开发":["54.2"],"技术选型":["55.1"],"面板配置":["55.2"],"业务开发":["55.3"],"clickone部署":["55.4"],"构建兼容wps":["55.5"],"插件效果":["55.7"],"过程中坑":["55.8"],"onlyoffice":["56.0"],"服务端渲染docx":["56.1"],"接入cdn文件渲染":["56.2"],"替换web":["56.3"],"实现业务功能":["56.4"],"打包你的js":["58.0"],"webpack配置":["58.1"],"vite配置":["58.2"],"如何引入sdk":["58.3"],"构建产物格式":["58.4"],"css隔离":["59.1"],"js隔离":["59.2"],"子应用加载方式":["59.3"],"乾坤子应用keepalive":["59.4"],"缓存场景下":["59.5"],"状态管理":["59.6"],"润词典":["60.0"],"进度汇总":["60.1"],"项目介绍":["60.2"],"接口":["60.3"],"添加单词本":["60.4"],"私有单词本内":["60.5"],"接口实现":["60.6"],"reactnative":["61.0"],"rn":["61.1"],"reactnative安装":["61.2"],"按照官网文档部署即可":["62.0"],"java版本管理":["63.0"],"idea":["63.1"],"本地环境java版本":["63.2"],"shared":["64.0","64.1"],"参考资料":["64.2"],"苍穹外卖":["65.0"],"ssm实践":["65.1"],"pojo":["65.2"],"common":["65.3"],"server":["65.4"],"autofill注解":["65.5"],"mybatis插件":["65.6"],"entity中的":["65.7"],"mybatis":["65.8"],"su7项目学习笔记":["66.0"],"一些工具":["66.2"],"模型加载":["66.3"],"反射效果":["66.4"],"blender建模":["66.5"],"type":["67.0"],"组件二次封装":["68.0"],"keep":["69.0"],"nexttick":["69.1"],"forceupdate":["69.3"],"unref":["69.4"],"three":["70.1"],"迭代日志":["70.2"],"add":["70.4","70.7","70.12"],"压缩方式基本原理":["70.5"],"removed":["70.10"],"fixed":["70.14"],"changed":["70.16","70.17"],"learn":["70.18","70.20","70.24","70.25"],"why":["70.19"],"how":["70.21"],"一些思考":["70.22"],"什么场景需要web":["70.23"],"微信相关业务逻辑":["71.0"],"微信公众号登陆":["71.1"],"微信支付":["71.2"],"api开放平台":["72.0"],"gateway":["72.1"],"mysql":["72.3"],"注册接口的逻辑":["72.4"],"yuapiclient":["72.5"],"invoke":["72.6"],"这一年":["74.1"],"朋友们的反馈和建议":["74.3"],"新的一年的计划":["74.4"],"上上份工作难点":["75.0"],"等保三级处理":["75.1"],"onlyoffice项目":["75.2"],"c":["75.3"],"小程序项目":["75.4"],"websocket":["75.5"],"trtc":["75.7"],"electron项目":["75.8"],"最近一份工作的难点":["76.0"],"seo":["76.1"],"微前端":["76.2"],"虚拟列表":["76.3"],"动画":["76.4"],"小程序路由权限校验":["76.5"],"weboffice定制功能":["76.6"],"博客系统推荐":["77.0"],"使用linux命令":["78.0"],"postman":["79.0"],"javascript":["80.0"],"https":["82.0"]},{"0":["24.0","55.2"],"1":["17.20","17.21","23.0","24.0","30.3","32.1","36.0","39.2","40.4","42.0","47.2","47.4","48.1","54.2","55.1","55.2","55.4","55.5","55.8","60.1","66.4","70.5","76.2"],"2":["24.0","47.5","60.1"],"3":["24.0"],"4":["24.0"],"8":["24.0","55.2"],"10":["24.0"],"11":["24.0"],"18":["24.0"],"609":["24.0"],"802":["24.0"],"2023":["70.3","70.6","70.8","74.0"],"43708":["24.0"],"50000":["72.6"],"10781466":["24.0"],"api":["0.0","10.0","45.1","55.1"],"examples":["0.0"],"this":["0.0","17.8","17.22"],"page":["0.0"],"demonstrates":["0.0"],"data":["0.2","0.3","0.6","0.7","17.12","24.0","72.6"],"frontmatter":["0.4","0.8"],"check":["0.9"],"运行llm":["1.0"],"ollama":["1.1"],"win11":["1.2"],"wsl":["1.2"],"ubuntu22":["1.2"],"diffusion":["2.0"],"ui实操":["2.0"],"避免生成错误":["3.2"],"微调":["3.3"],"chatgpt":["3.4"],"llm":["3.4"],"legal":["3.4"],"language":["3.4"],"models":["3.4"],"是一种利用自然语言处理和机器学习技术来处理法律文本的方法":["3.4"],"实现ai合同审查的步骤可能包括以下几个方面":["3.4"],"划分子数组":["4.2"],"左子数组任意元素":["4.2"],"数字签名":["5.1"],"默克尔树":["5.2"],"solidty":["5.4"],"明通":["6.0"],"设置sh定时任务":["7.0"],"打开定时任务脚本列表":["7.0"],"plus":["9.0"],"执行build脚本":["9.1"],"en":["10.0"],"zh":["10.0"],"alternatives":["10.0"],"替代品":["10.0"],"suspense":["10.0"],"悬念":["10.0"],"user":["10.0"],"interface":["10.0"],"ui":["10.0","25.0"],"用户界面":["10.0"],"anonymous":["10.0"],"匿名":["10.0"],"lan":["10.0"],"local":["10.0","24.0"],"area":["10.0"],"network":["10.0"],"局域网":["10.0"],"wan":["10.0"],"wide":["10.0"],"广域网":["10.0"],"application":["10.0"],"programming":["10.0"],"应用程序接口":["10.0"],"algorithm":["10.0"],"算法":["10.0"],"bandwidth":["10.0"],"带宽":["10.0"],"bit":["10.0"],"位":["10.0"],"byte":["10.0"],"字节":["10.0"],"cache":["10.0"],"can":["10.1","17.9"],"dump":["11.0"],"知乎":["12.0"],"目前有代差":["13.1"],"技术发展是s型曲线":["13.1"],"举例计算机产生有5次":["13.1"],"表象差距大":["13.1"],"静态变量在以下情况下比较合适":["14.0"],"共享数据":["14.0"],"当某个数据需要在类的所有实例之间共享时":["14.0"],"gitee":["15.0","82.0"],"cicd":["15.0"],"配置":["15.0","58.3","65.8"],"安装jenkins镜像":["15.0"],"node多版本构建":["15.1"],"邮箱":["16.0"],"heading":["17.0","17.1","17.2","17.3","17.4","17.5"],"rules":["17.6"],"replacements":["17.7"],"enable":["17.7"],"typographer":["17.7"],"is":["17.8","17.22","24.0"],"unordered":["17.10"],"create":["17.10"],"a":["17.10","24.0"],"list":["17.10","18.0","24.0"],"by":["17.10","24.0"],"starting":["17.10"],"line":["17.10"],"with":["17.10","30.0","30.2","30.4"],"or":["17.10"],"inline":["17.11"],"indented":["17.11"],"option":["17.12"],"description":["17.12","76.1","76.2"],"path":["17.12"],"to":["17.12","24.0","70.21"],"files":["17.12"],"supply":["17.12"],"link":["17.13","17.20"],"text":["17.13","23.0"],"minion":["17.14"],"stormtroopocat":["17.14"],"like":["17.14"],"links":["17.14"],"the":["17.15","24.0"],"classic":["17.16"],"markup":["17.16"],"superscript":["17.17"],"inserted":["17.18"],"marked":["17.19"],"footnote":["17.20"],"lists":["17.21"],"term":["17.21"],"html":["17.22","44.1"],"containers":["17.23"],"getleftlistexport":["18.0"],"java":["18.0","24.0","32.8","45.0","45.1","60.5"],"private":["18.0"],"map":["18.0","45.1"],"string":["18.0"],"object":["18.0"],"getleftlist":["18.0"],"materialbookvo":["18.0"],"vo":["18.0"],"left":["18.0"],"institutionvo":["18.0"],"boolean":["18.0"],"noneedgenword":["18.0"],"ispreview":["18.0"],"resultlist":["18.0"],"new":["18.0","40.5"],"arraylist":["18.0"],"封面":["18.0"],"long":["18.0"],"fileid":["18.0"],"idworker":["18.0"],"getid":["18.0"],"result":["18.0"],"hashmap":["18.0"],"put":["18.0"],"name":["18.0","51.12","58.3"],"方法":["19.0"],"使用node":["19.1"],"addons":["19.1"],"node官方的":["19.1"],"npm":["19.2","40.4"],"一些优质的官方prompt":["20.0"],"https":["20.0","24.0","53.0","55.7"],"框架原理概览":["21.0"],"mustache语法":["21.0"],"重ui轻逻辑":["21.0"],"jsx":["21.0"],"react":["21.0","62.0"],"应用级框架":["21.0"],"优化放在运行时":["21.0"],"图形分割":["22.0"],"配置篇":["23.0"],"alt":["23.0","27.2","52.1","71.1"],"多环境配置":["23.0","40.2"],"点击可以切换环境":["23.0"],"pom":["23.0"],"xml":["23.0","24.0","55.2","60.6","65.8"],"启动依赖安装问题":["24.0"],"从pom":["24.0"],"xml中看java":["24.0"],"maven版本":["24.0"],"本机java版本也要与项目要求java版本一致":["24.0"],"内网包无法拉到":["24.0"],"需要配置maven私有仓库":["24.0"],"todo":["24.0","46.1","48.6","55.3"],"解决私有仓库配置":["24.0"],"pre":["24.0"],"class":["24.0","51.17"],"console":["24.0"],"output":["24.0"],"started":["24.0"],"timer":["24.0"],"running":["24.0"],"as":["24.0"],"system":["24.0","61.2"],"building":["24.0"],"in":["24.0"],"workspace":["24.0"],"jenkins":["24.0"],"test2":["24.0"],"xizhao":["24.0"],"ins":["24.0"],"recommended":["24.0"],"git":["24.0"],"tool":["24.0"],"none":["24.0"],"using":["24.0"],"credential":["24.0"],"5bc2":["24.0"],"4ab2":["24.0"],"90da":["24.0"],"91285e13c47a":["24.0"],"gt":["24.0"],"rev":["24.0"],"parse":["24.0"],"resolve":["24.0"],"dir":["24.0"],"timeout":["24.0"],"fetching":["24.0"],"changes":["24.0"],"from":["24.0","44.1","70.24","70.25"],"remote":["24.0"],"repository":["24.0"],"config":["24.0","58.1","58.2","58.3"],"origin":["24.0"],"url":["24.0"],"href":["24.0"],"http":["24.0"],"gitlab":["24.0"],"raritag":["24.0"],"cn":["24.0"],"backend":["24.0"],"business":["24.0"],"platform":["24.0"],"institution":["24.0"],"upstream":["24.0"],"version":["24.0","55.2"],"askpass":["24.0"],"set":["24.0","61.2","65.8"],"credentials":["24.0"],"fetch":["24.0"],"tags":["24.0"],"progress":["24.0"],"refs":["24.0"],"heads":["24.0"],"remotes":["24.0"],"test":["24.0","65.8"],"commit":["24.0"],"checking":["24.0"],"out":["24.0"],"revision":["24.0"],"3edab892f3efe98472bafba406e5b324398e509d":["24.0"],"core":["24.0","32.3"],"sparsecheckout":["24.0"],"checkout":["24.0"],"f":["24.0","48.3"],"message":["24.0","72.6"],"merge":["24.0","50.0"],"branch":["24.0"],"prod":["24.0"],"into":["24.0"],"no":["24.0"],"walk":["24.0"],"bin":["24.0"],"sh":["24.0"],"xe":["24.0"],"tmp":["24.0"],"jenkins8726267618464466461":["24.0"],"home":["24.0"],"var":["24.0"],"jdk":["24.0"],"apache":["24.0"],"maven":["24.0"],"mvn":["24.0"],"clean":["24.0"],"install":["24.0","63.2"],"dmaven":["24.0"],"skip":["24.0"],"true":["24.0"],"u":["24.0"],"info":["24.0"],"scanning":["24.0"],"for":["24.0"],"projects":["24.0"],"downloading":["24.0"],"rdc":["24.0"],"snapshots":["24.0"],"repo":["24.0"],"aliyun":["24.0"],"com":["24.0","53.0","70.0"],"snapshot":["24.0"],"4gwswi":["24.0"],"dependency":["24.0"],"center":["24.0"],"metadata":["24.0"],"releases":["24.0"],"release":["24.0"],"x4vplw":["24.0"],"archetype":["24.0"],"b":["24.0"],"downloaded":["24.0"],"at":["24.0"],"s":["24.0","53.0"],"目的":["25.0"],"工具":["25.0"],"特点":["25.0"],"前端测试":["25.0"],"单元测试":["25.0"],"unit":["25.0"],"testing":["25.0"],"测试单个组件或函数的正确性":["25.0"],"jest":["25.0"],"mocha":["25.0"],"jasmine":["25.0"],"运行速度快":["25.0"],"独立性强":["25.0"],"易于定位问题":["25.0"],"组件测试":["25.0"],"component":["25.0"],"测试独立的":["25.0"],"组件":["25.0"],"管端配置项":["26.1"],"下面从价格角度分析一下":["27.0"],"标准版":["27.1"],"内容导航":["28.0"],"触发方法":["29.1"],"resources优化资源管理":["30.0"],"在java":["30.1"],"7之前":["30.1"],"资源管理通常依赖于":["30.1"],"自动资源管理":["30.3"],"资源在":["30.3"],"考虑以下两个示例":["30.4"],"一个是使用传统方式管理资源":["30.4"],"另一个使用":["30.4"],"try":["30.4","30.5"],"resources":["30.4"],"传统方式":["30.4"],"子应用更新异常":["31.0"],"js级别的缓存解决方案":["31.1"],"interview":["32.0"],"核心业务场景":["32.2"],"pool":["32.3"],"maximum":["32.4"],"work":["32.5"],"queue":["32.5"],"七层模型是什么样的":["32.6"],"如何保证可靠连接":["32.7"],"支持自添加单词的单词本":["33.1"],"实现概述":["33.2"],"查词":["33.2"],"cz":["34.1"],"changelog":["34.2"],"避免冗余数据":["35.0"],"offsettop是相对relative的父级":["36.0"],"on":["37.0"],"docker":["38.0","74.1"],"vue2":["39.1"],"虚拟列表路线":["39.2"],"简略列表":["39.3"],"前端项目多环境配置":["40.0"],"env":["40.1","40.4"],"cli下多环境配置":["40.3"],"cli为什么这么方便":["40.4"],"如何实现":["40.4"],"在webpack中":["40.4"],"使用":["40.4"],"defineplugin":["40.4","40.5"],"可以实现将":["40.4"],"文件中的环境变量注入到构建的代码中":["40.4"],"以下是具体实现":["40.4"],"安装依赖":["40.4"],"确保你已经安装了":["40.4"],"dotenv":["40.4"],"webpack":["40.4","40.5","58.1"],"插件":["40.4"],"该插件可以加载":["40.4"],"文件中的环境变量并将其传递给":["40.4"],"bash":["40.4"],"是否一般都是直接加载对应的js":["40.5"],"文件名建议全部连字符":["41.0"],"使用flutter构建的计算器demo":["42.0"],"go":["43.1"],"package":["43.1"],"main":["43.1"],"import":["43.1"],"nginx":["44.0","44.1"],"yourservicename":["44.1"],"youdomin替换成你自己的":["44.1"],"证书下载":["44.1"],"腾讯云":["44.1"],"dockerfile":["44.1"],"latest":["44.1"],"copy":["44.1"],"cert":["44.1"],"etc":["44.1"],"usr":["44.1"],"share":["44.1"],"conf":["44.1"],"d":["44.1"],"default":["44.1"],"idsspaceareaservice":["45.0"],"lambdaupdate":["45.0"],"替换for循环的高级方法":["45.1"],"topcategroup":["45.1"],"foreach":["45.1"],"topcatename":["45.1"],"dgslist":["45.1"],"jenkins构建脚本优化dockerfile":["46.0"],"每次都要整体全部构建":["46.2"],"renegotiaton":["47.0"],"需要帮朋友解决renegotiaton的问题":["47.1"],"关键api":["47.2"],"监听renegotiate":["47.2"],"一个开源的容器编排平台":["48.0"],"应用程序部署和管理":["48.1"],"自动化应用程序的部署":["48.1"],"扩缩容和滚动更新":["48.1"],"减少了手动操作的风险和开销":["48.1"],"支持批量管理和编排多个应用程序及其依赖关系":["48.1"],"容器运行时":["48.2"],"master安装k8s集群模式的包":["48.3"],"node节点安装子节点需要的包":["48.3"],"配置master":["48.3"],"node节点":["48.3"],"集群中直接根据配置文件起对应服务":["48.3"],"kubectl":["48.3"],"apply":["48.3"],"frontend":["48.3"],"deployment":["48.3"],"yaml":["48.3"],"service":["48.3"],"master":["48.4"],"container":["48.5"],"pod是kubernetes中最小的可部署单元":["48.5"],"谁对代码质量保证":["50.1"],"一般是仓库有合并权限的人":["50.2"],"以下是包含sql习题的完整markdown格式博客内容":["51.0"],"本文详细讨论了mysql数据库中的两种存储引擎":["51.1"],"事务支持":["51.3"],"事务":["51.4"],"sum":["51.6","51.14"],"over":["51.7"],"inner":["51.8"],"sql":["51.10","51.11","51.12","51.13","51.14","51.15","51.16","51.17","51.18","51.19"],"select":["51.11","51.12","51.13","51.14","51.15","51.16","51.17","51.19","60.6"],"id":["51.19","60.5","60.6","65.8"],"mode":["51.23"],"执行初始化数据库sql脚本":["51.23"],"报错":["51.23","72.6"],"编辑":["51.23"],"my":["51.23"],"ini":["51.23"],"根据应用需求选择合适的存储引擎":["51.25"],"服务治理":["52.0"],"poe":["53.0"],"8e38iasslmhbmcw3orgp":["53.0"],"优点":["53.0"],"需要在catch里面做逻辑处理":["53.1"],"rsa":["53.2"],"dto":["53.3"],"js":["54.0","55.1","58.1","58.3","70.1"],"next":["54.1"],"office插件开发":["55.0"],"高度可移植性":["55.1"],"可以跨平台使用":["55.1"],"支持windows":["55.1"],"mac":["55.1"],"ios":["55.1"],"android等多个操作系统和设备":["55.1"],"ribbon配置":["55.2"],"encoding":["55.2"],"utf":["55.2"],"word的插件安装包":["55.5"],"word插件":["55.7"],"wps插件":["55.7"],"img":["55.7"],"src":["55.7"],"github":["55.7"],"文件服务":["56.1"],"修改初始化中给onlyoffice服务的地址换成cdn":["56.2"],"url即可":["56.2"],"修改callbackurl中持久化的操作":["56.2"],"改为文件整体上传oss":["56.2"],"app":["56.3","59.2"],"基于js替换":["56.4"],"iframe处理可以做到以下功能":["56.4"],"排版模式":["56.4"],"更细颗粒度地控制了编辑的权限":["56.4"],"table":["56.4"],"tr":["56.4"],"th":["56.4"],"sdk":["58.0"],"场景":["58.0"],"javascript":["58.1","58.2","58.3"],"const":["58.1","58.3","80.0"],"terserplugin":["58.1"],"require":["58.1"],"terser":["58.1"],"plugin":["58.1"],"vite":["58.2"],"ts":["58.2"],"build":["58.2"],"externals":["58.3"],"externalconfig":["58.3"],"vue":["58.3"],"scope":["58.3","61.2"],"useprefetch":["58.3"],"false":["58.3"],"umd":["58.4"],"universal":["58.4"],"module":["58.4"],"definition":["58.4"],"定义":["58.4"],"是一种模块定义规范":["58.4"],"旨在兼容多种模块系统":["58.4"],"包括":["58.4","70.19"],"amd":["58.4"],"commonjs":["58.4"],"以及直接在浏览器中作为脚本标签运行":["58.4"],"局限性":["58.4"],"源码解析":["59.0"],"实现子应用之间的样式隔离":["59.1"],"snapshotsandbox":["59.2"],"proxysandbox":["59.2"],"无界获取子应用的脚本采用的是qiankun的import":["59.3"],"css加载404异常捕捉不到的问题":["59.5"],"qiankun":["59.6"],"tip":["60.0"],"2023年12月2日21点49分":["60.1"],"单词本下面增加分类":["60.1"],"后端":["60.1"],"新增分类接口":["60.1"],"分类编辑接口":["60.1"],"v0":["60.2"],"注意isdelete字段":["60.4"],"单词分页查询":["60.5"],"使用mybatis":["60.5"],"page获取":["60.5"],"第一个参数默认传分页参数":["60.5"],"第一个参数传分页参数":["60.5"],"根据":["60.5"],"获取":["60.5"],"getdictionariesbyworkbookid":["60.6"],"和":["61.1","69.4"],"flutter对比":["61.1"],"powershell管理员执行":["61.2"],"shell":["61.2"],"executionpolicy":["61.2"],"bypass":["61.2"],"process":["61.2"],"force":["61.2"],"npx":["62.0"],"比较方便":["63.1"],"jabba":["63.2"],"openjdk":["63.2"],"worker":["64.0","64.1"],"demo":["64.1"],"git仓库":["64.1"],"mdn":["64.2"],"数据库实体":["65.2"],"全局异常处理":["65.3"],"项目主体":["65.4"],"mybatisx":["65.6"],"builder注解":["65.7"],"builder":["65.7"],"注解":["65.7"],"update动态sql":["65.8"],"update":["65.8"],"parametertype":["65.8"],"employee":["65.8"],"if":["65.8"],"3d模型格式":["66.1"],"three":["66.2"],"gltfloader":["66.3"],"模型裁切":["66.5"],"challenges":["67.0"],"hooks":["68.0"],"alive":["69.0"],"一定能获取到更新之后的dom吗":["69.1"],"结论":["69.1"],"调用nexttick之前的同步任务":["69.1"],"微任务队列排在nexttick之前的都能获取到":["69.1"],"由nexttick的源码可以看出":["69.1"],"nexttick本质就是创建了一个微任务":["69.1"],"不考虑settimeout":["69.1"],"将其回调推入微任务队列":["69.1"],"vue中一个事件循环中的所有dom更新操作也是一个微任务":["69.1"],"两者属于同一优先级":["69.1"],"执行先后只于入队的先后有关":["69.1"],"换句话说":["69.1"],"如果你先写了nexttick":["69.1"],"再写赋值语句":["69.1"],"在此之前没有触发dom更新的操作":["69.1"],"那在nexttick中获取的可就不是更新后的dom了":["69.1"],"在":["69.3"],"author":["70.0"],"yaolinhong":["70.0"],"yaolinhong1024":["70.0"],"gmail":["70.0"],"date":["70.0"],"feat":["70.4","70.7"],"模型压缩调研":["70.4"],"gltf":["70.4"],"transform":["70.4"],"optimize":["70.4"],"revit":["70.4"],"减少模型的多边形数量":["70.5"],"多边形数量越多":["70.5"],"模型的复杂度和文件大小就会增加":["70.5"],"你可以使用3d建模软件":["70.5"],"如blender或maya":["70.5"],"我的three":["70.17"],"webgpu":["70.18"],"learn":["70.19","70.21"],"贴一个吗目标公司岗位的jd":["70.19"],"某目标公司":["70.19"],"webgl开发岗位职责":["70.19"],"开发和维护用于web端设计工具的高性能图形系统":["70.19"],"what":["70.20"],"3d":["70.23"],"su7":["70.24"],"非常炫酷的3d效果":["70.24"],"坑":["71.2"],"模块":["72.1"],"整合到主项目启动":["72.2"],"执行sql插入报错":["72.3"],"synchronized":["72.4","72.6"],"关键字":["72.4"],"调用接口上线报错":["72.5"],"code":["72.6"],"null":["72.6"],"connectexception":["72.6"],"connection":["72.6"],"refused":["72.6"],"connect":["72.6"],"useraccount":["72.6"],"intern":["72.6"],"plan":["73.0"],"沉淀代码资产":["73.0"],"不限于工具库":["73.0"],"ui库":["73.0"],"重视输出":["73.0"],"少些demo项目":["73.0"],"多些深入探索":["73.0"],"要有产出成果":["73.0"],"仓库开源":["73.0"],"or形成相应的技术文章":["73.0"],"我取得了一些不错的成绩":["74.1"],"技术钻研":["74.1"],"服务端渲染应用落地":["74.1"],"compose部署":["74.1"],"二开":["74.1"],"用react的":["74.1"],"usedapp":["74.1"],"也有一些需要提升的地方":["74.2"],"任务管理":["74.2"],"目标管理意识较差":["74.2"],"这里只挑点缺点讲":["74.3"],"持续长跑":["74.4"],"按季度复盘":["74.4"],"娱乐消遣控制在每周2天左右":["74.4"],"学习打卡":["74.4"],"每周至少3天":["74.4"],"时间不限":["74.4"],"需要有学习产出的记录":["74.4"],"国家级":["75.1"],"webview":["75.3"],"im优化":["75.5"],"实时音频交互处理":["75.6"],"视频流处理":["75.7"],"服务端渲染":["76.1"],"div":["76.1","76.2"],"style":["76.1","76.2"],"width":["76.1","76.2"],"30px":["76.1","76.2"],"背景":["76.1","76.2"],"计划全站seo":["76.1"],"业务要新开一个saas系统":["76.2"],"后续可能做paas":["76.2"],"子系统多根据用户开通情况分配权限":["76.2"],"难点":["76.2"],"子系统用户权限":["76.2"],"页面路由":["76.2"],"数据权限":["76.2"],"性能优化":["76.3"],"列表方案":["76.3"],"不定高度":["76.3"],"从下往上滑动":["76.3"],"多页面响应式适配":["76.4"],"首页路由切换闪烁":["76.5"],"只允许排版功能":["76.6"],"面向前端同学":["77.0"],"可以使用默认布局":["77.0"],"node程序的进程":["78.0"],"ps":["78.0"],"ef":["78.0"],"grep":["78.0"],"node":["78.0"],"解压到当前文件夹":["78.0"],"tar":["78.0"],"快速导入swagger接口":["79.0"],"也可以用dayjs的插件":["80.0"],"获取当前时间":["80.0"],"与目标时间的diff":["80.0"],"export":["80.0"],"function":["80.0"],"calculatetimediff":["80.0"],"timestampinput":["80.0"],"number":["80.0"],"认为是时间戳":["80.0"],"其他的":["80.0"],"date转一下拿时间戳":["80.0"],"timestamp":["80.0"],"includes":["80.0"],"typeof":["80.0"]},{"0":["60.2","63.2"],"1":["9.1","17.11","18.0","39.3","62.0","63.2","70.19","76.1"],"2":["17.10","17.20","40.4","47.2","48.1","66.4","70.19","76.1","76.2"],"3":["44.1","58.3","60.1","70.19","76.2"],"4":["58.3","60.1"],"5":["60.1"],"8":["17.0"],"10":["80.0"],"11":["70.3"],"17":["63.2"],"19":["17.17"],"21":["24.0"],"22":["70.0"],"23":["70.0"],"47":["70.0"],"53":["70.0"],"60":["51.12"],"80":["44.1"],"135":["24.0"],"192":["24.0"],"199":["24.0"],"443":["44.1"],"798":["24.0"],"992":["24.0"],"2009":["55.2"],"2023":["70.0"],"3072":["61.2"],"usage":["0.0"],"of":["0.0","17.11","24.0","45.1","70.5"],"some":["0.0","17.11","24.0"],"the":["0.0","0.9","17.12"],"pre":["0.2","0.3","0.4","0.6","0.7","0.8"],"out":["0.9"],"curl":["1.2"],"fssl":["1.2"],"https":["1.2"],"cmd":["2.0"],"args":["2.0"],"参数集合":["2.0"],"后训练":["3.3"],"数据收集和准备":["3.4"],"收集大量的合同文本数据":["3.4"],"包括各种类型的合同":["3.4"],"如租赁合同":["3.4"],"销售合同":["3.4"],"服务合同等":["3.4"],"清洗和标记数据":["3.4"],"右子数组任意元素":["4.2"],"基准初始为left":["4.2"],"双指针":["4.2"],"确保语言的确定性":["5.4"],"免税店":["6.0"],"总代理":["6.0"],"sudo":["7.0"],"crontab":["7.0"],"e":["7.0","15.0"],"缓存":["10.0"],"client":["10.0"],"客户端":["10.0"],"cloud":["10.0","24.0"],"云":["10.0"],"compile":["10.0"],"编译":["10.0"],"cookie":["10.0"],"小甜饼":["10.0"],"cybersecurity":["10.0"],"网络安全":["10.0"],"database":["10.0"],"数据库":["10.0"],"debug":["10.0"],"调试":["10.0","74.1"],"encryption":["10.0"],"加密":["10.0"],"exception":["10.0"],"异常":["10.0"],"firewall":["10.0"],"防火墙":["10.0"],"framework":["10.0"],"框架":["10.0"],"frontend":["10.0"],"前端":["10.0"],"function":["10.0","69.1"],"函数":["10.0"],"gigabyte":["10.0"],"gb":["10.0"],"千兆字节":["10.0"],"git":["10.0"],"版本控制系统":["10.0"],"hardware":["10.0"],"硬件":["10.0"],"i":["10.1"],"with":["11.0","17.13","17.21","30.5"],"知乎文章":["12.0"],"实际背后差距可能更大":["13.1"],"数据处理能力":["13.1"],"工程能力":["13.1"],"用户数正反馈":["13.1"],"静态变量非常有用":["14.0"],"例如":["14.0"],"一个类代表一个公司的员工":["14.0"],"公司的名称对于所有员工来说都是相同的":["14.0"],"注意使用开源版本":["15.0"],"时区变量":["15.0"],"php":["15.0"],"tz":["15.0"],"yaolinhong1024":["16.0"],"option":["17.7"],"to":["17.7"],"see":["17.7"],"bold":["17.8"],"text":["17.8","17.18","17.19","27.2","52.1","71.1"],"also":["17.9","17.14"],"be":["17.9","17.12","24.0"],"nested":["17.9"],"sub":["17.10"],"are":["17.10"],"made":["17.10"],"indenting":["17.10"],"spaces":["17.10"],"marker":["17.10"],"character":["17.10"],"comments":["17.11"],"line":["17.11","24.0"],"that":["17.12"],"will":["17.12"],"passed":["17.12"],"into":["17.12"],"templates":["17.12"],"engine":["17.12"],"have":["17.14"],"a":["17.14","74.3"],"footnote":["17.14"],"killer":["17.15"],"feature":["17.15"],"wink":["17.16"],"cry":["17.16"],"first":["17.20"],"lazy":["17.21"],"continuation":["17.21"],"abbreviation":["17.22"],"example":["17.22"],"it":["17.22","24.0"],"warning":["17.23","24.0"],"setcoverpagefileid":["18.0"],"add":["18.0"],"if":["18.0","80.0"],"objects":["18.0"],"nonnull":["18.0"],"getxizhaoexportconfig":["18.0"],"getshowindeximg":["18.0"],"collectionutil":["18.0"],"isnotempty":["18.0"],"getindexfilevos":["18.0"],"索引图":["18.0"],"setindexpagefileid":["18.0"],"目录":["18.0"],"examples":["19.1"],"使用步骤":["19.1"],"npm":["19.1"],"install":["19.1","19.2","40.4"],"platform":["20.0"],"openai":["20.0"],"vue":["21.0","25.0"],"可以应用aot优化":["21.0"],"编译时可根据渲染逻辑优化模板变量值":["21.0"],"svelte":["21.0"],"极致的编译时框架":["21.0"],"所有的逻辑都在编译时绑定到变量上":["21.0"],"左耳听风":["21.0"],"profiles":["23.0"],"profile":["23.0"],"id":["23.0","51.15","51.16","51.17"],"dev":["23.0","40.4"],"properties":["23.0"],"profileactive":["23.0"],"problems":["24.0"],"were":["24.0"],"encountered":["24.0"],"while":["24.0"],"effective":["24.0"],"model":["24.0"],"jar":["24.0"],"dependencies":["24.0"],"groupid":["24.0"],"artifactid":["24.0"],"type":["24.0"],"classifier":["24.0"],"must":["24.0"],"unique":["24.0"],"baomidou":["24.0"],"mybatis":["24.0"],"plus":["24.0"],"boot":["24.0"],"starter":["24.0"],"duplicate":["24.0"],"declaration":["24.0"],"column":["24.0"],"build":["24.0","44.1","49.1"],"plugins":["24.0"],"plugin":["24.0","58.3"],"org":["24.0"],"resources":["24.0","30.5"],"missing":["24.0"],"deploy":["24.0"],"highly":["24.0"],"fix":["24.0"],"these":["24.0"],"because":["24.0"],"they":["24.0"],"threaten":["24.0"],"stability":["24.0"],"your":["24.0"],"this":["24.0"],"reason":["24.0"],"future":["24.0"],"versions":["24.0"],"might":["24.0"],"longer":["24.0"],"support":["24.0"],"such":["24.0"],"malformed":["24.0"],"lt":["24.0"],"feign":["24.0"],"kb":["24.0"],"swarm":["24.0"],"react":["25.0"],"library":["25.0"],"test":["25.0"],"utils":["25.0"],"关注组件的行为和呈现":["25.0"],"通常结合模拟和虚拟":["25.0"],"dom":["25.0"],"快照测试":["25.0"],"snapshot":["25.0"],"检查":["25.0"],"组件的呈现是否发生变化":["25.0"],"将组件的输出快照与之前的快照对比":["25.0"],"确保":["25.0"],"的一致性":["25.0"],"集成测试":["25.0"],"integration":["25.0"],"bug修改":["26.1"],"alt":["27.1","60.1"],"coding":["28.0","74.4"],"使用浏览器的回退按钮":["29.1"],"在java编程中":["30.0"],"资源管理是一个至关重要的环节":["30.0"],"try":["30.1","30.3"],"catch":["30.1"],"finally":["30.1"],"结构":["30.1"],"resources的引入":["30.2"],"java":["30.2","30.4"],"块结束后自动关闭":["30.3"],"无需手动调用":["30.3"],"close":["30.3"],"bufferedinputstream":["30.4"],"in":["30.4"],"null":["30.4","65.8"],"new":["30.4","72.6","80.0"],"现象":["31.0"],"不缓存html":["31.1"],"questions":["32.0"],"核心线程数":["32.1"],"处理订单请求":["32.2"],"包括验证订单信息":["32.2"],"size":["32.3","32.4"],"业务场景关联":["32.3","32.5"],"pool":["32.4"],"工作队列用于存储尚未被执行的订单处理任务":["32.5"],"应该能够满足高并发请求下的任务排队需求":["32.5"],"路由器工作在哪一层":["32.6"],"要点":["32.8"],"记录小孩的单词量":["33.1"],"百度翻译api申请":["33.2"],"调用":["33.2"],"ecdict":["33.2"],"json写法":["34.2"],"单一职责":["35.0"],"不一定是父元素":["36.0"],"定位元素":["36.0"],"追加的服务可以在应用内直接映射访问":["37.0"],"run":["38.0"],"项目":["39.1"],"400个表单需要校验":["39.1"],"不定高度内容":["39.2"],"快速滚动会产生高度跳变":["39.2"],"虚拟列表滚动":["39.2"],"调研中遇到了动态选10个显示":["39.2"],"单个sku表单":["39.3"],"重复多次的东西":["40.0"],"dotenv":["40.1","40.2"],"为什么需要这两个库":["40.1"],"方便的很":["40.3"],"save":["40.4"],"配置":["40.4","51.23"],"在":["40.4"],"config":["40.4"],"js":["40.4","58.4"],"中":["40.4"],"引入":["40.4"],"并配置":["40.4"],"javascript":["40.4","69.1","73.0"],"const":["40.4"],"require":["40.4"],"根据node":["40.5"],"env环境变量定义不同行为":["40.5"],"process":["40.5"],"env":["40.5"],"否则git大小写有的折腾呢":["41.0"],"若flutter":["42.0"],"doctor":["42.0","62.0"],"fmt":["43.1"],"time":["43.1"],"func":["43.1"],"say":["43.1"],"dockerfile":["44.0"],"expose":["44.1"],"yml":["44.1"],"docker":["44.1"],"compose":["44.1"],"version":["44.1"],"services":["44.1","48.3"],"image":["44.1"],"container":["44.1"],"name":["44.1","45.1","51.11","51.13","51.18","51.19","65.8"],"restart":["44.1"],"always":["44.1"],"ports":["44.1"],"server":["44.1"],"eq":["45.0","72.6"],"dsspacearea":["45.0"],"getid":["45.0"],"string":["45.1"],"object":["45.1"],"list":["45.1"],"之前的依赖包没法复用":["46.2"],"可能的优化方案":["46.2"],"freeswitch探索":["47.0"],"玩了一下jssip的api":["47.1"],"reinvite事件":["47.2"],"若是直接用浏览器rtc的api":["47.2"],"安装":["47.4"],"wss配置":["47.5"],"高可用性和容错":["48.1"],"通过自动重启容器和自动重新调度pod":["48.1"],"提高了应用程序的可靠性和容错能力":["48.1"],"支持多副本部署":["48.1"],"实现负载均衡和服务高可用":["48.1"],"docker只是其中一种":["48.2"],"get":["48.3","60.5"],"是的":["48.3"],"在应用了上述":["48.3"],"kubernetes":["48.3"],"部署配置之后":["48.3"],"会自动将前端应用动态部署到集群中的":["48.3"],"node":["48.3","58.4"],"节点上":["48.3"],"不需要手动将应用程序部署到特定的节点":["48.3"],"会根据在":["48.3"],"文件中定义的规则":["48.3"],"自动选择合适的节点来调度和运行":["48.3"],"集群":["48.4"],"它包含一个或多个container":["48.5"],"pod中的所有container共享相同的网络命名空间":["48.5"],"network":["48.5"],"request":["50.0"],"mysql":["51.0"],"innodb和myisam":["51.1"],"支持完整的事务处理":["51.3"],"不支持事务":["51.4"],"外键":["51.4"],"avg":["51.6","51.15"],"partition":["51.7"],"join":["51.8"],"基于条件连接表":["51.8"],"select":["51.10","51.18"],"distinct":["51.10"],"age":["51.11","51.12","51.13"],"score":["51.11","51.14","51.17"],"case":["51.12"],"when":["51.12"],"as":["51.14","51.19"],"total":["51.14"],"class":["51.15","51.16"],"exam":["51.16"],"sum":["51.17"],"文件":["51.23"],"注释掉或修改":["51.23"],"sql":["51.23"],"解决的问题":["51.23"],"innodb适合需要事务支持和外键约束的场景":["51.25"],"heimashangcheng":["52.0"],"效率高":["53.0"],"位运算是对二进制位的直接操作":["53.0"],"比一般的算术运算和逻辑运算更高效":["53.0"],"它可以在一条指令中完成多个操作":["53.0"],"因此可以提高代码的执行速度和性能":["53.0"],"节省空间":["53.0"],"位运算可以将多个状态或选项使用较少的二进制位表示":["53.0"],"场景":["53.1"],"公钥私钥配对":["53.2"],"sse":["54.1"],"群聊实现demo":["54.2"],"与web技术无缝集成":["55.1"],"开发门槛较低":["55.1"],"可以使用html":["55.1"],"css":["55.1"],"javascript等web技术进行开发":["55.1"],"方便与web应用的集成":["55.1"],"安全性高":["55.1"],"api是基于沙箱模型进行开发":["55.1"],"可以有效避免恶意代码对系统造成的影响":["55.1"],"customui":["55.2"],"xmlns":["55.2"],"http":["55.2"],"schemas":["55.2"],"microsoft":["55.2"],"com":["55.2","55.7","60.6","82.0"],"office":["55.2"],"07":["55.2","70.6"],"clickone部署自动更新":["55.4"],"优点":["55.4"],"advance":["55.5"],"installer":["55.5"],"yaolinhong":["55.7"],"blog":["55.7"],"blob":["55.7"],"main":["55.7"],"static":["55.7"],"word":["55.7"],"office文档机翻":["55.8"],"给onlyoffice":["56.1"],"callbackurl的实现":["56.2"],"当用户保存时":["56.2"],"文档服务会调用文档储存服务的":["56.2"],"callbackurl":["56.2"],"文档body中返回一个url地址和status":["56.2"],"增加额外的js":["56.3"],"图片删除":["56.4"],"增加":["56.4"],"图片大小调整":["56.4"],"字号":["56.4"],"需要二次封装一个js库":["58.0"],"输出一个自己的库":["58.0"],"安装依赖":["58.0"],"module":["58.1"],"exports":["58.1"],"mode":["58.1"],"production":["58.1"],"experiments":["58.1"],"outputmodule":["58.1"],"true":["58.1"],"optimization":["58.1"],"minimize":["58.1"],"outdir":["58.2"],"dist":["58.2"],"lib":["58.2"],"构建的入口文件":["58.2"],"entry":["58.2"],"cdnbaseurl":["58.3"],"designer":["58.3"],"global":["58.3"],"tailwindcss":["58.3"],"由于需要适配多个环境":["58.4"],"代码较为冗长":["58.4"],"且在":["58.4"],"环境中性能不如":["58.4"],"是":["58.4"],"experimentalstyleisolation":["59.1"],"环境沙箱":["59.2"],"环境沙箱是指应用初始化过之后":["59.2"],"html":["59.3"],"思路":["59.5"],"提供了集中式的状态管理方案":["59.6"],"它通过":["59.6"],"旨在陪伴kids":["60.0"],"单词本下面":["60.1"],"所有分类接口":["60.1"],"单词列表中返回分类id":["60.1"],"单词关联分类接口":["60.1"],"xml中新增字段飘红":["60.1"],"数据库需要设置默认值0":["60.4"],"单词本单词":["60.5"],"xml版本":["60.5"],"支持分页加载":["60.5"],"param":["60.5"],"return":["60.5"],"getmapping":["60.5"],"words":["60.5"],"resultmap":["60.6"],"yao":["60.6"],"wxmp":["60.6"],"大厂使用比较多":["61.1"],"net":["61.2"],"servicepointmanager":["61.2"],"securityprotocol":["61.2"],"bor":["61.2"],"iex":["61.2"],"native":["62.0"],"有界面操作":["63.1"],"在线":["64.1"],"功能":["64.1"],"多个不同tab页面之间数据交互":["64.1"],"demo":["64.2"],"dto":["65.2"],"通用包装类等":["65.3"],"安装之后":["65.6"],"构建器":["65.7"],"用于创建对象":["65.7"],"如实现类中":["65.7"],"username":["65.8"],"fbx":["66.1"],"js相机编辑器":["66.2"],"hdr图":["66.3"],"车子模型轮子部分":["66.5"],"坑":["68.0"],"实现原理":["69.0"],"如何阻塞nexttick内依赖改变的内容导致的页面更新":["69.1"],"不停地push微任务":["69.1"],"本轮事件循环就一直不会结束":["69.1"],"代码如下":["69.1"],"let":["69.1"],"queue":["69.1"],"promise":["69.1"],"resolve":["69.1"],"cb":["69.1"],"then":["69.1"],"toraw":["69.4"],"09":["70.0"],"lasteditors":["70.0"],"glb":["70.4"],"compressed":["70.4"],"texture":["70.4"],"compress":["70.4"],"webp":["70.4"],"一键压缩效果":["70.4"],"来减少模型中的多边形数量":["70.5"],"这可以通过简化几何形状":["70.5"],"合并顶点或使用lod":["70.5"],"level":["70.5"],"detail":["70.5"],"技术来实现":["70.5"],"revit模型渲染":["70.7"],"mvp":["70.7"],"06":["70.8"],"js训练场":["70.17"],"渲染引擎的性能和效果优化":["70.19"],"前后端及上下游工具链图形能力建设":["70.19"],"显示素材数据的转化和优化处理":["70.19"],"抽象几个关键的技术要素":["70.20"],"webgl":["70.20"],"主要目标":["70.21"],"有业余开源项目供技术参考":["70.21"],"最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现":["70.23"],"一看是直接放的video":["70.23"],"按住屏幕":["70.24"],"触发动画":["70.24"],"three":["70.25"],"native支付并不能用网站引用的appid申请":["71.2"],"需要单独打开项目":["72.1"],"not":["72.3"],"加锁和释放锁":["72.4"],"无论方法正常执行完毕还是抛出异常":["72.4"],"原因":["72.5"],"账户不能重复":["72.6"],"querywrapper":["72.6"],"user":["72.6"],"long":["72.6"],"count":["72.6"],"usermapper":["72.6"],"记笔记":["73.0"],"主要是过后自己翻阅可以加深理解":["73.0"],"分享给他人的内容":["73.0"],"当然需要再深度加工产出博客":["73.0"],"上面说的还是一些原则性的东西":["73.0"],"下面是具体的计划":["73.0"],"前端技术沉淀":["73.0"],"作用域":["73.0"],"闭包":["73.0"],"原型链":["73.0"],"总结":["74.0"],"发布了自己的web3测试链":["74.1"],"c":["74.1"],"webview落地word插件":["74.1"],"发布实践":["74.1"],"oneclick部署":["74.1"],"electron":["74.1"],"网盘应用源码精读":["74.1"],"electron原理书泛读":["74.1"],"严格工时评估的能力差":["74.2"],"需求评审不够严谨":["74.2"],"松散的目标意识":["74.2"],"如saas中":["74.2"],"有时候会眼高手低":["74.3"],"笔记":["74.4"],"代码库":["74.4"],"沉淀代码资产":["74.4"],"不限于工具库":["74.4"],"ui库":["74.4"],"重视输出":["74.4"],"word插件项目":["75.3"],"前端消息确认":["75.5"],"description":["75.5"],"工期紧":["76.1"],"一期迭代要求一周":["76.1"],"难点":["76.1"],"原单页面改全站seo":["76.1"],"br":["76.1","76.2"],"主子页面登录态共享":["76.1"],"选型":["76.1","76.2"],"设计":["76.2"],"多子系统共用组件库":["76.2"],"共享依赖":["76.2"],"全局组件库":["76.2"],"css隔离":["76.2"],"样式隔离":["76.2"],"rbac":["76.2"],"页面抖动":["76.3"],"删除节点页面跳动":["76.3"],"复杂业务代码改造":["76.3"],"item":["76.3"],"i18n":["76.4"],"公共组件库处理":["76.5"],"iframe":["76.6"],"可基于vue扩展":["77.0"],"vitepress":["77.0"],"zxvf":["78.0"],"maotai":["78.0"],"fe":["78.0"],"gz":["78.0"],"unzip":["78.0"],"date":["80.0"],"gettime":["80.0"],"获取用户输入的时间戳":["80.0"],"parseint":["80.0"],"isnan":["80.0"],"console":["80.0"]},{"0":["7.0","43.1","72.6"],"1":["46.2","48.3","53.1","60.2","64.1","70.24"],"2":["17.11","17.21","30.3","32.1","48.3","54.2","55.5","70.5","70.24","72.6"],"3":["47.2","48.1"],"5":["24.0"],"6":["24.0"],"7":["56.4"],"11":["70.0"],"15":["70.4","70.8"],"19":["48.3"],"20":["70.3"],"23":["70.6"],"92":["55.7"],"768":["24.0"],"apis":["0.0"],"provided":["0.0"],"by":["0.0","17.9","51.7"],"vitepress":["0.0"],"documentation":["0.9"],"ollama":["1.2"],"com":["1.2","20.0","44.1"],"install":["1.2"],"修改":["2.0"],"webui":["2.0"],"user":["2.0"],"确保数据格式一致":["3.4"],"并为模型提供适当的标签":["3.4"],"如合同类型":["3.4"],"条款等":["3.4"],"模型选择和训练":["3.4"],"选择合适的llm模型":["3.4"],"如bert":["3.4"],"从左往右查找大于基准的数":["4.2"],"从右往左查找小于基准的数":["4.2"],"the":["5.4"],"不给货":["6.0"],"大宗商品":["6.0"],"path":["7.0","40.4"],"gulp定义了系列任务":["9.1"],"ide":["10.0"],"integrated":["10.0"],"development":["10.0"],"environment":["10.0"],"集成开发环境":["10.0"],"ip":["10.0"],"internet":["10.0"],"protocol":["10.0"],"网络协议":["10.0"],"javascript":["10.0"],"js":["10.0","70.25"],"编程语言":["10.0"],"json":["10.0","40.5"],"object":["10.0","61.2"],"notation":["10.0"],"数据交换格式":["10.0"],"localhost":["10.0"],"本地主机":["10.0"],"middleware":["10.0"],"中间件":["10.0"],"module":["10.0","40.4"],"模块":["10.0"],"open":["10.0","24.0"],"source":["10.0"],"开源":["10.0"],"patch":["10.0"],"补丁":["10.0"],"permission":["10.0"],"权限":["10.0"],"协议":["10.0"],"python":["10.0"],"connect":["10.1"],"format":["11.0"],"需要配置服务器":["12.0"],"已经让openai有了代差":["13.1"],"进入了增长飞轮":["13.1"],"国产模型":["13.1"],"替代开源模型难以企及":["13.1"],"这时可以使用静态变量来表示公司的名称":["14.0"],"常量":["14.0"],"静态变量通常用于表示常量":["14.0"],"因为它们的值在整个程序执行期间保持不变":["14.0"],"asia":["15.0"],"shanghai":["15.0"],"获取密码":["15.0"],"登录":["15.0"],"安装gitee插件":["15.0"],"gmail":["16.0"],"result":["17.7"],"c":["17.7"],"r":["17.7"],"using":["17.9"],"additional":["17.9"],"change":["17.10"],"forces":["17.10"],"new":["17.10","40.4","58.1","61.2"],"start":["17.10"],"ac":["17.10"],"tristique":["17.10"],"libero":["17.10"],"volutpat":["17.10"],"at":["17.10"],"used":["17.12"],"for":["17.12","18.0","43.1"],"processing":["17.12"],"handlebars":["17.12"],"is":["17.12"],"default":["17.12"],"title":["17.13"],"autoconverted":["17.13"],"style":["17.14"],"syntax":["17.14"],"alt":["17.14"],"text":["17.14","17.20","27.1","60.1"],"of":["17.15"],"markdown":["17.15"],"laughing":["17.16"],"yum":["17.16"],"th":["17.17"],"second":["17.20"],"inline":["17.20"],"withinline":["17.21"],"markup":["17.21"],"converts":["17.22"],"but":["17.22"],"here":["17.23"],"setschedulepagefileid":["18.0"],"内容":["18.0"],"ishavepart":["18.0"],"false":["18.0"],"skulist":["18.0"],"判断是否启用本期内容并且要是ccd机构成员":["18.0"],"projectbelongenable":["18.0"],"xizhaocommonconfig":["18.0"],"getbelongenable":["18.0"],"equals":["18.0"],"郑中设计":["18.0"],"getinstitutionname":["18.0"],"partslist":["18.0"],"stringutils":["18.0"],"gettolist":["18.0"],"g":["19.1","19.2"],"node":["19.1","40.5","48.4"],"gyp":["19.1"],"对应的python版本":["19.1"],"examples":["20.0"],"程序员如何用技术变现":["21.0"],"关注有价值的东西":["21.0"],"价值取决于供需关系":["21.0"],"分清什么是主流技术":["21.0"],"什么是过渡式的技术":["21.0"],"关注技术付费点":["21.0"],"一个是":["21.0"],"activation":["23.0"],"activebydefault":["23.0"],"true":["23.0","40.4"],"base":["24.0"],"common":["24.0"],"alibaba":["24.0"],"reos":["24.0"],"file":["24.0","30.4"],"api":["24.0","25.0","70.20"],"sdk":["24.0","62.0"],"测试多个组件或模块之间的交互":["25.0"],"cypress":["25.0"],"涉及真实的组件交互":["25.0"],"可能使用实际的":["25.0"],"或模拟":["25.0"],"调用":["25.0"],"端到端测试":["25.0"],"end":["25.0"],"to":["25.0"],"e2e":["25.0"],"在浏览器环境中模拟用户交互测试整个应用":["25.0"],"selenium":["25.0"],"playwright":["25.0"],"标注bug修改":["26.1"],"按年":["27.2"],"learning":["28.0"],"record":["28.0"],"那么会重新new一个组件":["29.1"],"它直接关系到程序的稳定性和性能":["30.0"],"java":["30.0"],"7引入了一种新的资源管理语句":["30.0"],"开发者需要在":["30.1"],"块中显式关闭资源":["30.1"],"如文件流":["30.1"],"7的":["30.2"],"减少资源泄漏":["30.3"],"即使发生异常":["30.3"],"资源也会被正确关闭":["30.3"],"fileinputstream":["30.4"],"txt":["30.4"],"处理文件数据":["30.4"],"catch":["30.4"],"语句是java资源管理的一大进步":["30.5"],"它通过自动关闭资源简化了代码":["30.5"],"偶先页面渲染异常":["31.0"],"最大线程数":["32.1"],"扣除库存":["32.2"],"生成订单号等":["32.2"],"核心线程数应该根据订单的日均请求量和处理时间来确定":["32.3"],"对于一个电商平台":["32.3"],"业务场景关联":["32.4"],"最大线程数应该根据系统的资源限制和预期的最大并发量来确定":["32.4"],"在电商平台中":["32.5"],"可以选择一个适当大小的有界队列来限制订单处理的并发量":["32.5"],"如何建立可靠的连接":["32.7"],"支持分享单词本":["33.1"],"社区词典数据库":["33.2"],"单词发音":["33.2"],"tts":["33.2"],"todo":["34.2"],"渲染列表":["35.0"],"position属性为relative":["36.0"],"absolute":["36.0"],"build":["38.0"],"每个表单有20个左右的校验项":["39.1"],"高度跳变的问题":["39.2"],"也有解决方案":["39.2"],"但实现成本大":["39.2"],"整体表单校验":["39.3"],"使用nextick方式":["39.3"],"总结成模板":["40.0"],"set":["40.1","45.0"],"注入环境成功":["40.2"],"vue的脚手架会直接注入到项目代码中":["40.3"],"exports":["40.4","58.4"],"其他配置":["40.4"],"plugins":["40.4"],"确保只加载指定的":["40.4"],"env文件":["40.4"],"避免加载所有文件":["40.4"],"路径可以自定义":["40.4"],"systemvars":["40.4"],"允许系统环境变量":["40.4"],"stringify":["40.5"],"不通过":["42.0"],"使用java8":["42.0"],"s":["43.1"],"string":["43.1"],"i":["43.1","78.0"],"https配置":["44.0"],"listen":["44.1"],"ssl":["44.1"],"youdomin":["44.1"],"certificate":["44.1"],"crt":["44.1"],"下载下来的证书名称不能改":["44.1"],"key":["44.1"],"tokens":["44.1"],"off":["44.1"],"dto":["45.0"],"dgs":["45.1"],"jenkins只触发docker":["46.2"],"仓库名称":["47.0"],"vue":["47.0","77.0"],"replacetrack替换轨道":["47.2"],"重新offer":["47.2"],"jssip库":["47.2"],"windows下":["47.4"],"参考博客":["47.5"],"资源利用率和集群管理":["48.1"],"通过自动调度":["48.1"],"充分利用集群资源":["48.1"],"提高资源利用率":["48.1"],"支持自动伸缩":["48.1"],"根据应用程序负载动态调整资源分配":["48.1"],"还有":["48.2"],"pod":["48.3"],"它会考虑诸如节点资源可用性":["48.3"],"节点标签":["48.3"],"污点和容忍等多种调度策略":["48.3"],"从而实现高效且合理的应用程序分布":["48.3"],"在部署过程中":["48.3"],"不需要处理太多其他逻辑":["48.3"],"会自动为处理以下任务":["48.3"],"拉取容器镜像":["48.3"],"会从配置的容器镜像仓库中拉取":["48.3"],"nginx":["48.3"],"alpine":["48.3"],"镜像":["48.3"],"namespace":["48.5"],"和存储卷":["48.5"],"volumes":["48.5"],"执行build的命令":["49.1"],"速览gitlab":["50.0"],"数据库引擎选择与sql查询技巧":["51.0"],"并提供了它们在事务支持":["51.1"],"外键":["51.1","51.3"],"支持外键约束":["51.3"],"不支持外键":["51.4"],"max":["51.6"],"left":["51.8"],"class":["51.10"],"id":["51.10","55.2"],"from":["51.11","51.13"],"student":["51.11","51.13"],"then":["51.12"],"老同学":["51.12"],"order":["51.13"],"avg":["51.14"],"score":["51.15"],"as":["51.15","51.16","51.17"],"num":["51.16"],"count":["51.16"],"total":["51.17"],"date":["51.18"],"upper":["51.19"],"严格模式":["51.23"],"strict":["51.23"],"如果应用程序在开发过程中没有严格遵守数据库的约束和规则":["51.23"],"可能会产生错误":["51.23"],"关闭严格模式可以减少这类错误":["51.23"],"使得开发和调试过程更加灵活":["51.23"],"而myisam适合对读取速度有高要求的场景":["51.25"],"docker启动":["52.0"],"从而节省存储空间":["53.0"],"这在需要处理大量数据或对性能要求较高的场景中特别有用":["53.0"],"适用于某些特定问题":["53.0"],"位运算在某些问题和算法中非常有用":["53.0"],"例如处理图像":["53.0"],"压缩算法":["53.0"],"权限控制等":["53.0"],"https中的加密":["53.2"],"data":["53.3"],"transfer":["53.3"],"体验一下国际服玩家的利器next":["54.1"],"高度扩展性":["55.1"],"可以通过使用office":["55.1"],"add":["55.1","58.0"],"ins等技术进行扩展":["55.1"],"增加插件的功能和适用范围":["55.1"],"开发负担":["55.1"],"无法抹平两套sdk差异":["55.1"],"资源发布需要上架审核":["55.1"],"应用分别受两家厂商限制":["55.1"],"2套代码":["55.1"],"onload":["55.2"],"ribbon":["55.2"],"load":["55.2"],"tabs":["55.2"],"tab":["55.2"],"tab1":["55.2"],"安装之后":["55.4"],"innosetup":["55.5"],"e6":["55.7"],"8f":["55.7"],"e4":["55.7"],"bb":["55.7"],"b6":["55.7"],"社区参考资料少":["55.8"],"editing服务提供文件":["56.1"],"status为6":["56.2"],"此时储存服务去保存":["56.2"],"保存成功失败返回对应的状态码":["56.2"],"status":["56.2"],"把构建好的web":["56.3"],"间距":["56.4"],"br":["56.4"],"行间距等调整":["56.4"],"文字增删":["56.4"],"td":["56.4"],"colspan":["56.4"],"align":["56.4"],"center":["56.4"],"iframe":["56.4"],"pnpm":["58.0"],"minimizer":["58.1"],"minify":["58.1"],"uglifyjsminify":["58.1"],"terseroptions":["58.1"],"options":["58.1"],"will":["58.1"],"be":["58.1"],"passed":["58.1"],"src":["58.2"],"index":["58.2","58.3"],"当产物为":["58.2"],"umd":["58.2"],"router":["58.3"],"的模块系统":["58.4"],"通过":["58.4"],"require":["58.4"],"函数加载模块":["58.4"],"并通过":["58.4"],"或":["58.4"],"对象导出模块":["58.4"],"主要用于服务器端":["58.4"],"同步加载模块可能导致浏览器性能问题":["58.4"],"shadow":["59.1"],"应用会在什么样的上下文环境运行":["59.2"],"每个应用的环境沙箱只会初始化一次":["59.2"],"因为子应用只会触发一次":["59.2"],"entry方案":["59.3"],"这个方案是通过正则表达式将":["59.3"],"debug":["59.5"],"props":["59.6"],"和全局状态对象来实现子应用之间的通信和状态共享":["59.6"],"私有单词库":["60.0"],"前端":["60.1"],"单词本列表中请求所有分类":["60.1"],"点击编辑":["60.1"],"可以关联分类":["60.1"],"关联分类之后刷新列表":["60.1"],"列表中分类展示":["60.1"],"根据分类list接口map展示":["60.1"],"查询词典":["60.2"],"然后需要添加":["60.4"],"xml":["60.5"],"public":["60.5"],"baseresponse":["60.5"],"page":["60.5"],"dics":["60.5"],"getwordsbyid":["60.5"],"int":["60.5"],"requestparam":["60.5"],"defaultvalue":["60.5"],"mapper":["60.6"],"dicsmapper":["60.6"],"baseresultmap":["60.6"],"d":["60.6"],"flutter":["61.1"],"中小厂使用比较多":["61.1"],"webclient":["61.2"],"downloadstring":["61.2"],"https":["61.2"],"community":["61.2"],"chocolatey":["61.2"],"org":["61.2"],"设置系统环境变量":["62.0"],"落地场景":["64.1"],"electron":["64.1","76.6"],"render进程之间交互":["64.1"],"entity":["65.2"],"设置schema":["65.6"],"employee":["65.7"],"password":["65.8"],"phone":["65.8"],"usdz":["66.1"],"模型下载网站":["66.2"],"模型贴图":["66.3"],"cubecamera":["66.4"],"材质贴图":["66.5"],"onmounted问题解决":["68.0"],"微前端场景下如何服用子vue实例的component":["69.0"],"嵌套路由场景下":["69.0"],"模拟无限添加微任务":["69.1"],"addinfinitetask":["69.1"],"console":["69.1"],"log":["69.1"],"infinite":["69.1"],"task":["69.1"],"这里会无线阻塞主进程":["69.1"],"什么时候更新":["69.1"],"下次更新dom之前":["69.1"],"能拿到更新后的虚拟dom":["69.1"],"运行的时候只是提交更新":["69.1"],"并不会直接执行渲染":["69.1"],"有什么区别":["69.4"],"lastedittime":["70.0"],"info":["70.4"],"mb":["70.4"],"压缩纹理":["70.5"],"纹理是模型中常用的图像贴图":["70.5"],"可以给模型增加细节和颜色":["70.5"],"你可以使用图像压缩工具":["70.5"],"如jpeg或png压缩算法":["70.5"],"来减小纹理文件的大小":["70.5"],"预览":["70.7"],"仓库地址":["70.7"],"feat":["70.17"],"metaverse游戏":["70.17"],"岗位要求":["70.19"],"计算机或相关专业":["70.19"],"或丰富从业经验":["70.19"],"本科及以上学历":["70.19"],"计算机基础扎实":["70.19"],"web图形领域":["70.20"],"找相关开源项目":["70.21"],"找webgl下的问题场景":["70.21"],"直接解决相关的问题":["70.21"],"对于需要seo的页面来说":["70.23"],"或许blender建模后支出video":["70.23"],"车辆行驶空气的粒子效果":["70.24"],"车轮转动效果":["70.24"],"订阅号无法开通此接口":["71.1"],"必须将微信支付id":["71.2"],"null的字段没有写入":["72.3"],"都会释放锁":["72.4"],"一把锁只能同时被一个线程获取":["72.4"],"没有获得锁的线程只能等待":["72.4"],"gateway挂了":["72.5"],"selectcount":["72.6"],"if":["72.6"],"throw":["72.6"],"businessexception":["72.6"],"errorcode":["72.6"],"params":["72.6"],"error":["72.6","80.0"],"账号重复":["72.6"],"加密":["72.6"],"算法与数据结构":["73.0"],"常态学习":["73.0"],"阅读笔记":["73.0"],"leecode":["73.0"],"快排":["73.0"],"爬楼梯":["73.0"],"暴力解":["73.0"],"不做的事情":["73.0"],"除非有好的深入的项目":["73.0"],"否则不摸客户端类":["73.0"],"3d":["74.1"],"钻研了revit转glb":["74.1"],"drao模型压缩":["74.1"],"three":["74.1"],"js模型渲染":["74.1"],"revit模型选然后":["74.1"],"构建选择":["74.1"],"jssip":["74.1"],"错误估计整体提测时间":["74.2"],"需求侧不确定的情况下":["74.2"],"花很多时间做一些不确定的需求":["74.2"],"重复劳动":["74.2"],"得下场多做":["74.3"],"b":["74.3"],"少些demo项目":["74.4"],"多些深入探索":["74.4"],"要有产出成果":["74.4"],"仓库开源":["74.4"],"or形成相应的技术文章":["74.4"],"记笔记":["74.4"],"主要是过后自己翻阅可以加深理解":["74.4"],"分享给他人的内容":["74.4"],"背景":["75.5"],"session方案":["76.1"],"vue2":["76.1"],"nuxt2":["76.1"],"cv简单修改即可":["76.1"],"落地快":["76.1"],"or":["76.2"],"rbac1":["76.2"],"角色继承":["76.2"],"省空间":["76.2"],"制定路由规范":["76.2"],"一级规定指向应用":["76.2"],"主应用控制应用进入的权限":["76.2"],"子应用内路由首位使用基座的共享方法去控制具体页面的路由权限":["76.2"],"公共组件库":["76.2"],"主应用分发":["76.2"],"处理为计算属性":["76.3"],"一些个人的经验":["76.3"],"关于虚拟列表相关的优化它真的就只是在优化":["76.3"],"直接限制你每次滚动的范围":["76.3"],"就类似之前看到大屏做上下幻灯片滚动一样":["76.3"],"动态rem":["76.4"],"二次封装组件":["76.5"],"限制":["76.6"],"theme":["77.0"],"zip":["78.0"],"ubuntu安装deb包":["78.0"],"sudo":["78.0"],"dpkg":["78.0"],"package":["78.0"],"deb":["78.0"],"杀掉8888端口应用":["78.0"],"请输入有效的unix时间戳":["80.0"],"return":["80.0"],"当前时间":["80.0"],"now":["80.0"],"dayjs":["80.0"],"输入时间":["80.0"],"inputtime":["80.0"],"unix":["80.0"],"计算年":["80.0"],"月":["80.0"],"天的差异":["80.0"],"let":["80.0"],"ylh1995":["82.0"]},{"1":["30.1","44.1","56.2","60.5"],"2":["9.1","39.2","42.0","44.1","55.1","58.3"],"3":["17.11","30.3","32.1","40.4","48.3","66.4","70.5","70.24","72.6"],"4":["48.1","76.2"],"5":["43.1","44.1","58.3"],"9":["78.0"],"10":["60.5"],"11":["63.2"],"20":["51.12","70.0"],"21":["70.0"],"33":["70.0"],"56":["70.0"],"81":["70.4"],"88":["55.7"],"95":["55.7"],"390":["70.4"],"8888":["78.0"],"1455045065":["56.4"],"1564520831":["56.4"],"main":["0.0"],"usedata":["0.0"],"can":["0.0"],"be":["0.0","17.23"],"for":["0.9"],"sh":["1.2"],"bat里":["2.0"],"set":["2.0"],"gpt等":["3.4"],"并进行预训练或微调":["3.4"],"以适应合同审查的任务":["3.4"],"使用已标记的合同数据来训练模型":["3.4"],"使其能够理解和分析合同中的文本内容":["3.4"],"识别关键条款":["3.4"],"风险和潜在问题":["3.4"],"交换数值":["4.2"],"继续查找":["4.2"],"交换":["4.2"],"dao":["5.4"],"店铺资源":["6.0"],"to":["7.0","58.1"],"myscript":["7.0"],"query":["10.0"],"查询":["10.0"],"repository":["10.0"],"repo":["10.0"],"仓库":["10.0"],"runtime":["10.0"],"运行时":["10.0"],"script":["10.0"],"脚本":["10.0"],"server":["10.0"],"服务器":["10.0"],"session":["10.0","44.1"],"会话":["10.0"],"software":["10.0"],"软件":["10.0"],"stack":["10.0"],"栈":["10.0"],"syntax":["10.0"],"语法":["10.0"],"token":["10.0"],"令牌":["10.0"],"url":["10.0"],"uniform":["10.0"],"resource":["10.0"],"locator":["10.0"],"统一资源定位符":["10.0"],"variable":["10.0"],"变量":["10.0"],"virtual":["10.0"],"machine":["10.0"],"vm":["10.0"],"you":["10.1"],"导出ddl":["11.0"],"服务端":["12.0"],"使用gpt是最优解":["13.1"],"套壳gpt":["13.1"],"固定prompt":["13.1"],"没有意义":["13.1"],"数学中的π":["14.0"],"圆周率":["14.0"],"配置hooks":["15.0"],"这里选择的是scm的方式":["15.0"],"每15分钟拉取git仓库":["15.0"],"比较最新的哈希值":["15.0"],"com":["16.0","45.1","55.1","56.4","58.1","69.1"],"tm":["17.7"],"greater":["17.9"],"than":["17.9"],"signs":["17.9"],"facilisis":["17.10"],"in":["17.10"],"pretium":["17.10"],"nisl":["17.10"],"aliquet":["17.10"],"nulla":["17.10"],"aliquam":["17.10"],"velit":["17.10"],"very":["17.10"],"block":["17.11"],"ext":["17.12"],"extension":["17.12"],"dest":["17.12"],"right":["17.12","51.8"],"aligned":["17.12"],"https":["17.13","47.2","58.1","69.1","70.7"],"id":["17.14","65.7"],"with":["17.14"],"reference":["17.14"],"later":["17.14"],"it":["17.15"],"is":["17.15"],"shortcuts":["17.16"],"emoticons":["17.16"],"h":["17.17"],"of":["17.20","17.21"],"some":["17.21"],"code":["17.21"],"part":["17.21"],"keep":["17.22"],"intact":["17.22"],"partial":["17.22"],"belongenablepartlist":["18.0"],"stream":["18.0"],"filter":["18.0"],"m":["18.0"],"belongenable":["18.0"],"get":["18.0"],"return":["18.0"],"integer":["18.0"],"parseint":["18.0"],"tostring":["18.0"],"collect":["18.0"],"collectors":["18.0"],"tolist":["18.0"],"true":["18.0","56.4"],"可以构建一个可以给调用的cc文件":["19.1"],"node":["19.2","40.1"],"fine":["20.0"],"tune":["20.0"],"能帮别人":["21.0"],"挣钱":["21.0"],"的地方":["21.0"],"另一个是":["21.0"],"省钱":["21.0"],"test":["23.0"],"覆盖用户行为和真实的应用流程":["25.0"],"检测综合功能和集成":["25.0"],"可访问性测试":["25.0"],"accessibility":["25.0"],"检查应用是否符合可访问性标准":["25.0"],"axe":["25.0"],"lighthouse":["25.0"],"关注可访问性问题":["25.0"],"确保应用适用于残障人士":["25.0"],"视觉回归测试":["25.0"],"visual":["25.0"],"regression":["25.0"],"视觉效果的变化":["25.0"],"backstopjs":["25.0"],"percy":["25.0"],"比较当前":["25.0"],"截图与基准截图":["25.0"],"uat发布":["26.1"],"私有云":["27.1"],"3w一年":["27.2"],"代码":["28.0"],"正常业务操作":["29.1"],"数据库连接等":["30.1"],"这种方式存在几个问题":["30.1"],"资源泄漏":["30.1"],"降低了资源泄漏风险":["30.3"],"代码简洁性":["30.3"],"ioexception":["30.4"],"e":["30.4"],"printstacktrace":["30.4"],"finally":["30.4"],"if":["30.4"],"减少了资源泄漏的风险":["30.5"],"并提高了代码的可读性和可维护性":["30.5"],"css没加载完全":["31.0"],"技术栈":["32.2"],"java后端开发":["32.2"],"订单请求可能会呈现出明显的日周期性波动":["32.3"],"因此核心线程数应该足够以应对峰值时段的订单处理需求":["32.3"],"在电商平台中":["32.4"],"最大线程数的设置应该考虑服务器的cpu和内存资源":["32.4"],"以防止系统资源被无限制地占用":["32.5"],"技术实现":["32.5","70.24"],"在threadpooltaskexecutor中":["32.5"],"三次握手的详细过程":["32.7"],"家人范围内共享":["33.1"],"使用社区免费的tts":["33.2"],"使用社区开源tts":["33.2"],"http":["33.2"],"渲染组件":["35.0"],"fixed或sticky":["36.0"],"会影响其后代元素的offsettop":["36.0"],"多选":["39.1"],"单选":["39.1"],"也有loading":["39.2"],"表单提交时前端校验需要校验所有数据":["39.2"],"需要改造校验逻辑":["39.2"],"替换数据":["39.3"],"循环赋值":["39.3"],"打包时":["40.2"],"vite会注入vite":["40.3"],"将环境变量注入到代码中":["40.4"],"process":["40.4"],"通过env":["40.4"],"js文件动态引用环境变量":["40.4"],"其他插件":["40.4"],"创建":["40.4","48.3"],"创建一个名为":["40.4"],"的配置文件":["40.4"],"该文件将动态地返回环境变量对象":["40.4"],"定义react项目中可能会用到的其他环境变量":["40.5"],"anroid":["42.0"],"前置步骤":["44.0"],"keepalive":["44.1"],"timeout":["44.1"],"5m":["44.1"],"protocols":["44.1"],"tlsv1":["44.1"],"可参考此":["44.1"],"协议进行配置":["44.1"],"ciphers":["44.1"],"ecdhe":["44.1"],"rsa":["44.1"],"aes128":["44.1"],"gcm":["44.1"],"sha256":["44.1"],"high":["44.1"],"anull":["44.1"],"md5":["44.1"],"rc4":["44.1"],"dhe":["44.1"],"getname":["45.0"],"itemno":["45.1"],"xizhao":["45.1"],"project":["45.1"],"util":["45.1"],"stringutils":["45.1"],"trim":["45.1"],"restart":["46.2"],"而不重新构建镜像":["46.2"],"fs":["47.0"],"dtmf":["47.2"],"下载msi":["47.4"],"并配置nginx之后":["47.5"],"提供集中式监控和管理工具":["48.1"],"简化了集群操作":["48.1"],"一致性和隔离性":["48.1"],"通过容器和命名空间":["48.1"],"实现了应用程序之间的隔离和一致性部署":["48.1"],"containerd":["48.2"],"会根据":["48.3"],"中的配置":["48.3"],"创建包含前端应用容器的":["48.3"],"挂载卷":["48.3"],"会将指定的本地构建产物目录挂载到":["48.3"],"容器中的":["48.3"],"usr":["48.3"],"share":["48.3"],"html":["48.3","56.4"],"子节点":["48.4"],"pod是一个临时性的实体":["48.5"],"如果pod中的某个container终止":["48.5"],"整个pod也会被重新创建":["48.5"],"的mr功能":["50.0"],"索引结构":["51.1","51.4"],"有助于维护数据完整性":["51.3"],"使用b":["51.4"],"min":["51.6"],"用于计算分组内的数据":["51.7"],"exam":["51.10"],"order":["51.11"],"by":["51.11","51.13"],"年轻":["51.12"],"max":["51.14"],"from":["51.15","51.16","51.17","60.6"],"total":["51.16"],"student":["51.17"],"group":["51.17","55.2"],"as":["51.18"],"当前日期":["51.18"],"兼容性问题":["51.23"],"在某些情况下":["51.23"],"应用程序可能需要与旧版本的数据库或不同的数据库系统兼容":["51.23"],"通过调整sql模式":["51.23"],"可以模拟其他数据库系统的行为":["51.23"],"性能优化":["51.23"],"同时":["51.25","70.5"],"它可以简化代码实现并提高处理效率":["53.0"],"缺点":["53.0"],"可读性较差":["53.0"],"位运算涉及对二进制位的直接操作":["53.0"],"对于不熟悉位运算的开发者来说":["53.0"],"代码可读性较差":["53.0"],"如任意api":["53.1"],"为啥需要证书":["53.2"],"object":["53.3"],"js":["54.1"],"打字机推送效果":["54.2"],"无法兼容":["55.1"],"加载项":["55.1"],"功能强大":["55.1"],"使用com加载项可以实现更复杂的功能和操作":["55.1"],"js版本的接口相对阉割":["55.1"],"高性能":["55.1"],"com加载项可以直接访问本地api":["55.1"],"不需要通过网络访问":["55.1"],"label":["55.2"],"应用名称":["55.2"],"contentgroup":["55.2"],"aegis":["55.2"],"button":["55.2"],"更新服务器资源后":["55.4"],"用户端每次重启word均会拉取最新版本word":["55.4"],"好处":["55.5"],"9e":["55.7"],"9c":["55.7"],"png":["55.7"],"raw":["55.7"],"给对应加密信息":["56.1"],"描述":["56.2"],"出现条件":["56.2"],"正在编辑文档":["56.2"],"每次用户连接或断开文档共同编辑时都会收到它":["56.2"],"app包":["56.3"],"src":["56.4","69.1"],"player":["56.4"],"bilibili":["56.4"],"isoutside":["56.4"],"aid":["56.4"],"bvid":["56.4"],"bv1hi421s7qd":["56.4"],"cid":["56.4"],"p":["56.4"],"webpack":["58.0","58.4"],"cli":["58.0"],"uglify":["58.1"],"link":["58.1"],"github":["58.1","69.1"],"mishoo":["58.1"],"iife":["58.2"],"格式时":["58.2"],"该模块暴露的全局变量名称":["58.2"],"name":["58.2"],"xzui":["58.2"],"vuerouter":["58.3"],"且在浏览器端需要转换工具如":["58.4"],"browserify":["58.4"],"asynchronous":["58.4"],"是一种异步模块定义规范":["58.4"],"适用于浏览器环境":["58.4"],"允许异步加载模块以优化页面加载":["58.4"],"dom":["59.1"],"bootstrap":["59.2"],"子应用在切换时":["59.2"],"实际上切换的是":["59.2"],"子应用的":["59.3"],"进一步定位抛错位置":["59.5"],"singlespa":["59.6"],"则更加灵活":["59.6"],"科学review":["60.0"],"中文词典搜索":["60.1"],"添加全文索引":["60.1"],"regexp和like使用了表扫描而不是索引":["60.1"],"但对中文不友好":["60.1"],"搜索不到":["60.1"],"所以用like匹配":["60.1"],"alter":["60.1"],"table":["60.1"],"dics":["60.1"],"发音":["60.2"],"tablelogic":["60.4"],"current":["60.5"],"size":["60.5"],"httpservletrequest":["60.5"],"rdic":["60.6"],"custom":["60.6"],"words":["60.6"],"增长趋势较好":["61.1"],"install":["61.2"],"ps1":["61.2"],"安装":["61.2"],"jdk17":["61.2"],"choco":["61.2"],"y":["61.2"],"microsoft":["61.2"],"openjdk17":["61.2"],"platform":["62.0"],"tools":["62.0"],"主进程设置了一个messagechannel":["64.1"],"分发给不同的渲染进程":["64.1"],"进程间通信":["64.1"],"vo":["65.2"],"有代码提示":["65.6"],"status":["65.7"],"sex":["65.8"],"idnumber":["65.8"],"number":["65.8"],"新的":["66.1"],"sketchfab":["66.2"],"照明":["66.3"],"地面":["66.5"],"全局样式覆盖":["68.0"],"什么时候执行渲染":["69.1"],"在事件循环的任务队列执行完毕后进行的":["69.1"],"如何确保dom已经更新":["69.1"],"而不是虚拟dom更新":["69.1"],"双requestanimationframe":["69.1"],"twickstrom":["69.1"],"vue":["69.1"],"force":["69.1"],"next":["69.1"],"tick":["69.1"],"blob":["69.1"],"master":["69.1"],"以下是自己测试之后的总结":["69.4"],"filepath":["70.0"],"ylh":["70.0"],"blog":["70.0","82.0"],"kb":["70.4"],"报错":["70.4"],"console":["70.4"],"error":["70.4"],"missing":["70.4"],"parent":["70.4"],"还可以考虑使用纹理压缩格式":["70.5"],"如draco":["70.5"],"压缩算法":["70.5"],"dds或astc":["70.5"],"以减少文件大小":["70.5"],"安装revit":["70.7"],"按住空格":["70.17"],"熟悉常用算法数据结构设计模式":["70.19"],"有良好的编程习惯":["70.19"],"熟练掌握基本的线性代数":["70.19","70.20"],"几何":["70.19"],"图形学和渲染技术":["70.19"],"cpu和gpu的性能优化方法":["70.20"],"提供commit":["70.21"],"过程中完善":["70.21"],"整体对客户端来说":["70.23"],"镜面反射效果":["70.24"],"journey":["70.25"],"服务号必须通过微信认证":["71.1"],"绑定服务号或者订阅号的微信公众号id":["71.2"],"补充该字段":["72.3"],"每个实例都对应有自己的一把锁":["72.4"],"this":["72.4"],"远程调用失败":["72.5"],"string":["72.6"],"encryptpassword":["72.6"],"digestutils":["72.6"],"md5digestashex":["72.6"],"salt":["72.6"],"userpassword":["72.6"],"getbytes":["72.6"],"分配":["72.6"],"accesskey":["72.6"],"secretkey":["72.6"],"electron":["73.0"],"react":["73.0"],"native":["73.0"],"element":["73.0"],"ui组件库源码阅读":["73.0"],"分析":["73.0"],"qiankun源码":["73.0"],"阅读":["73.0"],"后端技术沉淀":["73.0"],"项目":["73.0"],"renegotiate落地语音通话转视频通话的处理":["74.1"],"自己前后端":["74.1"],"部署做了rdic":["74.1"],"这个应用":["74.1"],"支持自建单词本":["74.1"],"支持共享":["74.1"],"修改":["74.1"],"单词发音的应用":["74.1"],"针对小孩子学英语的场景":["74.1"],"团队管理协调":["74.2"],"团队进度滞后":["74.2"],"只是自己默默承担":["74.2"],"不敢分bug":["74.2"],"需求做的糙":["74.3"],"思路是正确":["74.3"],"当然需要再深度加工产出博客":["74.4"],"生活方面":["74.4"],"english":["74.4"],"first":["74.4"],"练刀工":["74.4"],"厨艺精进":["74.4"],"每周2次运动":["74.4"],"难点":["75.5"],"选型":["75.5"],"团队成员好上手":["76.1"],"落地":["76.1"],"seo不收录问题解决":["76.1"],"主动提交":["76.1"],"sitemap":["76.1"],"robots正确配置":["76.1"],"footer":["76.1"],"link标签":["76.1"],"增加内链与外链":["76.1"],"构建组件库":["76.2"],"qiankun":["76.2"],"webcomponent方案":["76.2"],"京东的":["76.2"],"iframe方案":["76.2"],"路由方案":["76.2"],"用微前端分目的是分割功能单元":["76.2"],"精简代码库":["76.2"],"控制发版单元":["76.2"],"长期可迭代":["76.2"],"技术无关性":["76.2"],"你滚动一下就滚动了整个屏幕":["76.3"],"可以观察小红书":["76.3"],"限制了只能滚动":["76.3"],"没有滚动条":["76.3"],"所有图片加载完成之后进入页面":["76.4"],"支持透传slot":["76.5"],"太生硬":["76.6"],"hope":["77.0"],"seo友好":["77.0"],"lsof":["78.0"],"pkill":["78.0"],"上面的pid":["78.0"],"查看系统版本":["78.0"],"lsb":["78.0"],"diffyears":["80.0"],"year":["80.0"],"diffmonths":["80.0"],"month":["80.0"],"diffdays":["80.0"]},{"0":["18.0","47.2","56.4","60.5","80.0"],"1":["17.10","56.4","80.0"],"2":["17.17","39.3","53.1","56.2","64.1"],"3":["56.2","76.1"],"4":["48.3","70.19"],"5":["15.0","48.1","48.3","70.19","72.6"],"8":["17.16"],"75":["33.2"],"100":["43.1"],"159":["33.2"],"170":["33.2"],"3000":["58.3"],"used":["0.0"],"to":["0.0","17.9"],"access":["0.0"],"site":["0.0"],"theme":["0.0"],"and":["0.0"],"full":["0.9"],"list":["0.9"],"run":["1.2"],"llama3":["1.2"],"commandline":["2.0"],"no":["2.0","56.4"],"特征工程和模型优化":["3.4"],"针对合同审查的特定任务":["3.4"],"进行特征工程":["3.4"],"提取合适的文本特征":["3.4"],"如关键词":["3.4"],"实体识别等":["3.4"],"优化模型结构和参数":["3.4"],"以提高模型在合同审查任务上的性能和准确性":["3.4"],"直到左右指针相撞":["4.2"],"交换left":["4.2"],"和":["4.2"],"ico":["5.4"],"供应链":["6.0"],"资金":["6.0"],"sh":["7.0"],"自己需要执行的脚本添加之后保存":["7.0"],"nano":["7.0"],"rollup执行系列任务":["9.1"],"虚拟机":["10.0"],"version":["10.0"],"control":["10.0"],"版本控制":["10.0"],"web":["10.0"],"网络":["10.0"],"wireless":["10.0"],"无线":["10.0"],"blocking":["10.0"],"阻塞":["10.0"],"concurrency":["10.0"],"并发":["10.0"],"context":["10.0"],"switch":["10.0"],"上下文切换":["10.0"],"coroutine":["10.0"],"协程":["10.0"],"deadlock":["10.0"],"死锁":["10.0"],"event":["10.0"],"loop":["10.0"],"事件循环":["10.0"],"fork":["10.0"],"派生":["10.0"],"inter":["10.0"],"process":["10.0"],"communication":["10.0"],"ipc":["10.0"],"进程间通信":["10.0"],"kernel":["10.0"],"内核":["10.0"],"latency":["10.0"],"延迟":["10.0"],"lock":["10.0"],"锁":["10.0"],"mutex":["10.0"],"on":["10.1","44.1"],"整体表结构的sql":["11.0"],"使用花生壳免费版":["12.0"],"模型能力提高10背后":["13.1"],"会颠覆掉":["13.1"],"发展模型的alignment":["13.1"],"opinion":["13.1"],"mining":["13.1"],"可以声明为静态变量":["14.0"],"工具类":["14.0"],"在编写工具类时":["14.0"],"通常会使用静态变量":["14.0"],"命令":["15.0"],"h":["15.0"],"如果忘记设置时区":["15.0"],"打开设置中的script":["15.0"],"github":["16.0","17.13"],"p":["17.7"],"test":["17.7"],"italic":["17.8"],"right":["17.9"],"next":["17.9"],"easy":["17.10"],"ordered":["17.10"],"lorem":["17.10"],"ipsum":["17.10"],"dolor":["17.10"],"sit":["17.10"],"amet":["17.10"],"consectetur":["17.10"],"adipiscing":["17.10"],"fences":["17.11"],"sample":["17.11"],"text":["17.11","55.2"],"here":["17.11"],"columns":["17.12"],"com":["17.13","66.2"],"nodeca":["17.13"],"in":["17.14"],"the":["17.14"],"document":["17.14"],"defining":["17.14"],"very":["17.15"],"effective":["17.15"],"see":["17.16"],"how":["17.16"],"definition":["17.20"],"duplicated":["17.20"],"reference":["17.20"],"third":["17.21"],"paragraph":["17.21"],"entries":["17.22"],"like":["17.22"],"xxxhtmlyyy":["17.22"],"dragons":["17.23"],"sku":["18.0"],"id":["18.0"],"trim":["18.0"],"itemno":["18.0"],"imgratio":["18.0"],"else":["18.0","51.12"],"调用hello":["19.1"],"cc":["19.1"],"代码":["19.1"],"javascript":["19.1","64.1"],"gyp":["19.2"],"微调需要":["20.0"],"上千上万条数据":["20.0"],"能处理更复杂的问题":["20.0"],"付费的前提是信任":["21.0"],"只有你提升自己的能力和经历后":["21.0"],"别人才会对你有一定的信任":["21.0"],"才会觉得你靠谱":["21.0"],"才会给你机会":["21.0"],"而这个信任需要用你的能力和经历来填补":["21.0"],"比如":["21.0"],"prod":["23.0"],"ib":["24.0"],"cloudapigateway":["24.0"],"autoconfigure":["24.0"],"autoconfigures":["24.0"],"framework":["24.0","55.1"],"捕捉视觉上的变化":["25.0"],"浏览器自动化测试":["25.0"],"在浏览器中模拟用户操作":["25.0"],"验证应用的端到端流程":["25.0"],"测试完整的用户体验":["25.0"],"包含前端到后端的交互":["25.0"],"测试":["25.0"],"测试后端服务的":["25.0"],"接口":["25.0"],"postman":["25.0"],"rest":["25.0"],"assured":["25.0"],"大约3年30w":["27.1"],"学习记录":["28.0"],"tools":["28.0"],"无法复现":["29.1"],"resources":["30.0","30.2"],"它极大地简化了资源的关闭操作":["30.0"],"提高了代码的可读性和健壮性":["30.0"],"如果忘记调用":["30.1"],"close":["30.1","30.4"],"方法":["30.1"],"或者异常处理不当":["30.1"],"语句为这些问题提供了优雅的解决方案":["30.2"],"省略了":["30.3"],"finally":["30.3"],"块":["30.3"],"使代码更加简洁":["30.3"],"对于任何需要管理资源的java":["30.5"],"7及以上版本项目":["30.5"],"页面排版混乱":["31.0"],"工作队列":["32.1"],"在一个电商平台的后端系统中":["32.1"],"spring框架":["32.2"],"核心实现":["32.2"],"同时避免过多的线程闲置":["32.3"],"技术实现":["32.3","32.4"],"在spring框架中":["32.3"],"以及数据库连接池等外部资源的限制":["32.4"],"可以通过设置queuecapacity属性来指定工作队列的大小":["32.5"],"难点解决":["32.5"],"避免因队列溢出而导致的订单丢失或系统性能下降":["32.5"],"常规单词本功能":["33.1"],"数据流转清晰":["35.0"],"因为定位元素会创建一个新的包含块":["36.0"],"如果元素的祖先元素中没有定位元素":["36.0"],"i":["38.0"],"t":["38.0"],"input":["39.1"],"图片上传组件":["39.1"],"简略列表":["39.2"],"单个sku表单":["39.2"],"重写校验方法":["39.3"],"development":["40.1"],"export":["40.1"],"没有东西":["40.2"],"开头相关的变量":["40.3"],"parsed":["40.4"],"define":["40.4"],"for":["40.4"],"key":["40.4"],"of":["40.4"],"object":["40.4"],"keys":["40.4"],"例如":["40.5"],"api服务的url":["40.5"],"api":["40.5","54.1","70.21"],"url":["40.5","61.2"],"studio中command":["42.0"],"tool需要使用8":["42.0"],"sleep":["43.1"],"millisecond":["43.1"],"安装dockerfile":["44.0"],"安装dockercompose":["44.0"],"可按照此加密套件配置":["44.1"],"写法遵循":["44.1"],"openssl":["44.1"],"标准":["44.1"],"prefer":["44.1"],"root":["44.1"],"index":["44.1","60.1","69.1"],"location":["44.1"],"alias":["44.1"],"try":["44.1"],"files":["44.1"],"uri":["44.1"],"getitemno":["45.1"],"优化方案可能会带来的问题":["46.2"],"k8s":["46.2"],"meeting":["47.0"],"net":["47.2","55.1","78.0"],"documentation":["47.2"],"一路点安装即可":["47.4"],"启动freeswitch":["47.5"],"支持版本回滚":["48.1"],"降低了部署风险":["48.1"],"云原生和微服务":["48.1"],"为微服务架构提供了理想的编排平台":["48.1"],"支持服务发现":["48.1"],"负载均衡和灵活部署":["48.1"],"cri":["48.2"],"路径下":["48.3"],"配置网络":["48.3"],"会为每个":["48.3"],"分配一个集群内部的":["48.3"],"ip":["48.3"],"地址":["48.3"],"并设置适当的网络规则":["48.3"],"以便":["48.3"],"之间可以相互通信":["48.3"],"启动":["48.3"],"会创建一个":["48.3"],"loadbalancer":["48.3"],"pod是kubernetes中调度和管理的基本单位":["48.5"],"container是pod中的工作负载单元":["48.5"],"流程":["50.0"],"查询性能等方面的比较":["51.1"],"同时":["51.1"],"索引结构":["51.3"],"树的非聚集索引":["51.4"],"存储数据地址":["51.4"],"count":["51.6"],"包括左表或右表的所有行":["51.8"],"num":["51.10"],"from":["51.10","51.18","51.19","60.1"],"desc":["51.11"],"asc":["51.11","51.13"],"小同学":["51.12"],"end":["51.12"],"as":["51.12"],"limit":["51.13"],"min":["51.14"],"student":["51.15","51.16","51.18","51.19"],"group":["51.15","51.16"],"by":["51.15","51.16","51.17"],"where":["51.19"],"在特定情况下":["51.23"],"某些sql模式可能会引入额外的检查和约束":["51.23"],"这可能会影响性能":["51.23"],"关闭或修改这些模式可以提高查询性能":["51.23"],"可能带来的问题":["51.23"],"数据完整性风险":["51.23"],"掌握sql查询技巧对于数据库操作至关重要":["51.25"],"这可能导致代码难以理解":["53.0"],"维护和调试":["53.0"],"可移植性差":["53.0"],"位运算的结果可能依赖于底层的二进制表示和硬件架构":["53.0"],"在不同的平台和环境中":["53.0"],"位运算的结果可能不一致":["53.0"],"导致代码在不同环境下表现不同":["53.0"],"全局自动前端刷新token":["53.1"],"和vo":["53.3"],"因此速度更快":["55.1"],"性能更高":["55.1"],"支持更广泛":["55.1"],"com加载项支持更广泛":["55.1"],"只需要有对应的":["55.1"],"vsto":["55.1"],"runtime运行环境":["55.1"],"有更好的word":["55.1"],"textbutton":["55.2"],"按钮1":["55.2"],"screentip":["55.2"],"onaction":["55.2"],"ontextbutton":["55.2"],"supertip":["55.2"],"inserts":["55.2"],"坑":["55.4"],"安装可配置注册表":["55.5"],"依赖项":["55.5"],"true":["55.7"],"业务服务端":["56.1"],"调用documentbuilder解析word文件":["56.1"],"用户连接或断开连接时":["56.2"],"文档已准备好保存":["56.2"],"用户完成编辑并准备保存文档时":["56.2"],"v到docker内即可":["56.3"],"scrolling":["56.4"],"border":["56.4"],"frameborder":["56.4"],"framespacing":["56.4"],"allowfullscreen":["56.4"],"terser":["58.0"],"uglifyjs":["58.1"],"compress":["58.1"],"drop":["58.1"],"console":["58.1"],"debugger":["58.1"],"产物文件名称":["58.2"],"filename":["58.2"],"ui":["58.2","58.3"],"为了方便学习":["58.2"],"xzui":["58.3"],"http":["58.3"],"localhost":["58.3"],"需要运行时":["58.4"],"如":["58.4"],"requirejs":["58.4"],"管理模块加载":["58.4"],"增加页面加载时间":["58.4"],"语法复杂":["58.4"],"且在现代构建工具中使用较少":["58.4"],"es":["58.4"],"modules":["58.4"],"ecmascript":["58.4"],"主应用影响子应用的类名":["59.1"],"render":["59.2"],"按照顺序拿出来":["59.3"],"尝试捕获到之后重试":["59.5"],"它并没有内置的状态管理功能":["59.6"],"而是鼓励开发者使用其他流行的状态管理库":["59.6"],"互动式学英语":["60.0"],"add":["60.1","80.0"],"fulltext":["60.1"],"content":["60.1"],"ftindex":["60.1"],"translation":["60.1"],"select":["60.1"],"加入分享":["60.2"],"private":["60.4"],"request":["60.5"],"if":["60.5"],"throw":["60.5"],"new":["60.5"],"businessexception":["60.5"],"errorcode":["60.5"],"params":["60.5"],"error":["60.5"],"cw":["60.6"],"left":["60.6"],"join":["60.6"],"社区活跃度较高":["61.1"],"js技术栈":["61.1"],"需要注意的是":["61.2"],"如果需要编译ios应用":["61.2"],"则需要":["61.2"],"安装xcode":["61.2"],"macos虚拟机":["61.2"],"build":["61.2","65.7"],"repositories":["61.2"],"maven":["61.2"],"command":["62.0"],"line":["62.0"],"tools三者":["62.0"],"amazon":["63.2"],"corretto":["63.2"],"worker进程":["64.1"],"避免主进程中继":["64.1"],"其他功能":["65.6"],"官网文档":["65.6"],"相当于":["65.7"],"updatetime":["65.8"],"time":["65.8"],"updateuser":["65.8"],"user":["65.8"],"glb":["66.1"],"隧道":["66.5"],"alive的问题":["69.0"],"js":["69.1","70.0"],"在vue中":["69.1"],"渲染阶段是在事件循环的任务队列执行完毕后进行的":["69.1"],"如果一次事件循环中":["69.1"],"调用了nexttick":["69.1"],"传入了回调":["69.1"],"那么nexttick改变的值会在":["69.1"],"在dom更新队列被刷新之后执行回调函数":["69.1"],"dom更新队列刷新之后":["69.1"],"并不一定会进入渲染阶段":["69.1"],"如果nexttick中":["69.1"],"还有微任务":["69.1"],"那么会等微任务执行完了之后再渲染相关的dom更新队列":["69.1"],"当vue检测到需要进行重新渲染时":["69.1"],"它会将渲染的任务添加到任务队列中":["69.1"],"该任务会在当前任务执行完毕后立即执行":["69.1"],"unref是获取引用值":["69.4"],"但并不会递归获取":["69.4"],"blogs":["70.0"],"coding":["70.0"],"learning":["70.0"],"record":["70.0"],"three":["70.0"],"mesh":["70.4"],"draco":["70.4"],"移除不必要的数据":["70.5"],"在gltf":["70.5"],"glb文件中":["70.5"],"可能包含一些不必要的数据":["70.5"],"如动画":["70.5"],"骨骼":["70.5"],"材质等":["70.5"],"mp":["70.7","73.0"],"weixin":["70.7"],"加速跑动":["70.17"],"及常见显示效果的实现方式":["70.19"],"了解web图形领域":["70.19"],"cpu和gpu端的性能优化方法":["70.19"],"熟悉web技术栈":["70.19"],"几何":["70.20"],"图形学和渲染技术":["70.20"],"webgl":["70.21"],"体积最小":["70.23"],"效果最好":["70.23"],"shader":["70.24"],"vertex":["70.24"],"才可以开通微信支付":["71.2"],"不同实例之间互不影响":["72.4"],"例外":["72.4"],"digestutil":["72.6"],"md5hex":["72.6"],"randomutil":["72.6"],"randomnumbers":["72.6"],"rdic词典":["73.0"],"分类":["73.0"],"分享加入":["73.0"],"微信公众号登录":["73.0"],"过程中":["73.0"],"plus":["73.0"],"redis":["73.0"],"熟悉好":["73.0"],"背背八股文":["73.0"],"换成邮箱登陆":["73.0"],"技术栈spring":["74.1"],"boot":["74.1"],"vue3":["74.1","76.2"],"ts":["74.1"],"微前端调研":["74.1"],"qiankun项目落地":["74.1"],"wsl":["74.1"],"nginx部署":["74.1"],"微前端权限管理设计落地":["74.1"],"不敢问成员进度":["74.2"],"怕招人口舌":["74.2"],"封装组件":["74.2"],"缺少大的整体规划":["74.2"],"效率也ok":["74.3"],"但得深入点细节和产品":["74.3"],"改掉臭毛病":["74.4"],"做的不对的时候":["74.4"],"需要承认不行":["74.4"],"不自夸":["74.4"],"不给别人负面的评价":["74.4"],"关注家人的心理健康":["74.4"],"定期组织集体的运动":["74.4"],"sse":["75.5"],"轮询":["75.5"],"收录meta方式无法收录":["76.1"],"因为meta多了data":["76.1"],"属性":["76.1"],"域名下放认证文件的模式":["76.1"],"落地":["76.2"],"vue2":["76.2"],"history控制权冲突":["76.2"],"同时有两个实例时":["76.2"],"弹窗应用使用虚拟路由":["76.2"],"部署":["76.2"],"运维用k8s不熟":["76.2"],"混淆了redirect与tryfiles":["76.2"],"微博":["76.3"],"从上往下时":["76.3"],"nexttick中节点渲染好了就把container高度固定死":["76.3"],"滑动过快到底部往上走":["76.3"],"高度跳变":["76.3"],"总结":["76.4"],"attrs":["76.5"],"用户接受程度":["76.6"],"chrome插件":["76.6"],"框架无关":["77.0"],"astro":["77.0"],"其他同学":["77.0"],"release":["78.0"],"a024":["78.0"],"win异常端口占用":["78.0"],"吧":["78.0"],"stop":["78.0"],"winnat":["78.0"],"netsh":["78.0"],"调整天数":["80.0"],"如果天数差为负":["80.0"],"则向前借一个月":["80.0"],"prevmonth":["80.0"],"pages":["82.0"]},{"0":["42.0"],"1":["51.13","69.1"],"2":["23.0","30.1","62.0","69.1"],"3":["17.10","51.13","69.1"],"4":["30.3","40.4","56.2","70.5","72.6"],"5":["76.2"],"6":["48.1","48.3","70.19"],"8":["63.2","72.6"],"12":["80.0"],"105":["33.2"],"232":["63.2"],"301":["44.1"],"373":["24.0"],"2023":["70.17"],"8880":["33.2"],"49152":["78.0"],"data":["0.0"],"for":["0.0"],"current":["0.0"],"of":["0.9"],"70b":["1.2"],"gradio":["2.0"],"queue":["2.0"],"api":["2.0","33.2","47.2","70.19"],"模型部署和集成":["3.4"],"将训练好的模型部署到合同审查系统中":["3.4"],"确保其能够处理实时的合同文本数据":["3.4"],"集成模型与其他相关系统或工具":["3.4"],"如合同管理系统":["3.4"],"工作流程管理工具等":["3.4"],"实现合同审查流程的自动化和优化":["3.4"],"左指针的值":["4.2"],"返回哨兵的下标":["4.2"],"360w以太币":["5.4"],"供应商货物":["6.0"],"品质稳定":["6.0"],"快捷键":["7.0"],"ctrl":["7.0"],"x":["7.0","47.2"],"mutual":["10.0"],"exclusion":["10.0"],"互斥量":["10.0"],"non":["10.0"],"非阻塞":["10.0"],"parallelism":["10.0"],"并行":["10.0"],"preemptive":["10.0"],"multitasking":["10.0"],"抢占式多任务":["10.0"],"进程":["10.0"],"race":["10.0"],"condition":["10.0"],"竞态条件":["10.0"],"reentrant":["10.0"],"可重入的":["10.0"],"semaphore":["10.0"],"信号量":["10.0"],"scheduling":["10.0"],"调度":["10.0"],"shared":["10.0"],"memory":["10.0"],"共享内存":["10.0"],"synchronization":["10.0"],"同步":["10.0"],"system":["10.0","15.0"],"call":["10.0"],"系统调用":["10.0"],"thread":["10.0"],"线程":["10.0"],"pool":["10.0"],"线程池":["10.0"],"wechat":["10.1"],"使用":["11.0","58.4"],"dialogue":["13.1"],"这些能力":["13.1"],"才是未来":["13.1"],"ai出现后":["13.1"],"比如":["14.0"],"一个数学计算工具类中可能包含一些常用的数学常数":["14.0"],"这些常数可以声明为静态变量":["14.0"],"计数器":["14.0"],"console":["15.0"],"setproperty":["15.0"],"org":["15.0"],"apache":["15.0"],"each":["17.9"],"other":["17.9"],"or":["17.9"],"elit":["17.10"],"integer":["17.10","60.4"],"molestie":["17.10"],"massa":["17.10"],"you":["17.10"],"can":["17.10"],"syntax":["17.11"],"highlighting":["17.11"],"js":["17.11","73.0"],"var":["17.11","19.1"],"foo":["17.11","58.1"],"pica":["17.13"],"enable":["17.13"],"url":["17.14"],"location":["17.14","55.2"],"https":["17.14","44.1"],"support":["17.15"],"to":["17.16"],"change":["17.16"],"o":["17.17","48.2"],"footnotecan":["17.20"],"have":["17.20"],"compact":["17.21"],"style":["17.21","56.4"],"and":["17.22"],"so":["17.22"],"on":["17.22","60.6"],"addon":["19.1"],"require":["19.1"],"bindings":["19.1"],"法律文书撰写":["20.0"],"公文撰写":["20.0"],"你是一个很知名的开源软件的核心开发人员":["21.0"],"或是你是某知名公司核心项目的核心开发人员":["21.0"],"等等":["21.0"],"关注技术趋势":["21.0"],"找到能体现价值的地方":["21.0"],"成为一个好的leader":["21.0"],"帮人解决问题":["21.0"],"build":["23.0"],"application":["23.0"],"client":["24.0"],"user":["24.0"],"的正确性":["25.0"],"性能和安全性":["25.0"],"涉及各种":["25.0"],"http":["25.0"],"请求":["25.0"],"合同测试":["25.0"],"contract":["25.0"],"验证前端与后端之间的数据契约":["25.0"],"pact":["25.0"],"确保前端和后端的接口协议一致":["25.0"],"避免集成问题":["25.0"],"性能测试":["25.0"],"performance":["25.0"],"测试应用的性能":["25.0"],"如加载时间和响应时间":["25.0"],"jmeter":["25.0"],"评估应用在高负载下的表现":["25.0"],"1个license":["27.1"],"好用的工具":["28.0"],"引申出来":["29.1"],"本文将探讨":["30.0"],"资源可能不会被释放":["30.1"],"代码冗余":["30.1"],"它要求资源实现":["30.2"],"autocloseable":["30.2"],"清晰":["30.3"],"异常处理":["30.3"],"原始异常被捕获":["30.3"],"使用try":["30.4"],"强烈推荐使用这种语句":["30.5"],"随着java语言的不断发展":["30.5"],"线索第二次进入":["31.0"],"假设我们需要设计一个用于处理订单的自定义线程池":["32.1"],"自定义线程池用于管理订单处理的并发执行":["32.2"],"重点难点":["32.2"],"可以使用threadpooltaskexecutor来创建自定义线程池":["32.3"],"并通过设置corepoolsize属性来指定核心线程数":["32.3"],"在threadpooltaskexecutor中":["32.4"],"可以通过设置maxpoolsize属性来指定最大线程数":["32.4"],"需要根据系统负载和任务处理时间来动态调整工作队列的大小":["32.5"],"并采取适当的任务拒绝策略":["32.5"],"查词":["33.1"],"代码逻辑":["35.0"],"offsettop就是相对于":["36.0"],"html":["36.0"],"p":["38.0"],"总的组件数有上万个":["39.1"],"同上2":["39.2"],"引入validate":["39.3"],"读取elform下面的elformitem数据":["39.3"],"cli会注入vue":["40.3"],"json":["40.4"],"stringify":["40.4"],"return":["40.4","44.1","45.1"],"使用环境变量":["40.4"],"在项目代码中":["40.4"],"你可以通过":["40.4"],"来访问注入的环境变量":["40.4"],"例如":["40.4","44.1"],"组件中使用环境变量":["40.4"],"export":["40.4","58.4"],"default":["40.4"],"name":["40.4"],"apk安装包":["42.0"],"println":["43.1"],"获取ssl证书":["44.0"],"填写您的证书绑定的域名":["44.1"],"cloud":["44.1"],"tencent":["44.1"],"host":["44.1"],"request":["44.1"],"将http的域名请求转成https":["44.1"],"shell":["44.1"],"sh":["44.1"],"down":["44.1"],"getnameen":["45.0"],"getname":["45.1"],"id":["45.1"],"pod":["46.2"],"启动的时候":["46.2"],"webrtc":["47.0"],"session":["47.2"],"用管理员方式运行":["47.4"],"管理员方式启动":["47.5"],"可以无缝地与其他云原生工具":["48.1"],"如prometheus":["48.1"],"istio等":["48.1"],"集成":["48.1"],"构建完整的云原生应用程序堆栈":["48.1"],"类型的":["48.3"],"并将其与":["48.3"],"关联":["48.3"],"该":["48.3"],"会获取一个集群外部可访问的":["48.3"],"并将流量转发到后端":["48.3"],"自动扩缩容":["48.3"],"如果应用程序负载发生变化":["48.3"],"可以根据":["48.3"],"中定义的副本数量":["48.3"],"它包含了应用程序代码和所需的依赖库":["48.5"],"每个container都是隔离的":["48.5"],"拥有自己的文件系统":["48.5"],"文章还介绍了sql查询的多种技巧":["51.1"],"使用b":["51.3"],"树的聚集索引":["51.3"],"查询性能":["51.4"],"用于数据聚合计算":["51.6"],"加上满足条件的交集部分":["51.8"],"cross":["51.8"],"student":["51.10","51.12"],"此语句用于从":["51.10"],"此语句用于选取":["51.11","51.13","51.18","51.19"],"level":["51.12"],"from":["51.12","51.14"],"having":["51.17"],"热dog":["51.19"],"关闭严格模式可能会绕过一些数据完整性检查":["51.23"],"从而增加数据错误和不一致的风险":["51.23"],"违反acid属性":["51.23"],"事务的原子性":["51.23"],"一致性":["51.23"],"隔离性和持久性":["51.23"],"acid属性":["51.23"],"难以调试":["53.0"],"由于位运算操作是直接在二进制位上进行的":["53.0"],"调试过程中很难直观地观察和理解中间结果":["53.0"],"这可能增加调试的复杂性和困难度":["53.0"],"综上所述":["53.0"],"位运算在":["53.0"],"javascript":["53.0","58.4"],"react":["53.1"],"value":["53.3"],"声明式router":["54.1"],"wps客户端兼容性":["55.1"],"可定制性更强":["55.1"],"com加载项可以使用本地编程语言进行开发":["55.1"],"支持更多的编程语言特性和库函数":["55.1"],"发布受厂商限制少3":["55.1"],"采用的技术选型":["55.1"],"com加载项":["55.1"],"结合webview":["55.1"],"优势":["55.1"],"at":["55.2"],"the":["55.2"],"cursor":["55.2"],"tablebutton":["55.2"],"按钮2":["55.2"],"代码证书":["55.4"],"一套代码":["55.5"],"打包后一次性安装":["55.5"],"wps":["55.7"],"用户端服务":["56.1"],"发生文档保存错误":["56.2"],"在尝试保存文档时出现错误":["56.2"],"文档已关闭":["56.2"],"background":["56.4"],"color":["56.4"],"b2b2a8":["56.4"],"plugin":["58.0"],"pure":["58.1"],"funcs":["58.1"],"log":["58.1"],"table":["58.1"],"sourcemap":["58.1"],"false":["58.1","58.2"],"entry":["58.1"],"查看构建产物":["58.2"],"将此置为":["58.2"],"不要混淆产物代码":["58.2"],"minify":["58.2"],"dist":["58.3"],"umd":["58.3"],"element":["58.3"],"plus":["58.3"],"elementplus":["58.3"],"标准的一部分":["58.4"],"提供原生模块系统":["58.4"],"import":["58.4"],"和":["58.4"],"语句":["58.4"],"尽管是现代":["58.4"],"的标准模块系统":["58.4"],"用scoped解决":["59.1"],"沙箱":["59.2"],"子应用在":["59.2"],"然后用fetch":["59.3"],"如":["59.6"],"redux":["59.6"],"场景例句巩固":["60.0"],"where":["60.1","65.8"],"match":["60.1"],"against":["60.1"],"润":["60.1"],"in":["60.1"],"boolean":["60.1"],"mode":["60.1"],"私有单词库":["60.2"],"默认所有人可以编辑":["60.2"],"dicspage":["60.5"],"调用mybatis":["60.5"],"plus包装的mapper接口":["60.5"],"dics":["60.6"],"wordid":["60.6"],"总的来说":["61.1"],"不分伯仲":["61.1"],"aliyun":["61.2"],"com":["61.2","70.7","76.1"],"repository":["61.2"],"public":["61.2"],"android":["62.0"],"不报错了":["62.0"],"09":["63.2"],"const":["64.1"],"new":["64.1","65.7"],"browserwindow":["64.1"],"后端的代码":["65.6"],"status":["65.8"],"添加配置之后":["65.8"],"gltf":["66.1"],"feed":["66.2"],"隧道粒子贴图ps制作":["66.5"],"解决方案":["69.0"],"路由拍平":["69.0"],"一旦进入渲染阶段":["69.1"],"vue会执行以下操作":["69.1"],"比对虚拟dom":["69.1"],"virtual":["69.1"],"dom":["69.1"],"vue会比对当前的虚拟dom和上一次渲染时的虚拟dom":["69.1"],"找出两者之间的差异":["69.1"],"执行dom更新":["69.1"],"根据比对的结果":["69.1"],"vue会将需要更新的dom元素添加到更新队列中":["69.1"],"执行异步更新":["69.1"],"vue会将dom更新操作放入微任务队列中":["69.1"],"以便在当前任务执行完毕后立即执行":["69.1"],"toraw是获取响应式对象的原始对象":["69.4"],"md":["70.0"],"description":["70.0"],"这是默认设置":["70.0"],"请设置":["70.0"],"custommade":["70.0"],"打开korofileheader查看配置":["70.0"],"进行设置":["70.0"],"draco算法优化":["70.4"],"如果你的应用程序不需要这些数据":["70.5"],"可以考虑在导出模型时将其移除":["70.5"],"以减小文件大小":["70.5"],"优化模型结构":["70.5"],"检查模型的结构":["70.5"],"确保没有重复的顶点或面片":["70.5"],"qq":["70.7"],"06":["70.17"],"及webgl":["70.19"],"有较强的学习能力":["70.19"],"问题分析与解决能力":["70.19"],"热爱技术和软件开发":["70.19"],"加分项":["70.19"],"及常见显示效果的实现方式":["70.20"],"了解rust":["70.20"],"rust":["70.21"],"webassembly":["70.21"],"图形学":["70.21"],"如果没有复杂交互":["70.23"],"只是循环的3d动画":["70.23"],"顶点":["70.24"],"fragment":["70.24"],"锁对象是":["72.4"],"class以及synchronized修饰的是static方法的时候":["72.4"],"所有对象公用同一把锁":["72.4"],"插入数据":["72.6"],"setuseraccount":["72.6"],"setuserpassword":["72.6"],"前端项目沉淀":["73.0"],"next":["73.0"],"项目脚手架":["73.0"],"headless":["73.0"],"ui组件库":["73.0"],"选择开源项目细分领域":["73.0"],"给领域知名项目提pr":["73.0"],"可以从bug修复开始":["73.0"],"参与知名项目的技术事务":["73.0"],"读完了":["74.1"],"vue":["74.1"],"js设计与实现":["74.1"],"react技术揭秘":["74.1"],"深入浅出electron原理":["74.1"],"工程与实践":["74.1"],"等书籍":["74.1"],"antd":["74.1"],"如设计机构saas中的组件库规划":["74.2"],"过于专注于技术测":["74.2"],"但缺少对产品本身":["74.2"],"交互的钻研":["74.2"],"测试对好":["74.3"],"从同事":["74.3"],"露营":["74.4"],"短途旅行":["74.4"],"给家人做饭":["74.4"],"新家装修":["74.4"],"风格":["74.4"],"整体方案确认":["74.4"],"初步定设计图":["74.4"],"ws":["75.5"],"用户反馈登录态过期":["76.1"],"实际上www":["76.1"],"abc":["76.1"],"com访问和abc":["76.1"],"com存的cookie":["76.1"],"domain分别是":["76.1"],"和abc":["76.1"],"element冲突主应用":["76.2"],"elemtnplus":["76.2"],"基座影响子应用":["76.2"],"解决方式是对子应用postcss":["76.2"],"依赖包处理增加prevfix处理":["76.2"],"也可以主应用本身cs也用打包工具处理":["76.2"],"加scoped或者前缀":["76.2"],"发版时已经加载的页面":["76.2"],"白屏问题":["76.3"],"小红书的瀑布流虚拟列表":["76.3"],"直接把滚动条隐藏了":["76.3"],"只能滑轮滚":["76.3"],"rem有局限性吗":["76.4"],"props等":["76.5"],"分发问题":["76.6"],"多主题":["77.0"],"配置ui":["77.0"],"int":["78.0"],"ipv4":["78.0"],"set":["78.0"],"dynamic":["78.0"],"tcp":["78.0"],"start":["78.0"],"num":["78.0"],"daysinmonth":["80.0"],"调整月份":["80.0"],"如果月份差为负":["80.0"],"则向前借一年":["80.0"],"构造返回结果":["80.0"],"result":["80.0"]},{"0":["58.3"],"1":["70.4"],"2":["55.4"],"3":["30.1"],"4":["69.1","73.0"],"5":["30.3","40.4","69.1","70.5"],"6":["56.2"],"7":["48.3"],"8":["48.3"],"12":["24.0"],"13":["24.0"],"15":["70.17"],"30":["24.0"],"41":["24.0"],"46":["70.4"],"150":["51.17"],"241":["24.0"],"349":["24.0"],"2024":["24.0"],"3306":["38.0"],"16384":["78.0"],"it":["0.0"],"works":["0.0"],"in":["0.0"],"both":["0.0"],"md":["0.0"],"runtime":["0.9"],"apis":["0.9"],"rest":["1.2"],"api就启动好在本地了":["1.2"],"http":["1.2"],"xformers":["2.0"],"打开文档":["2.0"],"防止梯子问题":["2.0"],"测试和评估":["3.4"],"对部署的模型进行测试":["3.4"],"评估其在真实场景下的性能和效果":["3.4"],"根据评估结果对模型进行调整和优化":["3.4"],"以提高其在合同审查任务中的表现":["3.4"],"持续改进和更新":["3.4"],"定期监控模型的性能和准确性":["3.4"],"中间值":["4.2"],"不停划分":["4.2"],"直到数组长度为1":["4.2"],"结论传统产业":["6.0"],"也ok":["6.0"],"y":["7.0","44.1"],"保存":["7.0"],"safety":["10.0"],"线程安全":["10.0"],"time":["10.0","24.0"],"slice":["10.0"],"时间片":["10.0"],"mode":["10.0"],"用户模式":["10.0"],"虚拟内存":["10.0"],"cpu":["10.0","48.5"],"bound":["10.0"],"限制":["10.0"],"i":["10.0"],"o":["10.0"],"multithreading":["10.0"],"多线程":["10.0"],"多任务":["10.0"],"paging":["10.0"],"页调度":["10.0"],"priority":["10.0"],"inversion":["10.0"],"优先级倒置":["10.0"],"优先级调度":["10.0"],"选择性update":["11.0"],"做模型是没有意义的":["13.1"],"就像iphone出来后":["13.1"],"大量的山寨手机":["13.1"],"很快就会被市场淘汰":["13.1"],"静态变量可以用于跟踪类的实例创建了多少次":["14.0"],"或者用于记录某个事件发生的次数":["14.0"],"总的来说":["14.0","48.1"],"静态变量适合用于表示类级别的属性":["14.0"],"commons":["15.0"],"jelly":["15.0"],"tags":["15.0"],"fmt":["15.0"],"timezone":["15.0"],"link":["16.0"],"smartypants":["17.7"],"double":["17.7"],"quotes":["17.7"],"and":["17.7"],"with":["17.9","17.16","24.0"],"spaces":["17.9"],"between":["17.9"],"use":["17.10","24.0","63.2"],"sequential":["17.10"],"numbers":["17.10"],"keep":["17.10","74.4"],"all":["17.10"],"the":["17.10"],"as":["17.10"],"function":["17.11"],"bar":["17.11"],"return":["17.11"],"console":["17.11","19.1"],"linkify":["17.13"],"to":["17.13"],"octodex":["17.14"],"github":["17.14","70.0"],"com":["17.14"],"dojocat":["17.14"],"syntax":["17.15"],"output":["17.16","58.1"],"markupand":["17.20"],"multiple":["17.20"],"paragraphs":["17.20"],"hyper":["17.22"],"text":["17.22"],"材质":["18.0"],"hello":["19.1"],"log":["19.1"],"等领域模型":["20.0"],"上下文提示":["20.0"],"被人依赖":["21.0"],"能做关键决定":["21.0"],"开放心态":["21.0"],"倾向性价值观":["21.0"],"热情":["21.0"],"冲劲":["21.0"],"抓住重点":["21.0"],"yml中添加占位":["23.0"],"yml":["23.0"],"spring":["23.0","24.0"],"name":["23.0"],"wxmp":["23.0"],"默认":["23.0"],"artifact":["24.0"],"hibernate":["24.0"],"validator":["24.0"],"final":["24.0"],"has":["24.0"],"been":["24.0"],"relocated":["24.0"],"default":["24.0"],"deleting":["24.0"],"target":["24.0"],"utf":["24.0"],"encoding":["24.0"],"copy":["24.0"],"filtered":["24.0"],"copying":["24.0"],"compiler":["24.0"],"compile":["24.0"],"detected":["24.0"],"recompiling":["24.0"],"module":["24.0"],"compiling":["24.0"],"source":["24.0"],"files":["24.0"],"classes":["24.0"],"src":["24.0"],"main":["24.0"],"executor":["24.0"],"namedthreadfactory":["24.0"],"uses":["24.0"],"or":["24.0"],"overrides":["24.0"],"deprecated":["24.0"],"that":["24.0"],"marked":["24.0"],"removal":["24.0"],"recompile":["24.0"],"xlint":["24.0"],"details":["24.0"],"controller":["24.0"],"institutionreportskucontroller":["24.0"],"input":["24.0"],"unchecked":["24.0"],"unsafe":["24.0"],"operations":["24.0"],"testresources":["24.0"],"not":["24.0"],"testcompile":["24.0"],"sources":["24.0"],"surefire":["24.0"],"tests":["24.0"],"are":["24.0"],"skipped":["24.0"],"repackage":["24.0"],"replacing":["24.0"],"repackaged":["24.0"],"archive":["24.0"],"installing":["24.0"],"pom":["24.0"],"success":["24.0"],"total":["24.0"],"finished":["24.0"],"02":["24.0"],"07t08":["24.0"],"08":["24.0"],"00":["24.0"],"cp":["24.0"],"rf":["24.0"],"优化性能瓶颈":["25.0"],"安全测试":["25.0"],"security":["25.0"],"检查应用的安全性问题":["25.0"],"owasp":["25.0"],"zap":["25.0"],"burp":["25.0"],"suite":["25.0"],"识别常见的安全漏洞":["25.0"],"如":["25.0"],"xss":["25.0"],"csrf":["25.0"],"sql":["25.0"],"注入等":["25.0"],"回归测试":["25.0"],"确保新代码不会破坏已有功能":["25.0"],"基于自动化测试工具":["25.0"],"anything":["28.0"],"分享一些代码":["28.0"],"vue的最佳实践":["29.1"],"语句的优势":["30.0"],"块增加了代码的复杂性":["30.1"],"导致冗余和难以维护":["30.1"],"异常隐藏":["30.1"],"接口":["30.2"],"确保在使用完毕后自动关闭":["30.2"],"而关闭资源时的异常被忽略":["30.3"],"除非它们是原始异常的补充":["30.3"],"可读性提高":["30.3"],"我们应该积极采用新特性来编写更健壮":["30.5"],"更优雅的代码":["30.5"],"没有请求html":["31.0"],"最大线程数和工作队列的设计时需要注意":["32.1"],"保证订单处理的高并发和可靠性":["32.2"],"避免资源竞争和订单丢失":["32.2"],"难点解决":["32.3","32.4"],"通过监控订单请求量和系统资源利用率":["32.3"],"避免因线程过多而导致资源竞争或内存溢出的问题":["32.4"],"通过以上的结构化设计考量":["32.5"],"可以设计出一个高效":["32.5"],"稳定的订单处理线程池":["32.5"],"发音":["33.1"],"translate":["33.2"],"getresult":["33.2"],"query":["33.2"],"越少分支越好":["35.0"],"元素的":["36.0"],"所以offsettop是相对于最近的定位祖先元素":["36.0"],"页面性能问题严重":["39.1"],"200多个物料的场景就卡的动不了":["39.1"],"总结":["39.2","58.4","75.5","76.1","76.2"],"多了个":["39.2"],"不定高度虚拟列表处理":["39.2"],"拿到需要校验的validator":["39.3"],"循环列表传入数据":["39.3"],"开头的变量":["40.3"],"mycomponent":["40.4"],"computed":["40.4"],"apiurl":["40.4"],"app":["40.4"],"api":["40.4"],"url":["40.4"],"构建项目":["40.4"],"运行构建命令":["40.4"],"将使用":["40.4"],"和":["40.4"],"插件将":["40.4"],"其他全局常量定义":["40.5"],"my":["40.5"],"global":["40.5"],"constant":["40.5"],"点击下载":["42.0"],"git仓库":["42.0"],"启动两个协程":["43.1"],"world":["43.1"],"异步调用":["43.1"],"sl证书解析配置":["44.0"],"stop":["44.1"],"f":["44.1"],"rm":["44.1"],"rmi":["44.1"],"up":["44.1"],"updatedist":["44.1"],"mv":["44.1"],"backup":["44.1"],"date":["44.1"],"m":["44.1"],"update":["45.0"],"entity的方法":["45.0"],"dto的值":["45.0"],"getid":["45.1"],"tostring":["45.1"],"collect":["45.1"],"collectors":["45.1"],"tolist":["45.1"],"container跟dockerfile的联系":["46.2"],"对dockerfile的改动对k8s":["46.2"],"是一个webrtc的封装库":["47.0"],"javascript":["47.2"],"替换轨道":["47.2"],"7443的端口":["47.5"],"供应商无关性":["48.1"],"kubernetes可以运行在各种环境中":["48.1"],"包括本地数据中心":["48.1"],"公有云和私有云":["48.1"],"提供了环境抽象和可移植性":["48.1"],"kubernetes通过自动化":["48.1"],"等":["48.2","59.6"],"自动水平扩展或缩容":["48.3"],"实例数量":["48.3"],"自动恢复":["48.3"],"如果某个":["48.3"],"出现故障":["48.3"],"会自动重新创建一个新的":["48.3"],"以保持应用程序的运行状态":["48.3"],"滚动更新":["48.3"],"当需要更新应用程序时":["48.3"],"支持滚动更新策略":["48.3"],"可以一次更新一部分":["48.3"],"内存和进程空间":["48.5"],"一个pod可以包含一个或多个container":["48.5"],"包括聚合函数":["51.1"],"开窗函数以及不同类型的join操作":["51.1"],"数据按主键聚集存储":["51.3"],"读取性能较好":["51.4"],"写入和并发性能较弱":["51.4"],"返回两个表的笛卡尔积":["51.8"],"表中提取所有不重复的班级id和考试编号的组合":["51.10"],"表中的姓名":["51.11"],"年龄和分数":["51.11"],"并首先按分数降序排序":["51.11"],"order":["51.12"],"by":["51.12"],"asc":["51.12"],"表中按年龄升序排列的学生姓名和年龄":["51.13"],"student":["51.14"],"此语句用于计算":["51.14","51.15","51.16"],"表中学生成绩的总和":["51.14"],"表中每个班级的平均成绩":["51.15"],"此语句用于找出":["51.17"],"表中的学生姓名和当前日期":["51.18"],"表中姓名为":["51.19"],"是数据库事务处理的基础":["51.23"],"关闭严格模式可能会影响这些属性":["51.23"],"尤其是在事务处理中":["51.23"],"如果应用程序依赖于mysql的严格行为":["51.23"],"关闭严格模式可能会导致不可预见的行为和错误":["51.23"],"领域具有一些优势":["53.0"],"如高效性能和节省空间":["53.0"],"然而":["53.0"],"它也存在一些缺点":["53.0"],"如可读性较差和可移植性差":["53.0"],"在使用位运算时":["53.0"],"需权衡其优势和缺点":["53.0"],"suspense":["53.1"],"都是用于在系统之间传输数据的对象":["53.3"],"便于内网部署":["55.1"],"web项目集成":["55.1"],"能同时兼容wps":["55.1"],"office":["55.1"],"web资源支持增量更新":["55.1"],"支持clickone部署":["55.1"],"一次安装":["55.1"],"后续远程自动更新":["55.1"],"难点":["55.1"],"webview":["55.1"],"table":["55.2"],"ontablebutton":["55.2"],"a":["55.2"],"自建证书不支持自动更新":["55.4"],"word":["55.5"],"wps":["55.5"],"传参给业务服务端渲染word":["56.1"],"没有任何更改":["56.2"],"用户关闭文档且未做任何更改":["56.2"],"编辑中保存":["56.2"],"用户在编辑过程中保存了文档的当前状态":["56.2"],"编辑模式":["56.4"],"uglify":["58.0"],"sdk文件入口":["58.1"],"如果你依赖了一些全局变量":["58.1"],"如vue":["58.1"],"globals":["58.1"],"vue":["58.1","58.2"],"librarytarget":["58.1"],"true":["58.2"],"rollupoptions":["58.2"],"external":["58.2"],"需要引入的全局变量":["58.2"],"full":["58.3"],"但在旧浏览器中不被支持":["58.4"],"需要通过如":["58.4"],"babel":["58.4"],"的工具转译":["58.4"],"中较新版本才支持":["58.4"],"每种模块格式适用于不同场景":["58.4"],"具有各自的局限性":["58.4"],"随着前端工具和浏览器的发展":["58.4"],"mount":["59.2"],"开始前生成好的的沙箱":["59.2"],"每次子应用切换过后":["59.2"],"请求回来":["59.3"],"按照顺序内联在子应用里面运行":["59.3"],"vuex":["59.6"],"单词本":["60.1"],"增加":["60.1"],"done":["60.1"],"单词本分享":["60.1"],"单词本分类":["60.1"],"单词本改名":["60.1"],"单词":["60.1"],"分享编辑单词库":["60.2"],"isdelete":["60.4"],"list":["60.5"],"dicslist":["60.5"],"customwordsmapper":["60.5"],"getdictionariesbyworkbookid":["60.5"],"workbookid":["60.5"],"customwordspage":["60.5"],"where":["60.6"],"国际服上对flutter的技术认可度高些":["61.1"],"reactnative":["61.1"],"google":["61.2","74.1"],"project":["62.0"],"structure":["62.0"],"设置sdk为33":["62.0"],"show":["64.1"],"false":["64.1"],"webpreferences":["64.1"],"nodeintegration":["64.1"],"写起来好丝滑":["65.6"],"setstatus":["65.7"],"支持别名":["65.8"],"不用引用完整路径":["65.8"],"mapper配置文件":["65.8"],"mapper":["65.8"],"locations":["65.8"],"classpath":["65.8"],"扫描包名":["65.8"],"type":["65.8"],"aliases":["65.8"],"模型材质分开的":["66.1"],"每一层路由都需要加keepalive":["69.0"],"执行实际的dom操作":["69.1"],"在微任务队列执行时":["69.1"],"vue会遍历更新队列":["69.1"],"并根据具体的dom操作":["69.1"],"添加":["69.1"],"删除":["69.1"],"修改等":["69.1"],"对真实的dom进行操作":["69.1"],"渲染完成":["69.1"],"一旦完成dom的更新":["69.1"],"vue会触发":["69.1"],"mounted":["69.1"],"或":["69.1"],"updated":["69.1"],"会递归解开proxy对象":["69.4"],"https":["70.0"],"obkoro1":["70.0"],"koro1fileheader":["70.0"],"wiki":["70.0"],"e9":["70.0"],"正常加载":["70.4"],"感兴趣的朋友可以了解一下":["70.4"],"压缩的技术":["70.4"],"优化模型结构可以减小文件大小":["70.5"],"并提高渲染性能":["70.5"],"使用压缩工具":["70.5"],"你可以使用gltf":["70.5"],"glb的压缩工具来进一步减小文件大小":["70.5"],"这些工具可以对模型进行压缩和优化":["70.5"],"s":["70.7"],"g4whbdmgnj5ol2t1d":["70.7"],"有业余开源项目供技术参考":["70.19"],"深入了解过至少一款渲染引擎的内部实现架构和技术细节":["70.19"],"了解rust":["70.19"],"webassembly":["70.20"],"webgpu等技术":["70.20"],"渲染技术":["70.21"],"几何":["70.21"],"只根据白天晚上切换video":["70.23"],"那么不太需要3d渲染这么重的东西":["70.23"],"碎片":["70.24"],"顶点中间的填充内容":["70.24"],"glsl语法":["70.24"],"synchronized修饰的方法":["72.4"],"setaccesskey":["72.6"],"setsecretkey":["72.6"],"boolean":["72.6"],"saveresult":["72.6"],"this":["72.6"],"save":["72.6"],"比如":["73.0"],"rfc":["73.0"],"讨论":["73.0"],"bug":["73.0"],"修":["73.0"],"成为知名项目活跃contributor":["73.0"],"成为知名项目核心成员":["73.0"],"为什么程序员要出书":["73.0"],"在行业会议演讲":["73.0"],"写系列文章":["73.0"],"g6库":["74.1"],"用":["74.1"],"svg图":["74.1"],"画类3d的图":["74.1"],"方法论":["74.1"],"重视github":["74.1"],"issue":["74.1"],"官网文档":["74.1"],"需求侧未确定导致的变动返工多":["74.2"],"技能和知识增长":["74.2"],"其实还有一些翻了一部分的书":["74.2"],"看了一部分的视频课程":["74.2"],"上级或客户那里收到了很多肯定和改进的建议":["74.3"],"对团队或公司提出了一些改进的建议":["74.3"],"todo":["74.4","76.4"],"新的一年":["74.4"],"大家都走好运":["74.4"],"looking":["74.4"],"until":["74.4"],"you":["74.4"],"find":["74.4"],"落地":["75.5"],"不一致导致的":["76.1"],"如果是不同的子域名":["76.1"],"使用oauth2":["76.1"],"做登录态共享":["76.1"],"加载了过期的已加载js":["76.2"],"请求了chunk中过期的异步加载css":["76.2"],"页面级别":["76.2"],"导致的样式错乱问题":["76.2"],"loader捕捉css加载的err":["76.2"],"ps":["76.2"],"运维手段是立即删除所有旧的资源":["76.2"],"cdn共享组件库优化":["76.2"],"多tab场景下vnode缓存todo":["76.2"],"思考":["76.2"],"并且后端接口数据中直接返回图片的宽高":["76.3"],"pc端的微博":["76.3"],"刷的过快它一定会先白屏之后再出现内容":["76.3"],"其次就是像腾讯会议里回放的文本记录":["76.3"],"每段文本记录都是item":["76.3"],"原生组件有坑":["76.5"],"谷歌市场上架":["76.6"],"onlyoffice":["76.6"],"富文本编辑器":["77.0"],"hexo":["77.0"],"ipv6":["78.0"],"年前":["80.0"],"年":["80.0"],"个月前":["80.0"],"else":["80.0"]},{"4":["58.1"],"5":["17.11"],"6":["40.4","70.5"],"7":["24.0","56.2","70.5"],"9":["24.0"],"57":["17.10"],"85":["70.0"],"147":["24.0"],"4716":["24.0"],"11434":["1.2"],"vue":["0.0"],"files":["0.0"],"localhost":["1.2"],"桌面端配套":["1.2"],"能开放sdui的api文档接口":["2.0"],"可以进一步二开":["2.0"],"收集用户反馈":["3.4"],"并根据需要进行模型更新和改进":["3.4"],"不断改进合同审查系统的功能和性能":["3.4"],"以应对新的法律要求和业务需求":["3.4"],"以上步骤涵盖了实现ai合同审查的基本计划":["3.4"],"但具体的实施可能会根据实际情况和需求进行调整和补充":["3.4"],"那么整个数组都已排序完成":["4.2"],"l":["7.0"],"查看添加的定时任务":["7.0"],"block":["10.0"],"pcb":["10.0"],"进程控制块":["10.0"],"producer":["10.0"],"consumer":["10.0"],"problem":["10.0"],"生产者":["10.0"],"消费者问题":["10.0"],"spinlock":["10.0"],"自旋锁":["10.0"],"starvation":["10.0"],"饥饿":["10.0"],"无法获得资源":["10.0"],"supervisor":["10.0"],"监督模式":["10.0"],"swapping":["10.0"],"交换":["10.0"],"trap":["10.0"],"陷阱":["10.0"],"wait":["10.0"],"等待":["10.0"],"yield":["10.0"],"让出":["10.0"],"处理器":["10.0"],"idle":["10.0"],"空闲":["10.0"],"数据":["13.1"],"提到自己的公司":["13.1"],"stastic":["13.1"],"这些属性对于所有实例都是相同的":["14.0"],"或者在整个程序执行期间保持不变":["14.0"],"执行":["15.0"],"留言":["16.0"],"single":["17.7"],"strikethrough":["17.8"],"arrows":["17.9"],"numbering":["17.10"],"offset":["17.10"],"foo":["17.10"],"bar":["17.10"],"log":["17.11"],"see":["17.13","24.0"],"jpg":["17.14"],"twemoji":["17.16"],"2a":["17.21"],"2b":["17.21","24.0"],"markup":["17.22"],"language":["17.22"],"setpartpagefileid":["18.0"],"需要生成文件时才删除配置下对应历史记录":["18.0"],"xizhaowordrecordservice":["18.0"],"lambdaupdate":["18.0"],"eq":["18.0"],"xizhaowordrecord":["18.0"],"getexportid":["18.0"],"getisdelete":["18.0"],"set":["18.0"],"update":["18.0"],"正常导出时需要生成文件":["18.0"],"保存版本时只需要获取导出的信息快照":["18.0"],"bookexecutor":["18.0"],"bookmainthreadexecutor":["18.0"],"execute":["18.0"],"ttlrunnable":["18.0"],"world":["19.1"],"灵活":["20.0"],"看透本质":["21.0"],"能画饼":["21.0"],"甘愿成就他人":["21.0"],"时间管理":["21.0"],"想清楚再做":["21.0"],"最短时间管理":["21.0"],"关注长期利益":["21.0"],"环境":["23.0","58.4"],"active":["23.0"],"支持":["23.0"],"swagger3":["23.0"],"docker":["24.0"],"t":["24.0","74.4"],"harbor":["24.0"],"latest":["24.0"],"instance":["24.0"],"driver":["24.0"],"internal":["24.0"],"load":["24.0"],"dockerignore":["24.0"],"transferring":["24.0"],"context":["24.0"],"done":["24.0"],"0s":["24.0"],"definition":["24.0"],"dockerfile":["24.0"],"539b":["24.0"],"io":["24.0"],"duxinglangzi":["24.0"],"alpine":["24.0"],"java11":["24.0"],"60mb":["24.0"],"4s":["24.0"],"run":["24.0"],"ln":["24.0"],"sf":["24.0"],"usr":["24.0"],"share":["24.0"],"zoneinfo":["24.0"],"asia":["24.0"],"shanghai":["24.0"],"etc":["24.0"],"localtime":["24.0"],"cached":["24.0"],"mkdir":["24.0"],"p":["24.0"],"workdir":["24.0"],"add":["24.0","45.1"],"2s":["24.0"],"opentelemetry":["24.0"],"javaagent":["24.0"],"arthas":["24.0"],"exporting":["24.0"],"image":["24.0"],"layers":["24.0"],"3s":["24.0"],"writing":["24.0"],"sha256":["24.0"],"b3f3032d24c1fd8a9b754a466ff3752f95f88fef600c7b15a72558f40375df4b":["24.0"],"naming":["24.0"],"login":["24.0"],"admin":["24.0"],"kbk6gspk8323ke639ilgqe":["24.0"],"password":["24.0"],"via":["24.0"],"cli":["24.0"],"insecure":["24.0"],"stdin":["24.0"],"will":["24.0"],"stored":["24.0"],"unencrypted":["24.0"],"lib":["24.0"],"json":["24.0"],"configure":["24.0"],"helper":["24.0"],"remove":["24.0"],"docs":["24.0"],"engine":["24.0"],"reference":["24.0"],"commandline":["24.0"],"store":["24.0"],"succeeded":["24.0"],"push":["24.0"],"refers":["24.0"],"d13869d0912e":["24.0"],"preparing":["24.0"],"12f16e5ab9ae":["24.0"],"2dedde4f174d":["24.0"],"5f70bf18a086":["24.0"],"37044c4bf4ce":["24.0"],"2e9c3dcb4310":["24.0"],"7dfcf721d46c":["24.0"],"018a9e842966":["24.0"],"bfbf3abdb35e":["24.0"],"c4d1b17971e5":["24.0"],"b311f6059b1e":["24.0"],"6b0ac22b586f":["24.0"],"4ce9227a27cf":["24.0"],"d17fd464e7c5":["24.0"],"bde76260b707":["24.0"],"54016b302478":["24.0"],"eb525327e85b":["24.0"],"3d18e271d2a5":["24.0"],"bb1b4953a69d":["24.0"],"8c2deaf64810":["24.0"],"34d5ebaa5410":["24.0"],"waiting":["24.0"],"layer":["24.0"],"already":["24.0"],"exists":["24.0"],"pushed":["24.0"],"digest":["24.0"],"32c96c17caca556b45ec7706d4740133c7498acb1bc80f04fbac831e57749d8d":["24.0"],"size":["24.0"],"rmi":["24.0"],"untagged":["24.0"],"deleted":["24.0"],"kubectl":["24.0"],"n":["24.0"],"rollout":["24.0"],"restart":["24.0"],"deployment":["24.0"],"apps":["24.0"],"restarted":["24.0"],"每次代码变更后运行":["25.0"],"验证应用的稳定性":["25.0"],"用户接受测试":["25.0"],"user":["25.0"],"acceptance":["25.0"],"uat":["25.0"],"验证应用是否满足业务需求和用户期望":["25.0"],"通常由实际用户或业务人员手动进行":["25.0"],"集中在应用的最终状态下":["25.0"],"确保功能符合实际使用场景":["25.0"],"注":["25.0"],"更关注应用的各个组件及其交互":["25.0"],"旨在捕捉和纠正界面上的错误和不一致性":["25.0"],"覆盖整个应用的完整流程":["25.0"],"从前端到后端":["25.0"],"确保系统整体的功能和用户体验":["25.0"],"学习之外的东西":["28.0"],"useeventlistener":["29.1"],"并与之前的资源管理方式进行对比":["30.0"],"在关闭资源时抛出的异常可能会被忽略":["30.1"],"隐藏了原始异常":["30.1"],"资源的作用域和声明清晰":["30.3"],"提高了代码的可读性和可维护性":["30.3"],"动态调整核心线程数以适应业务需求的变化":["32.3"],"需要通过压力测试和性能调优来确定合适的最大线程数":["32.4"],"以满足业务需求的高并发和可靠性要求":["32.5"],"fuck":["33.2"],"不一定是直接的父元素":["36.0"],"体验产品":["39.2"],"业务同学也认为单个sku表单更合理":["39.2"],"结果几乎是把elform的核心校验逻辑走了一遍":["39.3"],"注意":["40.4"],"出于安全考虑":["40.4"],"不应该将所有环境变量都注入到客户端代码中":["40.4"],"比如vuecli中":["40.4"],"只有那些以":["40.4"],"或自定义前缀":["40.4"],"开头的变量才会被注入":["40.4"],"以避免敏感信息泄露":["40.4"],"通过这种方式":["40.4"],"结合":["40.4"],"插件可以实现类似vue":["40.4"],"cli的":["40.4"],"文件环境变量注入功能":["40.4"],"使得不同的环境配置可以轻松地在构建过程中使用":["40.4"],"somevalue":["40.5"],"flutter":["42.0"],"demo":["42.0"],"hello":["43.1"],"同步调用":["43.1"],"h":["44.1"],"unzip":["44.1"],"o":["44.1"],"home":["44.1"],"lighthouse":["44.1"],"dist":["44.1"],"cp":["44.1"],"rf":["44.1"],"zip":["44.1"],"运行":["44.1"],"参考连接":["44.1"],"list":["45.0"],"用法":["45.0"],"put":["45.1"],"rightlist":["45.1"],"pod启动的影响":["46.2"],"若是webrtc重新createoffer":["47.2"],"替换轨道需要用发起重启createoffer":["47.2"],"编排和管理容器化应用程序":["48.1"],"大大简化了部署和运维工作":["48.1"],"提高了应用程序的可靠性":["48.1"],"可伸缩性和可移植性":["48.1"],"从而加速了企业向云原生应用程序和微服务架构的转型":["48.1"],"从而实现无停机部署":["48.3"],"总的来说":["48.3"],"在应用了上述配置后":["48.3"],"会自动处理应用程序的部署":["48.3"],"扩缩容":["48.3"],"恢复":["48.3"],"更新等生命周期管理任务":["48.3"],"只需要关注应用程序本身的开发和构建":["48.3"],"而无需处理太多的运维逻辑":["48.3"],"不过":["48.3"],"如果有特殊的需求或要对":["48.3"],"进行更多定制":["48.3"],"还是需要了解更多关于":["48.3"],"的知识":["48.3"],"这些container共享pod的资源":["48.5"],"分数相同的情况下按年龄升序排序":["51.11"],"此语句用于根据学生的年龄将他们分为三个等级":["51.12"],"并按姓名升序排列":["51.12"],"并且只返回第2到第3条记录":["51.13"],"平均值":["51.14"],"最大值和最小值":["51.14"],"并按班级编号分组":["51.15"],"表中每个班级每次考试的学生总数":["51.16"],"并按班级编号和考试编号分组":["51.16"],"表中总成绩超过150分的班级":["51.17"],"并显示这些班级的编号和总成绩":["51.17"],"的学生的学号":["51.19"],"姓名及其姓名的大写形式":["51.19"],"维护难度增加":["51.23"],"关闭严格模式可能会使得数据库的行为与预期不符":["51.23"],"增加维护和调试的难度":["51.23"],"正确解决方式":["51.23"],"统一sql版本":["51.23"],"并根据具体情况和需求选择是否使用":["53.0"],"在编写位运算代码时":["53.0"],"应注重代码的可读性":["53.0"],"可维护性和可移植性":["53.0"],"并添加适当的注释和文档说明":["53.0"],"混合开发带来的安全问题":["55.1"],"打包工具使用":["55.1"],"缺点":["55.1"],"mac系统无法兼容":["55.1"],"基于":["55.1"],"net框架":["55.1"],"以下以word插件展开讲":["55.1"],"com加载项结合webview2":["55.1"],"的技术选型":["55.1"],"vsto插件":["55.5"],"强制保存文档时发生错误":["56.2"],"在执行强制保存操作时出现错误":["56.2"],"只读模式":["56.4"],"js":["58.0"],"esm导出":["58.1"],"适配webpack3":["58.1"],"建议用umd格式导出":["58.1"],"filename":["58.1"],"better":["58.1"],"jssip":["58.1"],"输出文件名":["58.1"],"output":["58.2"],"globals":["58.2"],"min":["58.3"],"逐渐成为主流":["58.4"],"在特定场景有其价值":["58.4"],"而":["58.4"],"主要用于":["58.4"],"开发者应根据项目需求和目标环境选择合适模块格式":["58.4"],"沙箱都会重新初始化":["59.2"],"来处理子应用之间的数据共享":["59.6"],"单词本内":["60.1"],"单词增加":["60.1"],"模糊查词":["60.1"],"单词发音":["60.1"],"customwordsservice":["60.5"],"getdictionariesbyxmlworkbookid":["60.5"],"resultutils":["60.5"],"success":["60.5"],"wordbookid":["60.6"],"workbookid":["60.6"],"对前端开发友好些":["61.1"],"gradle":["61.2"],"plugin":["61.2"],"mavenlocal":["61.2"],"mavencentral":["61.2"],"jcenter":["61.2"],"中间出啥问题":["61.2"],"doctor":["61.2"],"一下":["61.2"],"按照指令处理就可以啦":["61.2"],"此时":["62.0"],"adb设备也不报错了":["62.0"],"true":["64.1","65.8"],"某个页面需要单开的场景":["64.1"],"setid":["65.7"],"package":["65.8"],"com":["65.8"],"sky":["65.8"],"entity":["65.8"],"configuration":["65.8"],"开启驼峰命名":["65.8"],"map":["65.8"],"underscore":["65.8"],"to":["65.8"],"camel":["65.8"],"case":["65.8"],"生命周期钩子函数":["69.1"],"通知开发者渲染已完成":["69.1"],"需要注意的是":["69.1"],"vue使用了异步更新策略来优化性能":["69.1"],"它会将多个同步的数据变更操作合并为一个更新任务":["69.1"],"以减少不必要的dom操作":["69.1"],"这样可以提高性能并避免频繁的ui更新":["69.1"],"总结起来":["69.1"],"vue的渲染阶段会在事件循环的任务队列执行完毕后进行":["69.1"],"在渲染阶段":["69.1"],"vue会比对虚拟dom":["69.1"],"并最终对真实的dom进行操作":["69.1"],"完成渲染过程":["69.1"],"获取原始对象":["69.4"],"8d":["70.0"],"e7":["70.0"],"bd":["70.0"],"ae":["70.0"],"web3d":["70.0"],"webgl":["70.4"],"loader":["70.4"],"pipeline":["70.4"],"以提高加载性能和减少网络传输时间":["70.5"],"图片压缩webp格式":["70.5"],"使用drc加载":["70.5"],"bamg":["70.7"],"webassembly":["70.19"],"webgpu等技术":["70.19"],"硕士研究生及以上学历":["70.19"],"相关方向或者基础学科专业":["70.19"],"线性代数":["70.21"],"alt":["70.24"],"text":["70.24"],"system":["72.6"],"注册失败":["72.6"],"数据库错误":["72.6"],"return":["72.6"],"getid":["72.6"],"你在某个出版社出书":["73.0"],"相当于出版社以及出版社的其他作者给":["73.0"],"你在书对应的细分领域的心智垄断":["73.0"],"做背书":["73.0"],"你在行业会议演讲":["73.0"],"相当于会议方以及与会的其他演讲嘉宾给":["73.0"],"你在演讲主题对应的细分领域的心智垄断":["73.0"],"两者都是极高效建立心智垄断的手段":["73.0"],"不看百度":["74.1"],"csdn":["74.1"],"深入理解本质的技术点后":["74.1"],"不只是靠模糊的调试和随机的尝试":["74.1"],"能成倍提高效率":["74.1"],"好的方面":["74.1"],"脸皮变厚了":["74.1"],"但是没有写清楚为什么不看了":["74.2"],"也应该留存一些笔记":["74.2"],"过后翻阅":["74.2"],"并制定了实施这些建议的计划":["74.3"],"it":["74.4"],"don":["74.4"],"settle":["74.4"],"赶路的同时":["74.4"],"也要边享受生活":["74.4"],"服务端请求中访问vue实例":["76.1"],"nuxt2不可行":["76.1"],"服务端钩子中组件没有实例化":["76.1"],"还拿不到组件上面的方法":["76.1"],"语义化标签":["76.1"],"如果跨域子域名加载怎么做":["76.2"],"rbac1表设计":["76.2"],"几张表":["76.2"],"作用是什么":["76.2"],"关联关系是什么":["76.2"],"k8s启动一个pod":["76.2"],"cicd配置流程":["76.2"],"但是因为它的高度差不是说特别大":["76.3"],"而且是纯文本":["76.3"],"这个问题就基本不存在":["76.3"],"排版可能存在与wps不一致问题":["76.6"],"wordpress":["77.0"],"ghost":["77.0"],"个月":["80.0"],"天前":["80.0"],"显示结果":["80.0"]}]'},n={"0.0":{t:"# Runtime API Examples\r",p:"This page demonstrates usage of some of the runtime APIs provi ...",l:"api-examples.html",a:"runtime-api-examples"},"0.1":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.2":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.3":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.4":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;




`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.5":{t:"Results\r",p:"\r",l:"api-examples.html#results",a:"results"},"0.6":{t:"Theme Data\r",p:`&lt;pre&gt;{{ theme }}&lt;/pre&gt;
`,l:"api-examples.html#theme-data",a:"theme-data"},"0.7":{t:"Page Data\r",p:`&lt;pre&gt;{{ page }}&lt;/pre&gt;
`,l:"api-examples.html#page-data",a:"page-data"},"0.8":{t:"Page Frontmatter\r",p:`&lt;pre&gt;{{ frontmatter }}&lt;/pre&gt;
`,l:"api-examples.html#page-frontmatter",a:"page-frontmatter"},"0.9":{t:"More\r",p:"Check out the documentation for the full list of runtime APIs. ...",l:"api-examples.html#more",a:"more"},"1.0":{t:"两行代码 运行LLM\r",p:`\r
\r`,l:"blogs/ai/ollama.html",a:"两行代码-运行llm"},"1.1":{t:"项目\r",p:`ollama
`,l:"blogs/ai/ollama.html#项目",a:"项目"},"1.2":{t:"运行\r",p:`win11 wsl Ubuntu22
curl -fsSL https://ollama.com/install.sh |  ...`,l:"blogs/ai/ollama.html#运行",a:"运行"},"2.0":{t:"# stable-diffusion-ui实操\r",p:`cmd_args 参数集合
修改 webui-user.bat里
set COMMANDLINE_ARGS=--no-gra ...`,l:"blogs/ai/sdui.html",a:"stable-diffusion-ui实操"},"3.0":{t:"# 生成式ai\r",p:"",l:"blogs/ai/生成式ai.html",a:"生成式ai"},"3.1":{t:"多维数据向量存储词性\r",p:"",l:"blogs/ai/生成式ai.html#多维数据向量存储词性",a:"多维数据向量存储词性"},"3.2":{t:"自注意力 \r",p:`避免生成错误
`,l:"blogs/ai/生成式ai.html#自注意力",a:"自注意力"},"3.3":{t:"rag、微调（后训练）\r",p:"\r",l:"blogs/ai/生成式ai.html#rag、微调-后训练",a:"rag、微调-后训练"},"3.4":{t:"合同审查\r",p:`ChatGPT
LLM（Legal Language Models）是一种利用自然语言处理和机器学习技术来处理法律文本的方法 ...`,l:"blogs/ai/生成式ai.html#合同审查",a:"合同审查"},"4.0":{t:"# 算法\r",p:"\r",l:"blogs/anything/alogorethm.html",a:"算法"},"4.1":{t:"快速排序\r",p:"\r",l:"blogs/anything/alogorethm.html#快速排序",a:"快速排序"},"4.2":{t:"partion\r",p:`
划分子数组
左子数组任意元素 &lt; 右子数组任意元素
基准初始为left
双指针 从左往右查找大于基准的数，从右往左查 ...`,l:"blogs/anything/alogorethm.html#partion",a:"partion"},"4.3":{t:"哨兵算法优化",p:"",l:"blogs/anything/alogorethm.html#哨兵算法优化",a:"哨兵算法优化"},"5.0":{t:"# 原理\r",p:"",l:"blogs/anything/block-chain.html",a:"原理"},"5.1":{t:"加密、数字签名\r",p:"",l:"blogs/anything/block-chain.html#加密、数字签名",a:"加密、数字签名"},"5.2":{t:"哈希、默克尔树\r",p:"",l:"blogs/anything/block-chain.html#哈希、默克尔树",a:"哈希、默克尔树"},"5.3":{t:"共识算法\r",p:"",l:"blogs/anything/block-chain.html#共识算法",a:"共识算法"},"5.4":{t:"基于共识的智能合约\r",p:`solidty 确保语言的确定性
the dao ico 360w以太币·
`,l:"blogs/anything/block-chain.html#基于共识的智能合约",a:"基于共识的智能合约"},"6.0":{t:"<!-- 跨境电商\r",p:`明通
免税店
总代理 不给货

大宗商品？

店铺资源 供应链 资金
供应商货物 品质稳定
--&gt;
&lt;!-- 结 ...`,l:"blogs/anything/commercial.html",a:"跨境电商"},"7.0":{t:"# linux 设置sh定时任务\r",p:`打开定时任务脚本列表

sudo crontab -e

0 0 * * * /path/to/myscript.sh


 ...`,l:"blogs/anything/crontab.html",a:"linux-设置sh定时任务"},"8.0":{t:"# 跨域\r",p:"\r",l:"blogs/anything/crossOrigin.html",a:"跨域"},"8.1":{t:"定义\r",p:"",l:"blogs/anything/crossOrigin.html#定义",a:"定义"},"8.2":{t:"接口拦截请求\r",p:"",l:"blogs/anything/crossOrigin.html#接口拦截请求",a:"接口拦截请求"},"8.3":{t:"iframe无法操作\r",p:"",l:"blogs/anything/crossOrigin.html#iframe无法操作",a:"iframe无法操作"},"8.4":{t:"webassembly无法开启多线程",p:"",l:"blogs/anything/crossOrigin.html#webassembly无法开启多线程",a:"webassembly无法开启多线程"},"9.0":{t:"# element-plus\r",p:"\r",l:"blogs/anything/element-plus.html",a:"element-plus"},"9.1":{t:"构建脚本参观\r",p:`执行build脚本

gulp定义了系列任务
rollup执行系列任务

`,l:"blogs/anything/element-plus.html#构建脚本参观",a:"构建脚本参观"},"10.0":{t:"coding\r",p:`


en
zh




Alternatives
替代品


Suspense
悬念


user interface ( ...`,l:"blogs/anything/english.html",a:"coding"},"10.1":{t:"life\r",p:`
can i connect you on wechat

`,l:"blogs/anything/english.html#life",a:"life"},"11.0":{t:"# 测试环境表结构同步到生产环境\r",p:`Dump with Format 导出ddl 整体表结构的sql 使用 选择性update
`,l:"blogs/anything/flyaway.html",a:"测试环境表结构同步到生产环境"},"12.0":{t:"使用frp实现内网穿透管理物联网设备 - 知乎-知乎文章\r",p:`需要配置服务器 服务端
使用花生壳免费版
`,l:"blogs/anything/frp.html",a:"使用frp实现内网穿透管理物联网设备-知乎-知乎文章"},"13.0":{t:"> 课代表立正\r",p:"",l:"blogs/anything/gpt.html",a:"课代表立正"},"13.1":{t:"gpt4 目前有代差\r",p:`
技术发展是s型曲线，举例计算机产生有5次
表象差距大 实际背后差距可能更大
数据处理能力、工程能力、用户数正反馈 已经让o ...`,l:"blogs/anything/gpt.html#gpt4-目前有代差",a:"gpt4-目前有代差"},"14.0":{t:"- static关键字\r",p:`
静态变量在以下情况下比较合适：

共享数据：当某个数据需要在类的所有实例之间共享时，静态变量非常有用。例如，一个类代表一个 ...`,l:"blogs/anything/java.html",a:"static关键字"},"15.0":{t:"# Jenkins gitee cicd 配置\r",p:`

安装jenkins镜像 注意使用开源版本
时区变量 -e PHP_TZ=&quot;Asia/Shanghai&quot ...`,l:"blogs/anything/jenkins.html",a:"jenkins-gitee-cicd-配置"},"15.1":{t:"jenkins下 node多版本构建",p:"",l:"blogs/anything/jenkins.html#jenkins下-node多版本构建",a:"jenkins下-node多版本构建"},"16.0":{t:"# 联系我\r",p:`
邮箱: yaolinhong1024@gmail.com
github：github link
留言

`,l:"blogs/anything/link-me.html",a:"联系我"},"17.0":{t:"# h1 Heading 8-)\r",p:"",l:"blogs/anything/markdown-demo.html",a:"h1-heading-8"},"17.1":{t:"h2 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h2-heading",a:"h2-heading"},"17.2":{t:"h3 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h3-heading",a:"h3-heading"},"17.3":{t:"h4 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h4-heading",a:"h4-heading"},"17.4":{t:"h5 Heading\r",p:"",l:"blogs/anything/markdown-demo.html#h5-heading",a:"h5-heading"},"17.5":{t:"h6 Heading\r",p:`\r
\r`,l:"blogs/anything/markdown-demo.html#h6-heading",a:"h6-heading"},"17.6":{t:"Horizontal Rules\r",p:`


`,l:"blogs/anything/markdown-demo.html#horizontal-rules",a:"horizontal-rules"},"17.7":{t:"Typographic replacements\r",p:`Enable typographer option to see result.
(c) (C) (r) (R) (tm)  ...`,l:"blogs/anything/markdown-demo.html#typographic-replacements",a:"typographic-replacements"},"17.8":{t:"Emphasis\r",p:`This is bold text
This is bold text
This is italic text
This i ...`,l:"blogs/anything/markdown-demo.html#emphasis",a:"emphasis"},"17.9":{t:"Blockquotes\r",p:`
Blockquotes can also be nested...

...by using additional gre ...`,l:"blogs/anything/markdown-demo.html#blockquotes",a:"blockquotes"},"17.10":{t:"Lists\r",p:`Unordered

Create a list by starting a line with +, -, or *
Su ...`,l:"blogs/anything/markdown-demo.html#lists",a:"lists"},"17.11":{t:"Code\r",p:`Inline code
Indented code
// Some comments
line 1 of code
line ...`,l:"blogs/anything/markdown-demo.html#code",a:"code"},"17.12":{t:"Tables\r",p:`


Option
Description




data
path to data files to supply th ...`,l:"blogs/anything/markdown-demo.html#tables",a:"tables"},"17.13":{t:"Links\r",p:`link text
link with title
Autoconverted link https://github.co ...`,l:"blogs/anything/markdown-demo.html#links",a:"links"},"17.14":{t:"Images\r",p:`!Minion
!Stormtroopocat
Like links, Images also have a footnot ...`,l:"blogs/anything/markdown-demo.html#images",a:"images"},"17.15":{t:"Plugins\r",p:"The killer feature of markdown-it is very effective support of ...",l:"blogs/anything/markdown-demo.html#plugins",a:"plugins"},"17.16":{t:"Emojies\r",p:`
Classic markup: :wink: :cry: :laughing: :yum:
Shortcuts (emot ...`,l:"blogs/anything/markdown-demo.html#emojies",a:"emojies"},"17.17":{t:"Subscript / Superscript\r",p:`
19^th^
H~2~O

`,l:"blogs/anything/markdown-demo.html#subscript-superscript",a:"subscript-superscript"},"17.18":{t:"\\<ins>\r",p:`++Inserted text++
`,l:"blogs/anything/markdown-demo.html#ins",a:"ins"},"17.19":{t:"\\<mark>\r",p:`==Marked text==
`,l:"blogs/anything/markdown-demo.html#mark",a:"mark"},"17.20":{t:"Footnotes\r",p:`Footnote 1 link[^first].
Footnote 2 link[^second].
Inline foot ...`,l:"blogs/anything/markdown-demo.html#footnotes",a:"footnotes"},"17.21":{t:"Definition lists\r",p:`Term 1
:   Definition 1
with lazy continuation.
Term 2 withinl ...`,l:"blogs/anything/markdown-demo.html#definition-lists",a:"definition-lists"},"17.22":{t:"Abbreviations\r",p:`This is HTML abbreviation example.
It converts &quot;HTML&quot ...`,l:"blogs/anything/markdown-demo.html#abbreviations",a:"abbreviations"},"17.23":{t:"Custom containers\r",p:`::: warning
here be dragons
:::
`,l:"blogs/anything/markdown-demo.html#custom-containers",a:"custom-containers"},"18.0":{t:"主要后端方法\r",p:`
getLeftListExport

 private List&lt;Map&lt;String, Object&gt; ...`,l:"blogs/anything/materialBookGen.html",a:"主要后端方法"},"19.0":{t:"# js中调用c++方法\r",p:"\r",l:"blogs/anything/node-addon.html",a:"js中调用c-方法"},"19.1":{t:"实现方式\r",p:`
使用node addons
node官方的 examples 使用步骤

npm install g node-gyp，对 ...`,l:"blogs/anything/node-addon.html#实现方式",a:"实现方式"},"19.2":{t:"\r",p:`npm install g node-gyp
`,l:"blogs/anything/node-addon.html#",a:""},"20.0":{t:"# api\r",p:`一些优质的官方prompt
https://platform.openai.com/examples


fine-tune ...`,l:"blogs/anything/openai-api.html",a:"api"},"21.0":{t:"- React设计原理\r",p:`
框架原理概览

mustache语法 重UI轻逻辑
jsx
React 应用级框架 优化放在运行时
Vue 可以应用AOT ...`,l:"blogs/anything/reading.html",a:"react设计原理"},"22.0":{t:"分割一切的py\r",p:`图形分割
`,l:"blogs/anything/segment-anything.html",a:"分割一切的py"},"23.0":{t:"Springboot 配置篇\r",p:`!Alt text


多环境配置（点击可以切换环境）
pom.xml
     &lt;profiles&gt;
     ...`,l:"blogs/anything/spring-boot.html",a:"springboot-配置篇"},"24.0":{t:"项目启动\r",p:`
启动依赖安装问题

从pom.xml中看java、maven版本
本机java版本也要与项目要求java版本一致
内网包无 ...`,l:"blogs/anything/spring-cloud.html",a:"项目启动"},"25.0":{t:"测试类型\r",p:`


测试类型
目的
工具
特点




前端测试





单元测试（Unit Testing）
测试单个组件或函数的正确 ...`,l:"blogs/anything/test.html",a:"测试类型"},"26.0":{t:"# 工作日志\r",p:"\r",l:"blogs/anything/work-todo.html",a:"工作日志"},"26.1":{t:"todo\r",p:`
管端配置项
[bug修改]标注bug修改 uat发布

`,l:"blogs/anything/work-todo.html#todo",a:"todo"},"26.2":{t:"已完成",p:"",l:"blogs/anything/work-todo.html#已完成",a:"已完成"},"27.0":{t:"# 第三方服务\r",p:`下面从价格角度分析一下
`,l:"blogs/anything/第三方.html",a:"第三方服务"},"27.1":{t:"WPS\r",p:`
标准版
!alt text
私有云 大约3年30w 1个license

`,l:"blogs/anything/第三方.html#wps",a:"wps"},"27.2":{t:"腾讯云IM\r",p:`
!alt text
按年 3w一年

`,l:"blogs/anything/第三方.html#腾讯云im",a:"腾讯云im"},"27.3":{t:"使用体验\r",p:"\r",l:"blogs/anything/第三方.html#使用体验",a:"使用体验"},"27.4":{t:"正确的第三方服务使用姿势",p:"",l:"blogs/anything/第三方.html#正确的第三方服务使用姿势",a:"正确的第三方服务使用姿势"},"28.0":{t:"# 知识库\r",p:`内容导航

Coding / Learning Record 代码 学习记录
Tools 好用的工具
Anything 分享 ...`,l:"blogs/blogs.html",a:"知识库"},"29.0":{t:"# eventListener\r",p:"\r",l:"blogs/bugs/eventListener.html",a:"eventlistener"},"29.1":{t:"destory没有销毁eventListener\r",p:`触发方法，使用浏览器的回退按钮 那么会重新new一个组件；正常业务操作 无法复现；
引申出来 vue的最佳实践
useEve ...`,l:"blogs/bugs/eventListener.html#destory没有销毁eventlistener",a:"destory没有销毁eventlistener"},"30.0":{t:"# try-with-resources优化资源管理\r",p:"在Java编程中，资源管理是一个至关重要的环节，它直接关系到程序的稳定性和性能。Java 7引入了一种新的资源管理语句——& ...",l:"blogs/bugs/java-try-with-resources.html",a:"try-with-resources优化资源管理"},"30.1":{t:"传统资源管理的问题\r",p:"在Java 7之前，资源管理通常依赖于try-catch-finally结构。开发者需要在finally块中显式关闭资源，如 ...",l:"blogs/bugs/java-try-with-resources.html#传统资源管理的问题",a:"传统资源管理的问题"},"30.2":{t:"try-with-resources的引入\r",p:"Java 7的&quot;try-with-resources&quot;语句为这些问题提供了优雅的解决方案。它要求资源实现 ...",l:"blogs/bugs/java-try-with-resources.html#try-with-resources的引入",a:"try-with-resources的引入"},"30.3":{t:"优势分析\r",p:`
自动资源管理：资源在try块结束后自动关闭，无需手动调用close()。
减少资源泄漏：即使发生异常，资源也会被正确关闭， ...`,l:"blogs/bugs/java-try-with-resources.html#优势分析",a:"优势分析"},"30.4":{t:"示例对比\r",p:`考虑以下两个示例，一个是使用传统方式管理资源，另一个使用&quot;try-with-resources&quot;。
传统 ...`,l:"blogs/bugs/java-try-with-resources.html#示例对比",a:"示例对比"},"30.5":{t:"总结\r",p:"&quot;try-with-resources&quot;语句是Java资源管理的一大进步，它通过自动关闭资源简化了代码， ...",l:"blogs/bugs/java-try-with-resources.html#总结",a:"总结"},"31.0":{t:"# qiankun 子应用更新异常\r",p:`
现象

偶先页面渲染异常 css没加载完全、页面排版混乱


线索第二次进入 没有请求html

`,l:"blogs/bugs/qiankun-update-fail.html",a:"qiankun-子应用更新异常"},"31.1":{t:"其他\r",p:`
js级别的缓存解决方案

不缓存html



`,l:"blogs/bugs/qiankun-update-fail.html#其他",a:"其他"},"32.0":{t:"# backend interview questions\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html",a:"backend-interview-questions"},"32.1":{t:"自定义线程池\r",p:`
核心线程数
最大线程数
工作队列

在一个电商平台的后端系统中，假设我们需要设计一个用于处理订单的自定义线程池。核心线程数 ...`,l:"blogs/coding-learning-record/backend-interview.html#自定义线程池",a:"自定义线程池"},"32.2":{t:"业务场景：\r",p:`
核心业务场景：处理订单请求，包括验证订单信息、扣除库存、生成订单号等。
技术栈：Java后端开发，Spring框架。
核心 ...`,l:"blogs/coding-learning-record/backend-interview.html#业务场景",a:"业务场景"},"32.3":{t:"核心线程数（Core Pool Size）：\r",p:`
业务场景关联：核心线程数应该根据订单的日均请求量和处理时间来确定。对于一个电商平台，订单请求可能会呈现出明显的日周期性波动 ...`,l:"blogs/coding-learning-record/backend-interview.html#核心线程数-core-pool-size",a:"核心线程数-core-pool-size"},"32.4":{t:"最大线程数（Maximum Pool Size）：\r",p:`
业务场景关联：最大线程数应该根据系统的资源限制和预期的最大并发量来确定。在电商平台中，最大线程数的设置应该考虑服务器的CP ...`,l:"blogs/coding-learning-record/backend-interview.html#最大线程数-maximum-pool-size",a:"最大线程数-maximum-pool-size"},"32.5":{t:"工作队列（Work Queue）：\r",p:`
业务场景关联：工作队列用于存储尚未被执行的订单处理任务，应该能够满足高并发请求下的任务排队需求。在电商平台中，可以选择一个 ...`,l:"blogs/coding-learning-record/backend-interview.html#工作队列-work-queue",a:"工作队列-work-queue"},"32.6":{t:"OSI 七层模型是什么样的\r",p:`路由器工作在哪一层？
`,l:"blogs/coding-learning-record/backend-interview.html#osi-七层模型是什么样的",a:"osi-七层模型是什么样的"},"32.7":{t:"TCP 如何保证可靠连接？TCP 如何建立可靠的连接？三次握手的详细过程\r",p:"\r",l:"blogs/coding-learning-record/backend-interview.html#tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程",a:"tcp-如何保证可靠连接-tcp-如何建立可靠的连接-三次握手的详细过程"},"32.8":{t:"Effective Java 要点",p:"",l:"blogs/coding-learning-record/backend-interview.html#effective-java-要点",a:"effective-java-要点"},"33.0":{t:"# 词典实现\r",p:"\r",l:"blogs/coding-learning-record/baiduTranslate.html",a:"词典实现"},"33.1":{t:"需求背景\r",p:`
支持自添加单词的单词本，记录小孩的单词量；
支持分享单词本；家人范围内共享；
常规单词本功能、查词、发音

`,l:"blogs/coding-learning-record/baiduTranslate.html#需求背景",a:"需求背景"},"33.2":{t:"核心功能 - 实现概述\r",p:`
查词

百度翻译api申请 调用
ecdict  社区词典数据库


单词发音 TTS

使用社区免费的tts
使用社区开 ...`,l:"blogs/coding-learning-record/baiduTranslate.html#核心功能-实现概述",a:"核心功能-实现概述"},"34.0":{t:"# 规范git提交信息\r",p:"\r",l:"blogs/coding-learning-record/changelog.html",a:"规范git提交信息"},"34.1":{t:" git-cz\r",p:"\r",l:"blogs/coding-learning-record/changelog.html#git-cz",a:"git-cz"},"34.2":{t:"scope\r",p:`changeLog.json写法
todo
`,l:"blogs/coding-learning-record/changelog.html#scope",a:"scope"},"35.0":{t:"# 组件设计\r",p:`
避免冗余数据
单一职责（渲染列表 渲染组件）
数据流转清晰
代码逻辑 越少分支越好


`,l:"blogs/coding-learning-record/component-design.html",a:"组件设计"},"36.0":{t:"css踩坑\r",p:`
offsetTop是相对relative的父级 不一定是父元素


定位元素（position属性为relative、ab ...`,l:"blogs/coding-learning-record/css.html",a:"css踩坑"},"37.0":{t:"- depends_on 追加的服务可以在应用内直接映射访问\r",p:`


`,l:"blogs/coding-learning-record/docker-compose.html",a:"depends-on-追加的服务可以在应用内直接映射访问"},"38.0":{t:"# 常用docker操作\r",p:`
docker run build
docker run -i -t -p 3306:3306
&lt;!-- -  --& ...`,l:"blogs/coding-learning-record/docker.html",a:"常用docker操作"},"39.0":{t:"# 长列表大表单性能优化\r",p:"\r",l:"blogs/coding-learning-record/element-ui.html",a:"长列表大表单性能优化"},"39.1":{t:"业务场景\r",p:"vue2 项目 400个表单需要校验。每个表单有20个左右的校验项，多选，单选，input，图片上传组件。总的组件数有上万个 ...",l:"blogs/coding-learning-record/element-ui.html#业务场景",a:"业务场景"},"39.2":{t:"落地选型\r",p:`
虚拟列表路线

不定高度内容，快速滚动会产生高度跳变；虚拟列表滚动，调研中遇到了动态选10个显示 高度跳变的问题。也有解决 ...`,l:"blogs/coding-learning-record/element-ui.html#落地选型",a:"落地选型"},"39.3":{t:"技术难点\r",p:`
简略列表+单个sku表单

整体表单校验；使用nexTick方式，替换数据，循环赋值。
重写校验方法，引入validate ...`,l:"blogs/coding-learning-record/element-ui.html#技术难点",a:"技术难点"},"40.0":{t:"git# 前端项目多环境配置\r",p:`
重复多次的东西 总结成模板

`,l:"blogs/coding-learning-record/env.html",a:"git-前端项目多环境配置"},"40.1":{t:"cross-env 、dotenv\r",p:`为什么需要这两个库
set NODE_ENV=development
export NODE_ENV=development ...`,l:"blogs/coding-learning-record/env.html#cross-env-、dotenv",a:"cross-env-、dotenv"},"40.2":{t:"webpack5 多环境配置\r",p:`dotenv 注入环境成功 打包时 没有东西
`,l:"blogs/coding-learning-record/env.html#webpack5-多环境配置",a:"webpack5-多环境配置"},"40.3":{t:"vue-cli下多环境配置\r",p:`
方便的很
vue的脚手架会直接注入到项目代码中； vite会注入VITE_ 开头相关的变量；vue cli会注入VUE_开 ...`,l:"blogs/coding-learning-record/env.html#vue-cli下多环境配置",a:"vue-cli下多环境配置"},"40.4":{t:"vue-cli为什么这么方便 如何实现\r",p:`在Webpack中，使用DefinePlugin可以实现将.env文件中的环境变量注入到构建的代码中。以下是具体实现

安装 ...`,l:"blogs/coding-learning-record/env.html#vue-cli为什么这么方便-如何实现",a:"vue-cli为什么这么方便-如何实现"},"40.5":{t:"react的最佳实践\r",p:`

是否一般都是直接加载对应的js？
new webpack.DefinePlugin({
// 根据NODE_ENV环境变 ...`,l:"blogs/coding-learning-record/env.html#react的最佳实践",a:"react的最佳实践"},"41.0":{t:"# 前端代码规范\r",p:`
文件名建议全部连字符、否则git大小写有的折腾呢

`,l:"blogs/coding-learning-record/eslint.html",a:"前端代码规范"},"42.0":{t:"# calculator\r",p:`使用flutter构建的计算器demo

若flutter doctor 不通过；使用java8；
anroid-studi ...`,l:"blogs/coding-learning-record/flutter-demo.html",a:"calculator"},"43.0":{t:"# GO语言\r",p:"\r",l:"blogs/coding-learning-record/GO.html",a:"go语言"},"43.1":{t:"协程\r",p:`
package main

import (
	&quot;fmt&quot;
	&quot;time&quot;
)

 ...`,l:"blogs/coding-learning-record/GO.html#协程",a:"协程"},"44.0":{t:"# Docker nginx Dockerfile https配置 \r",p:`前置步骤

安装DockerFile
安装DockerCompose
获取ssl证书、sl证书解析配置

`,l:"blogs/coding-learning-record/https.html",a:"docker-nginx-dockerfile-https配置"},"44.1":{t:"步骤\r",p:`
yourServiceName、youdomin替换成你自己的
证书下载 腾讯云

&lt;!-- DockerFile  ...`,l:"blogs/coding-learning-record/https.html#步骤",a:"步骤"},"45.0":{t:"lambda表达式 java\r",p:`        iDsSpaceAreaService.lambdaUpdate()
                .eq ...`,l:"blogs/coding-learning-record/java.html",a:"lambda表达式-java"},"45.1":{t:"stream api\r",p:`替换for循环的高级方法

topCateGroup.forEach((topCateName, dgsList) -&gt ...`,l:"blogs/coding-learning-record/java.html#stream-api",a:"stream-api"},"46.0":{t:"# 前端项目 jenkins构建脚本优化DockerFile\r",p:"\r",l:"blogs/coding-learning-record/jenkins.html",a:"前端项目-jenkins构建脚本优化dockerfile"},"46.1":{t:"DockerFile\r",p:`TODO
`,l:"blogs/coding-learning-record/jenkins.html#dockerfile",a:"dockerfile"},"46.2":{t:"遇到的问题\r",p:`每次都要整体全部构建、之前的依赖包没法复用；
可能的优化方案：

jenkins只触发docker restart 而不重新 ...`,l:"blogs/coding-learning-record/jenkins.html#遇到的问题",a:"遇到的问题"},"47.0":{t:"# jssip-renegotiaton、FreeSwitch探索\r",p:`&lt;!-- 仓库名称 vue_fs_meeting --&gt;
webrtc
jssip 是一个webrtc的封装库
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html",a:"jssip-renegotiaton、freeswitch探索"},"47.1":{t:"折腾的起因\r",p:`需要帮朋友解决renegotiaton的问题 玩了一下jssip的api
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾的起因",a:"折腾的起因"},"47.2":{t:"jssip\r",p:`关键api

监听renegotiate、reinvite事件
若是直接用浏览器RTC的api replaceTrack替换 ...`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#jssip",a:"jssip"},"47.3":{t:"折腾FreeSwitch\r",p:"\r",l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#折腾freeswitch",a:"折腾freeswitch"},"47.4":{t:"1. 安装\r",p:`windows下 下载msi 一路点安装即可 用管理员方式运行
`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_1-安装",a:"_1-安装"},"47.5":{t:"2.wss配置\r",p:`参考博客
并配置nginx之后 启动freeswitch （管理员方式启动）7443的端口；

`,l:"blogs/coding-learning-record/jssip-FreeSwitch-dev.html#_2-wss配置",a:"_2-wss配置"},"48.0":{t:"# k8s \r",p:`一个开源的容器编排平台
`,l:"blogs/coding-learning-record/k8s.html",a:"k8s"},"48.1":{t:"Kubernetes解决了什么问题:\r",p:`

应用程序部署和管理:

自动化应用程序的部署、扩缩容和滚动更新,减少了手动操作的风险和开销。
支持批量管理和编排多个应用 ...`,l:"blogs/coding-learning-record/k8s.html#kubernetes解决了什么问题",a:"kubernetes解决了什么问题"},"48.2":{t:"container - 容器运行时\r",p:`docker只是其中一种 还有  containerd、CRI-O 等
`,l:"blogs/coding-learning-record/k8s.html#container-容器运行时",a:"container-容器运行时"},"48.3":{t:"部署流程\r",p:`master安装k8s集群模式的包，node节点安装子节点需要的包
配置master、node节点
集群中直接根据配置文件起 ...`,l:"blogs/coding-learning-record/k8s.html#部署流程",a:"部署流程"},"48.4":{t:"主从机器\r",p:`master 集群 node 子节点
`,l:"blogs/coding-learning-record/k8s.html#主从机器",a:"主从机器"},"48.5":{t:"pod container\r",p:`Pod是Kubernetes中最小的可部署单元,它包含一个或多个container。
Pod中的所有container共享相 ...`,l:"blogs/coding-learning-record/k8s.html#pod-container",a:"pod-container"},"48.6":{t:"k8s下的前端容器方案\r",p:`TODO
`,l:"blogs/coding-learning-record/k8s.html#k8s下的前端容器方案",a:"k8s下的前端容器方案"},"49.0":{t:"# makeFile使用\r",p:"\r",l:"blogs/coding-learning-record/makeFile.html",a:"makefile使用"},"49.1":{t:"make\r",p:`
make build 执行build的命令

`,l:"blogs/coding-learning-record/makeFile.html#make",a:"make"},"50.0":{t:"# gitlab Merge Request\r",p:`
速览gitlab 的Mr功能 流程

`,l:"blogs/coding-learning-record/mergeRequest.html",a:"gitlab-merge-request"},"50.1":{t:"assign 谁对代码质量保证\r",p:"\r",l:"blogs/coding-learning-record/mergeRequest.html#assign-谁对代码质量保证",a:"assign-谁对代码质量保证"},"50.2":{t:"reviewer 一般是仓库有合并权限的人\r",p:"\r",l:"blogs/coding-learning-record/mergeRequest.html#reviewer-一般是仓库有合并权限的人",a:"reviewer-一般是仓库有合并权限的人"},"50.3":{t:"review界面\r",p:"\r",l:"blogs/coding-learning-record/mergeRequest.html#review界面",a:"review界面"},"50.4":{t:"merge之后的操作",p:"",l:"blogs/coding-learning-record/mergeRequest.html#merge之后的操作",a:"merge之后的操作"},"51.0":{t:"当然，以下是包含SQL习题的完整Markdown格式博客内容：\r",p:`MySQL 数据库引擎选择与SQL查询技巧
`,l:"blogs/coding-learning-record/mysql.html",a:"当然-以下是包含sql习题的完整markdown格式博客内容"},"51.1":{t:"摘要\r",p:"本文详细讨论了MySQL数据库中的两种存储引擎：InnoDB和MyISAM，并提供了它们在事务支持、外键、索引结构、查询性能 ...",l:"blogs/coding-learning-record/mysql.html#摘要",a:"摘要"},"51.2":{t:"存储引擎比较\r",p:"\r",l:"blogs/coding-learning-record/mysql.html#存储引擎比较",a:"存储引擎比较"},"51.3":{t:"InnoDB\r",p:`
事务支持：支持完整的事务处理。
外键：支持外键约束，有助于维护数据完整性。
索引结构：使用B+树的聚集索引，数据按主键聚集 ...`,l:"blogs/coding-learning-record/mysql.html#innodb",a:"innodb"},"51.4":{t:"MyISAM\r",p:`
事务：不支持事务。
外键：不支持外键。
索引结构：使用B+树的非聚集索引，存储数据地址。
查询性能：读取性能较好，写入和并 ...`,l:"blogs/coding-learning-record/mysql.html#myisam",a:"myisam"},"51.5":{t:"SQL查询技巧\r",p:"\r",l:"blogs/coding-learning-record/mysql.html#sql查询技巧",a:"sql查询技巧"},"51.6":{t:"聚合函数\r",p:`
SUM(), AVG(), MAX(), MIN(), COUNT()：用于数据聚合计算。

`,l:"blogs/coding-learning-record/mysql.html#聚合函数",a:"聚合函数"},"51.7":{t:"开窗函数\r",p:`
OVER(), PARTITION BY：用于计算分组内的数据。

`,l:"blogs/coding-learning-record/mysql.html#开窗函数",a:"开窗函数"},"51.8":{t:"JOIN操作\r",p:`
INNER JOIN：基于条件连接表。
LEFT JOIN, RIGHT JOIN：包括左表或右表的所有行，加上满足条件的 ...`,l:"blogs/coding-learning-record/mysql.html#join操作",a:"join操作"},"51.9":{t:"SQL习题及解答\r",p:"\r",l:"blogs/coding-learning-record/mysql.html#sql习题及解答",a:"sql习题及解答"},"51.10":{t:"选择不重复的班级ID和考试编号组合\r",p:`SELECT DISTINCT class_id, exam_num FROM student;

此语句用于从studen ...`,l:"blogs/coding-learning-record/mysql.html#选择不重复的班级id和考试编号组合",a:"选择不重复的班级id和考试编号组合"},"51.11":{t:"学生信息排序\r",p:"SELECT name, age, score FROM student ORDER BY score DESC, age  ...",l:"blogs/coding-learning-record/mysql.html#学生信息排序",a:"学生信息排序"},"51.12":{t:"学生年龄等级划分\r",p:`SELECT name, 
       CASE 
           WHEN age &gt; 60 THEN '老 ...`,l:"blogs/coding-learning-record/mysql.html#学生年龄等级划分",a:"学生年龄等级划分"},"51.13":{t:"学生年龄排序并截取信息\r",p:`SELECT name, age FROM student ORDER BY age ASC LIMIT 1, 3;

此语 ...`,l:"blogs/coding-learning-record/mysql.html#学生年龄排序并截取信息",a:"学生年龄排序并截取信息"},"51.14":{t:"汇总学生成绩\r",p:`SELECT 
    SUM(score) AS total_score, 
    AVG(score) AS avg_ ...`,l:"blogs/coding-learning-record/mysql.html#汇总学生成绩",a:"汇总学生成绩"},"51.15":{t:"班级平均成绩\r",p:"SELECT class_id, AVG(score) AS avg_score FROM student GROUP BY ...",l:"blogs/coding-learning-record/mysql.html#班级平均成绩",a:"班级平均成绩"},"51.16":{t:"每个班级每次考试的总学生人数\r",p:"SELECT class_id, exam_num, COUNT(*) AS total_num FROM student  ...",l:"blogs/coding-learning-record/mysql.html#每个班级每次考试的总学生人数",a:"每个班级每次考试的总学生人数"},"51.17":{t:"班级总成绩超过150分\r",p:`SELECT class_id, SUM(score) AS total_score 
FROM student 
GROU ...`,l:"blogs/coding-learning-record/mysql.html#班级总成绩超过150分",a:"班级总成绩超过150分"},"51.18":{t:"学生姓名和当前日期\r",p:`SELECT name, DATE() AS 当前日期 FROM student;

此语句用于选取student表中的学生 ...`,l:"blogs/coding-learning-record/mysql.html#学生姓名和当前日期",a:"学生姓名和当前日期"},"51.19":{t:"筛选特定姓名的学生并展示大写姓名\r",p:"SELECT id AS 'id', name AS 'name', UPPER(name) AS 'upper_name' ...",l:"blogs/coding-learning-record/mysql.html#筛选特定姓名的学生并展示大写姓名",a:"筛选特定姓名的学生并展示大写姓名"},"51.20":{t:" ",p:"",l:"blogs/coding-learning-record/mysql.html#",a:""},"51.21":{t:"错误处理与性能优化 -->\r",p:"",l:"blogs/coding-learning-record/mysql.html#错误处理与性能优化",a:"错误处理与性能优化"},"51.22":{t:"错误处理\r",p:"\r",l:"blogs/coding-learning-record/mysql.html#错误处理",a:"错误处理"},"51.23":{t:"关闭MySQL的Strict Mode\r",p:`

执行初始化数据库sql脚本，报错，编辑my.ini文件，注释掉或修改sql-mode配置。


解决的问题：

严格模式 ...`,l:"blogs/coding-learning-record/mysql.html#关闭mysql的strict-mode",a:"关闭mysql的strict-mode"},"51.24":{t:"SQL学习资源\r",p:`
SQL学习资源

`,l:"blogs/coding-learning-record/mysql.html#sql学习资源",a:"sql学习资源"},"51.25":{t:"结论\r",p:"根据应用需求选择合适的存储引擎。InnoDB适合需要事务支持和外键约束的场景，而MyISAM适合对读取速度有高要求的场景。同 ...",l:"blogs/coding-learning-record/mysql.html#结论",a:"结论"},"52.0":{t:"# Nacos\r",p:`服务治理
heimashangcheng
docker启动
`,l:"blogs/coding-learning-record/nacos.html",a:"nacos"},"52.1":{t:"服务注册\r",p:`!alt text
`,l:"blogs/coding-learning-record/nacos.html#服务注册",a:"服务注册"},"53.0":{t:"位运算\r",p:`https://poe.com/s/8e38IAssLMHBMCW3oRgp 优点
效率高：位运算是对二进制位的直接操作，比 ...`,l:"blogs/coding-learning-record/new-knowledge.html",a:"位运算"},"53.1":{t:"消除异步传染性\r",p:`需要在catch里面做逻辑处理

场景


如任意api 全局自动前端刷新token
react suspense

`,l:"blogs/coding-learning-record/new-knowledge.html#消除异步传染性",a:"消除异步传染性"},"53.2":{t:"非对称加密\r",p:`
rsa 公钥私钥配对
https中的加密 为啥需要证书？

`,l:"blogs/coding-learning-record/new-knowledge.html#非对称加密",a:"非对称加密"},"53.3":{t:"VO 、 DTO\r",p:`DTO（Data Transfer Object）和VO（Value Object）都是用于在系统之间传输数据的对象。
`,l:"blogs/coding-learning-record/new-knowledge.html#vo-、-dto",a:"vo-、-dto"},"54.0":{t:"# next.js \r",p:"\r",l:"blogs/coding-learning-record/next-js.html",a:"next-js"},"54.1":{t:"项目脚手架\r",p:`next-sse
体验一下国际服玩家的利器next.js

api
声明式router

`,l:"blogs/coding-learning-record/next-js.html#项目脚手架",a:"项目脚手架"},"54.2":{t:"sse功能开发\r",p:`
群聊实现demo
打字机推送效果

`,l:"blogs/coding-learning-record/next-js.html#sse功能开发",a:"sse功能开发"},"55.0":{t:"#  WPS、Office插件开发\r",p:"",l:"blogs/coding-learning-record/office-dev.html",a:"wps、office插件开发"},"55.1":{t:"技术选型\r",p:`

JS Api

高度可移植性：可以跨平台使用，支持Windows、Mac、iOS、Android等多个操作系统和设备。
 ...`,l:"blogs/coding-learning-record/office-dev.html#技术选型",a:"技术选型"},"55.2":{t:"面板配置\r",p:`ribbon配置

&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF- ...`,l:"blogs/coding-learning-record/office-dev.html#面板配置",a:"面板配置"},"55.3":{t:"业务开发\r",p:`&lt;!-- TODO --&gt;

`,l:"blogs/coding-learning-record/office-dev.html#业务开发",a:"业务开发"},"55.4":{t:"clickOne部署\r",p:`
clickOne部署自动更新



优点：
安装之后，更新服务器资源后
用户端每次重启word均会拉取最新版本word

 ...`,l:"blogs/coding-learning-record/office-dev.html#clickone部署",a:"clickone部署"},"55.5":{t:"构建兼容WPS、word的插件安装包\r",p:`
Advance installer
InnoSetup


好处:


安装可配置注册表、依赖项
一套代码、打包后一次性安 ...`,l:"blogs/coding-learning-record/office-dev.html#构建兼容wps、word的插件安装包",a:"构建兼容wps、word的插件安装包"},"55.6":{t:" ",p:"",l:"blogs/coding-learning-record/office-dev.html#",a:""},"55.7":{t:"插件效果\r",p:`


word插件
wps插件




&lt;img src=&quot;https://github.com/yaoli ...`,l:"blogs/coding-learning-record/office-dev.html#插件效果",a:"插件效果"},"55.8":{t:"过程中坑: \r",p:`
office文档机翻、社区参考资料少

`,l:"blogs/coding-learning-record/office-dev.html#过程中坑",a:"过程中坑"},"56.0":{t:"# onlyoffice\r",p:"\r",l:"blogs/coding-learning-record/onlyoffice.html",a:"onlyoffice"},"56.1":{t:"服务端渲染docx\r",p:`
文件服务 给onlyoffice editing服务提供文件 给对应加密信息
业务服务端 调用documentBuilde ...`,l:"blogs/coding-learning-record/onlyoffice.html#服务端渲染docx",a:"服务端渲染docx"},"56.2":{t:"接入cdn文件渲染\r",p:`
修改初始化中给onlyoffice服务的地址换成cdn url即可
修改callbackurl中持久化的操作 改为文件整体 ...`,l:"blogs/coding-learning-record/onlyoffice.html#接入cdn文件渲染",a:"接入cdn文件渲染"},"56.3":{t:"替换web-app 增加额外的js\r",p:`把构建好的web-app包 -v到docker内即可
`,l:"blogs/coding-learning-record/onlyoffice.html#替换web-app-增加额外的js",a:"替换web-app-增加额外的js"},"56.4":{t:"实现业务功能\r",p:`基于js替换、iframe处理可以做到以下功能
排版模式
更细颗粒度地控制了编辑的权限
&lt;table&gt;
&lt; ...`,l:"blogs/coding-learning-record/onlyoffice.html#实现业务功能",a:"实现业务功能"},"57.0":{t:"****",p:"",l:"blogs/coding-learning-record/openai-note.html",a:""},"58.0":{t:"# 打包你的js sdk\r",p:`场景： 需要二次封装一个js库 输出一个自己的库
&lt;!-- 安装依赖 --&gt;
pnpm add webpack  ...`,l:"blogs/coding-learning-record/package-sdk.html",a:"打包你的js-sdk"},"58.1":{t:"webpack配置\r",p:`&lt;!-- webpack.config.js --&gt;
const TerserPlugin = require( ...`,l:"blogs/coding-learning-record/package-sdk.html#webpack配置",a:"webpack配置"},"58.2":{t:"vite配置\r",p:`// vite.config.ts
    build: {
        // outDir: 'dist',
     ...`,l:"blogs/coding-learning-record/package-sdk.html#vite配置",a:"vite配置"},"58.3":{t:"如何引入sdk\r",p:`配置 config.externals
const externalConfig = [
    {
        nam ...`,l:"blogs/coding-learning-record/package-sdk.html#如何引入sdk",a:"如何引入sdk"},"58.4":{t:"构建产物格式\r",p:`

UMD (Universal Module Definition)

定义: UMD 是一种模块定义规范，旨在兼容多种模 ...`,l:"blogs/coding-learning-record/package-sdk.html#构建产物格式",a:"构建产物格式"},"59.0":{t:"# qiankun 源码解析\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html",a:"qiankun-源码解析"},"59.1":{t:"css隔离\r",p:`实现子应用之间的样式隔离
experimentalStyleIsolation
shadow dom
主应用影响子应用的类名 ...`,l:"blogs/coding-learning-record/qiankun.html#css隔离",a:"css隔离"},"59.2":{t:"js隔离\r",p:`SnapshotSandbox
ProxySandbox
app 环境沙箱 app 环境沙箱是指应用初始化过之后，应用会在什 ...`,l:"blogs/coding-learning-record/qiankun.html#js隔离",a:"js隔离"},"59.3":{t:"子应用加载方式\r",p:"无界获取子应用的脚本采用的是qiankun的import-html-entry方案，这个方案是通过正则表达式将 子应用的 h ...",l:"blogs/coding-learning-record/qiankun.html#子应用加载方式",a:"子应用加载方式"},"59.4":{t:"乾坤子应用keepalive\r",p:"\r",l:"blogs/coding-learning-record/qiankun.html#乾坤子应用keepalive",a:"乾坤子应用keepalive"},"59.5":{t:"缓存场景下 css加载404异常捕捉不到的问题\r",p:`思路： debug 进一步定位抛错位置 尝试捕获到之后重试
`,l:"blogs/coding-learning-record/qiankun.html#缓存场景下-css加载404异常捕捉不到的问题",a:"缓存场景下-css加载404异常捕捉不到的问题"},"59.6":{t:"状态管理\r",p:`qiankun 提供了集中式的状态管理方案，它通过 props 和全局状态对象来实现子应用之间的通信和状态共享。
singl ...`,l:"blogs/coding-learning-record/qiankun.html#状态管理",a:"状态管理"},"60.0":{t:"# 润词典\r",p:`
[!TIP]
旨在陪伴kids
私有单词库
科学review
互动式学英语
场景例句巩固

`,l:"blogs/coding-learning-record/rdic.html",a:"润词典"},"60.1":{t:"进度汇总\r",p:`&lt;!-- 1. 2023年12月2日21点49分   --&gt;
单词本下面增加分类


后端

新增分类接口
分类 ...`,l:"blogs/coding-learning-record/rdic.html#进度汇总",a:"进度汇总"},"60.2":{t:"项目介绍\r",p:`
v0.0.1
查询词典、发音
加入分享、私有单词库（默认所有人可以编辑）
分享编辑单词库

`,l:"blogs/coding-learning-record/rdic.html#项目介绍",a:"项目介绍"},"60.3":{t:"接口\r",p:"",l:"blogs/coding-learning-record/rdic.html#接口",a:"接口"},"60.4":{t:"添加单词本\r",p:`注意isDelete字段 数据库需要设置默认值0 然后需要添加
@TableLogic
private Integer is ...`,l:"blogs/coding-learning-record/rdic.html#添加单词本",a:"添加单词本"},"60.5":{t:"私有单词本内-单词分页查询\r",p:`使用mybatis page获取 第一个参数默认传分页参数
第一个参数传分页参数
    /**
     * 根据 id  ...`,l:"blogs/coding-learning-record/rdic.html#私有单词本内-单词分页查询",a:"私有单词本内-单词分页查询"},"60.6":{t:" 接口实现\r",p:"    &lt;select id=&quot;getDictionariesByWorkbookId&quot; resu ...",l:"blogs/coding-learning-record/rdic.html#接口实现",a:"接口实现"},"61.0":{t:"# reactNative\r",p:"\r",l:"blogs/coding-learning-record/reactNative-start.html",a:"reactnative"},"61.1":{t:"rn 和 flutter对比  \r",p:`
rn 大厂使用比较多 flutter 中小厂使用比较多
flutter 增长趋势较好
rn 社区活跃度较高 js技术栈
总 ...`,l:"blogs/coding-learning-record/reactNative-start.html#rn-和-flutter对比",a:"rn-和-flutter对比"},"61.2":{t:"reactNative安装  \r",p:`powershell管理员执行
Set-ExecutionPolicy Bypass -Scope Process -For ...`,l:"blogs/coding-learning-record/reactNative-start.html#reactnative安装",a:"reactnative安装"},"62.0":{t:"按照官网文档部署即可\r",p:`npx react-native doctor


sdk 设置系统环境变量 sdk 、platform tools、com ...`,l:"blogs/coding-learning-record/reactNative.html",a:"按照官网文档部署即可"},"63.0":{t:"# java版本管理 \r",p:"\r",l:"blogs/coding-learning-record/sdk-manage.html",a:"java版本管理"},"63.1":{t:"idea\r",p:`比较方便 有界面操作
`,l:"blogs/coding-learning-record/sdk-manage.html#idea",a:"idea"},"63.2":{t:"本地环境java版本\r",p:`jabba install openjdk@1.17.0
jabba install openjdk@1.11.0
jabb ...`,l:"blogs/coding-learning-record/sdk-manage.html#本地环境java版本",a:"本地环境java版本"},"64.0":{t:"# shared-worker\r",p:"\r",l:"blogs/coding-learning-record/shared-worker.html",a:"shared-worker"},"64.1":{t:"shared-worker-demo\r",p:`git仓库 / 在线 demo
功能：多个不同tab页面之间数据交互
落地场景：


electron render进程之间 ...`,l:"blogs/coding-learning-record/shared-worker.html#shared-worker-demo",a:"shared-worker-demo"},"64.2":{t:"参考资料\r",p:`mdn demo
`,l:"blogs/coding-learning-record/shared-worker.html#参考资料",a:"参考资料"},"65.0":{t:"# 苍穹外卖\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html",a:"苍穹外卖"},"65.1":{t:"SSM实践\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#ssm实践",a:"ssm实践"},"65.2":{t:"pojo 数据库实体 dto entity vo\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#pojo-数据库实体-dto-entity-vo",a:"pojo-数据库实体-dto-entity-vo"},"65.3":{t:"common 全局异常处理 通用包装类等\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#common-全局异常处理-通用包装类等",a:"common-全局异常处理-通用包装类等"},"65.4":{t:"server 项目主体\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#server-项目主体",a:"server-项目主体"},"65.5":{t:"AutoFill注解\r",p:"\r",l:"blogs/coding-learning-record/sky-take-out.html#autofill注解",a:"autofill注解"},"65.6":{t:"mybatis插件\r",p:`mybatisX 安装之后 设置schema 有代码提示

其他功能

官网文档




后端的代码 写起来好丝滑

`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis插件",a:"mybatis插件"},"65.7":{t:"entity中的 @Builder注解\r",p:`/**

@Builder 注解 构建器
用于创建对象
如实现类中
Employee employee = Employee ...`,l:"blogs/coding-learning-record/sky-take-out.html#entity中的-builder注解",a:"entity中的-builder注解"},"65.8":{t:"mybatis 配置\r",p:`update动态sql
    &lt;update id=&quot;update&quot; parameterType ...`,l:"blogs/coding-learning-record/sky-take-out.html#mybatis-配置",a:"mybatis-配置"},"66.0":{t:"# su7项目学习笔记\r",p:"\r",l:"blogs/coding-learning-record/su7.html",a:"su7项目学习笔记"},"66.1":{t:"3d模型格式\r",p:`fbx、usdz（新的）
glb、gltf（模型材质分开的）
`,l:"blogs/coding-learning-record/su7.html#_3d模型格式",a:"_3d模型格式"},"66.2":{t:"一些工具\r",p:`three.js相机编辑器
[模型下载网站]
(sketchfab.com/feed)
`,l:"blogs/coding-learning-record/su7.html#一些工具",a:"一些工具"},"66.3":{t:"模型加载\r",p:`gltfLoader
hdr图 模型贴图 照明
`,l:"blogs/coding-learning-record/su7.html#模型加载",a:"模型加载"},"66.4":{t:"反射效果\r",p:`
？？
cubeCamera
？？

`,l:"blogs/coding-learning-record/su7.html#反射效果",a:"反射效果"},"66.5":{t:"blender建模\r",p:`

模型裁切

车子模型轮子部分



材质贴图

地面
隧道

隧道粒子贴图ps制作





`,l:"blogs/coding-learning-record/su7.html#blender建模",a:"blender建模"},"67.0":{t:"type-challenges",p:"",l:"blogs/coding-learning-record/typescript.html",a:"type-challenges"},"68.0":{t:"组件二次封装\r",p:`hooks
坑

onMounted问题解决
全局样式覆盖

`,l:"blogs/coding-learning-record/vue-ui-component.html",a:"组件二次封装"},"69.0":{t:"keep alive\r",p:`
实现原理
微前端场景下如何服用子Vue实例的component
嵌套路由场景下 keep alive的问题

解决方案

 ...`,l:"blogs/coding-learning-record/vue3.html",a:"keep-alive"},"69.1":{t:"nextTick\r",p:`

一定能获取到更新之后的DOM吗

结论： 调用nextTick之前的同步任务，微任务队列排在nextTick之前的都能获 ...`,l:"blogs/coding-learning-record/vue3.html#nexttick",a:"nexttick"},"69.2":{t:" ",p:"",l:"blogs/coding-learning-record/vue3.html#",a:""},"69.3":{t:"forceUpdate -->\r",p:`&lt;!-- 在 --&gt;
`,l:"blogs/coding-learning-record/vue3.html#forceupdate",a:"forceupdate"},"69.4":{t:"unref 和 toRaw 有什么区别\r",p:`以下是自己测试之后的总结
unref是获取引用值 但并不会递归获取
toRaw是获取响应式对象的原始对象 会递归解开prox ...`,l:"blogs/coding-learning-record/vue3.html#unref-和-toraw-有什么区别",a:"unref-和-toraw-有什么区别"},"70.0":{t:"<!--\r",p:`
@Author: yaolinhong yaolinhong1024@gmail.com
@Date: 2023-09-2 ...`,l:"blogs/coding-learning-record/web3d.html",a:""},"70.1":{t:"three.js\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#three-js",a:"three-js"},"70.2":{t:"迭代日志\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#迭代日志",a:"迭代日志"},"70.3":{t:"2023-11-20\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-11-20",a:"_2023-11-20"},"70.4":{t:"Add\r",p:`feat: 模型压缩调研 gltf-transform
gltf-transform optimize ./revit.gl ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"70.5":{t:"压缩方式基本原理\r",p:`

减少模型的多边形数量：多边形数量越多，模型的复杂度和文件大小就会增加。你可以使用3D建模软件，如Blender或Maya ...`,l:"blogs/coding-learning-record/web3d.html#压缩方式基本原理",a:"压缩方式基本原理"},"70.6":{t:"2023-07-23\r",p:"",l:"blogs/coding-learning-record/web3d.html#_2023-07-23",a:"_2023-07-23"},"70.7":{t:"Add\r",p:`feat: revit模型渲染 mvp
预览 |
仓库地址
&lt;!-- 安装revit https://mp.weixi ...`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"70.8":{t:"2023-06-15\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#_2023-06-15",a:"_2023-06-15"},"70.9":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"70.10":{t:"Removed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#removed",a:"removed"},"70.11":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"70.12":{t:"Add -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#add",a:"add"},"70.13":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"70.14":{t:"Fixed -->\r",p:`&lt;!--
`,l:"blogs/coding-learning-record/web3d.html#fixed",a:"fixed"},"70.15":{t:" ",p:"",l:"blogs/coding-learning-record/web3d.html#",a:""},"70.16":{t:"Changed -->\r",p:"",l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"70.17":{t:"Changed\r",p:`我的three.js训练场

feat: 🎸 Metaverse游戏 按住空格 加速跑动 2023-06-15

`,l:"blogs/coding-learning-record/web3d.html#changed",a:"changed"},"70.18":{t:"learn webgpu\r",p:"\r",l:"blogs/coding-learning-record/web3d.html#learn-webgpu",a:"learn-webgpu"},"70.19":{t:"why learn\r",p:`贴一个吗目标公司岗位的jd；

某目标公司
webGL开发岗位职责:
开发和维护用于Web端设计工具的高性能图形系统，包括： ...`,l:"blogs/coding-learning-record/web3d.html#why-learn",a:"why-learn"},"70.20":{t:"learn what\r",p:`抽象几个关键的技术要素
WebGL API Web图形领域 CPU和GPU的性能优化方法；

熟练掌握基本的线性代数、几何、 ...`,l:"blogs/coding-learning-record/web3d.html#learn-what",a:"learn-what"},"70.21":{t:"how to learn\r",p:`主要目标

有业余开源项目供技术参考（找相关开源项目）
找webGL下的问题场景，直接解决相关的问题，提供commit

过 ...`,l:"blogs/coding-learning-record/web3d.html#how-to-learn",a:"how-to-learn"},"70.22":{t:"一些思考\r",p:"",l:"blogs/coding-learning-record/web3d.html#一些思考",a:"一些思考"},"70.23":{t:"什么场景需要web 3d\r",p:`最近看到v2ex上有人讨论宁德时代官网首页3d动画的技术实现，一看是直接放的video；

对于需要seo的页面来说，或许b ...`,l:"blogs/coding-learning-record/web3d.html#什么场景需要web-3d",a:"什么场景需要web-3d"},"70.24":{t:"learn from su7\r",p:`非常炫酷的3d效果 su7
按住屏幕 触发动画

车辆行驶空气的粒子效果
车轮转动效果
镜面反射效果

技术实现

shad ...`,l:"blogs/coding-learning-record/web3d.html#learn-from-su7",a:"learn-from-su7"},"70.25":{t:"learn from Three.js Journey\r",p:`Three.js Journey
`,l:"blogs/coding-learning-record/web3d.html#learn-from-three-js-journey",a:"learn-from-three-js-journey"},"71.0":{t:"# 微信相关业务逻辑\r",p:"\r",l:"blogs/coding-learning-record/wechat.html",a:"微信相关业务逻辑"},"71.1":{t:"微信公众号登陆\r",p:`!alt text

订阅号无法开通此接口
服务号必须通过微信认证

`,l:"blogs/coding-learning-record/wechat.html#微信公众号登陆",a:"微信公众号登陆"},"71.2":{t:"微信支付\r",p:`坑

native支付并不能用网站引用的appid申请

必须将微信支付id 绑定服务号或者订阅号的微信公众号id 才可以开 ...`,l:"blogs/coding-learning-record/wechat.html#微信支付",a:"微信支付"},"72.0":{t:"api开放平台\r",p:"",l:"blogs/coding-learning-record/yupi-learning-record.html",a:"api开放平台"},"72.1":{t:"gateway 模块 需要单独打开项目\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#gateway-模块-需要单独打开项目",a:"gateway-模块-需要单独打开项目"},"72.2":{t:"todo 整合到主项目启动\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#todo-整合到主项目启动",a:"todo-整合到主项目启动"},"72.3":{t:"mysql 执行sql插入报错 not null的字段没有写入 补充该字段\r",p:"\r",l:"blogs/coding-learning-record/yupi-learning-record.html#mysql-执行sql插入报错-not-null的字段没有写入-补充该字段",a:"mysql-执行sql插入报错-not-null的字段没有写入-补充该字段"},"72.4":{t:"注册接口的逻辑\r",p:`synchronized 关键字

加锁和释放锁 无论方法正常执行完毕还是抛出异常，都会释放锁
一把锁只能同时被一个线程获取 ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#注册接口的逻辑",a:"注册接口的逻辑"},"72.5":{t:"YuApiClient 调用接口上线报错\r",p:`原因 gateway挂了 远程调用失败
`,l:"blogs/coding-learning-record/yupi-learning-record.html#yuapiclient-调用接口上线报错",a:"yuapiclient-调用接口上线报错"},"72.6":{t:"invoke 报错\r",p:`
{
  &quot;code&quot;: 50000,
  &quot;data&quot;: null,
  &quo ...`,l:"blogs/coding-learning-record/yupi-learning-record.html#invoke-报错",a:"invoke-报错"},"73.0":{t:"# coding plan\r",p:`* 沉淀代码资产，不限于工具库、ui库
* 重视输出；
    * 少些demo项目 多些深入探索 
    * 要有产出成 ...`,l:"blogs/fe-sumary/2024-coding-plan.html",a:"coding-plan"},"74.0":{t:"2023 总结\r",p:"\r",l:"blogs/fe-sumary/2024-plan.html",a:"_2023-总结"},"74.1":{t:"这一年，我取得了一些不错的成绩。\r",p:`

技术钻研：

服务端渲染应用落地、docker compose部署、二开
用react的 useDapp 发布了自己的w ...`,l:"blogs/fe-sumary/2024-plan.html#这一年-我取得了一些不错的成绩。",a:"这一年-我取得了一些不错的成绩。"},"74.2":{t:" 当然，也有一些需要提升的地方。\r",p:`

任务管理：

目标管理意识较差、严格工时评估的能力差，需求评审不够严谨
松散的目标意识，如saas中，错误估计整体提测时 ...`,l:"blogs/fe-sumary/2024-plan.html#当然-也有一些需要提升的地方。",a:"当然-也有一些需要提升的地方。"},"74.3":{t:"朋友们的反馈和建议\r",p:`这里只挑点缺点讲
a: 有时候会眼高手低，得下场多做
b: 需求做的糙 思路是正确、效率也ok 但得深入点细节和产品、测试对 ...`,l:"blogs/fe-sumary/2024-plan.html#朋友们的反馈和建议",a:"朋友们的反馈和建议"},"74.4":{t:"新的一年的计划：\r",p:`
持续长跑 按季度复盘

娱乐消遣控制在每周2天左右
学习打卡 每周至少3天  时间不限 需要有学习产出的记录（笔记、代码库 ...`,l:"blogs/fe-sumary/2024-plan.html#新的一年的计划",a:"新的一年的计划"},"75.0":{t:"# 上上份工作难点\r",p:"\r",l:"blogs/fe-sumary/qd-fe.html",a:"上上份工作难点"},"75.1":{t:"等保三级处理（国家级）\r",p:"",l:"blogs/fe-sumary/qd-fe.html#等保三级处理-国家级",a:"等保三级处理-国家级"},"75.2":{t:"onlyoffice项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#onlyoffice项目",a:"onlyoffice项目"},"75.3":{t:"c# webview word插件项目\r",p:"",l:"blogs/fe-sumary/qd-fe.html#c-webview-word插件项目",a:"c-webview-word插件项目"},"75.4":{t:"小程序项目 \r",p:"",l:"blogs/fe-sumary/qd-fe.html#小程序项目",a:"小程序项目"},"75.5":{t:"websocket im优化 （前端消息确认）\r",p:`



Description




背景



难点



选型
sse、轮询、ws？


落地



总结




`,l:"blogs/fe-sumary/qd-fe.html#websocket-im优化-前端消息确认",a:"websocket-im优化-前端消息确认"},"75.6":{t:"jssip 实时音频交互处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#jssip-实时音频交互处理",a:"jssip-实时音频交互处理"},"75.7":{t:"trtc 视频流处理\r",p:"",l:"blogs/fe-sumary/qd-fe.html#trtc-视频流处理",a:"trtc-视频流处理"},"75.8":{t:"electron项目",p:"",l:"blogs/fe-sumary/qd-fe.html#electron项目",a:"electron项目"},"76.0":{t:"# 最近一份工作的难点\r",p:"\r",l:"blogs/fe-sumary/xz-fe.html",a:"最近一份工作的难点"},"76.1":{t:"seo、服务端渲染\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#seo、服务端渲染",a:"seo、服务端渲染"},"76.2":{t:"微前端\r",p:`


&lt;div style=&quot;width:30px&quot;&gt;  &lt;/div&gt;
Desc ...`,l:"blogs/fe-sumary/xz-fe.html#微前端",a:"微前端"},"76.3":{t:"虚拟列表 性能优化\r",p:`
列表方案
不定高度？（从下往上滑动 页面抖动、删除节点页面跳动）

复杂业务代码改造，（item 处理为计算属性）
一些个 ...`,l:"blogs/fe-sumary/xz-fe.html#虚拟列表-性能优化",a:"虚拟列表-性能优化"},"76.4":{t:"动画、多页面响应式适配、i18n\r",p:`

动态rem；


所有图片加载完成之后进入页面
i18n


总结： rem有局限性吗？ TODO
`,l:"blogs/fe-sumary/xz-fe.html#动画、多页面响应式适配、i18n",a:"动画、多页面响应式适配、i18n"},"76.5":{t:"小程序路由权限校验\r",p:`

首页路由切换闪烁


公共组件库处理 二次封装组件；支持透传slot attrs props等（原生组件有坑）


`,l:"blogs/fe-sumary/xz-fe.html#小程序路由权限校验",a:"小程序路由权限校验"},"76.6":{t:"weboffice定制功能\r",p:`
只允许排版功能


iframe 限制

electron

太生硬 用户接受程度


chrome插件

分发问题 -  ...`,l:"blogs/fe-sumary/xz-fe.html#weboffice定制功能",a:"weboffice定制功能"},"77.0":{t:"# 博客系统推荐\r",p:`面向前端同学：
可以使用默认布局 可基于vue扩展
vitepress vue-theme-hope
SEO友好、框架无关
 ...`,l:"blogs/tools/blog-dev.html",a:"博客系统推荐"},"78.0":{t:"# 使用linux命令\r",p:`&lt;!-- node程序的进程 --&gt;
ps -ef | grep node
&lt;!-- 解压到当前文件夹 - ...`,l:"blogs/tools/linux.html",a:"使用linux命令"},"79.0":{t:"# postman 快速导入swagger接口",p:"",l:"blogs/tools/postman.html",a:"postman-快速导入swagger接口"},"80.0":{t:"``` javascript\r",p:`// 也可以用dayjs的插件
// 获取当前时间 与目标时间的diff
export function calculate ...`,l:"blogs/tools/time.html",a:"javascript"},"82.0":{t:"#  https://gitee.com/ylh1995/Blog/pages",p:"",l:"readme.html",a:"https-gitee-com-ylh1995-blog-pages"}},t={previewLength:62,buttonLabel:"Search",placeholder:"Search docs",allow:[],ignore:[]},r={INDEX_DATA:e,PREVIEW_LOOKUP:n,Options:t};export{r as default};
